{"docs": 186, "results": [{"sentences": ["Figures like mogul Donald Trump, social conservative Michele Bachmann and pizza magnate Herman Cain have all been brief favourites on the back of a strong anti-Romney sentiment among conservatives, despite being seen as unelectable by most experts."], "tags": ["US elections 2012", "Republicans", "US news", "US politics", "World news", "Barack Obama"], "webUrl": "https://www.theguardian.com/world/2012/jan/01/republicans-iowa-feelgood-factor", "publicationDate": "2012-01-01T00:05:00Z", "title": "Republicans fear return of the feelgood factor as Iowa caucus nears"}, {"sentences": ["Root wants series with &quot;emotional warmth&quot;, and defends The History of US&apos;s use of celebrities, including Donald Trump, Michael Douglas, Meryl Streep and Colin Powell, commenting on American achievements, on the grounds that &quot;you have to work for your audience."], "tags": ["Independent production companies", "US television industry", "Television industry", "Media", "BBC", "BBC2", "Television & radio"], "webUrl": "https://www.theguardian.com/media/2012/jan/08/jane-root-interview", "publicationDate": "2012-01-08T20:59:00Z", "title": "Jane Root interview: 'You have to work for your audience'"}, {"sentences": ["Donald Trump."], "tags": ["Ricky Gervais", "Golden Globes 2012"], "webUrl": "https://www.theguardian.com/culture/filmblog/2012/jan/13/ricky-gervais-golden-globes-host", "publicationDate": "2012-01-13T15:12:00Z", "title": "How to host the Golden Globes: an open letter to Ricky Gervais"}, {"sentences": ["Donald Trump."], "tags": ["Ricky Gervais", "Golden Globes 2012"], "webUrl": "https://www.theguardian.com/culture/filmblog/2012/jan/13/ricky-gervais-golden-globes-host", "publicationDate": "2012-01-13T15:12:00Z", "title": "How to host the Golden Globes: an open letter to Ricky Gervais"}, {"sentences": ["Donald Trump is on the brink of abandoning his plans for the &quot;world&apos;s greatest golf course&quot; near Aberdeen after claiming his £750m project is being threatened by an offshore windfarm.", "That building would, Trump said, eventually be replaced by a large, &quot;super-luxury&quot; clubhouse, for which Aberdeenshire council has just granted planning permission.", "But Trump&apos;s threats are fuelling suspicions that he is using the windfarm, known as the European offshore wind deployment centre, as a reason to abandon the golf resort rather than admit the project is no longer viable or affordable.", "Initially an enthusiastic supporter of Trump, Salmond has refused to intervene over the windfarm, which has already been substantially reduced in scale.", "In a statement issued from his New York headquarters, Trump said: &quot;All further plans for future development, including the hotel, are now on hold until the Scottish government makes a decision on the application for the European offshore wind deployment centre submitted by Vattenfall and Areg [Aberdeen renewable energy group].", "&quot;If the north-east of Scotland is serious about tourism and creating a global golf destination it cannot allow the coastline to be ruined by an ugly industrial park (11 64-storey test turbines) directly off the shoreline.&quot; Trump admitted in June that the global recession had forced him to delay construction of the five-star hotel, apartments and large luxury housing estate, which were at the centre of the resort plans.", "Trump is now linking the delay to the windfarm, a position he did not take in June.", "David Milne, an immediate neighbour and a critic of Trump, who has resisted pressure to sell his home to the developer, said: &quot;I firmly believe he is just trying to sell.", "Suspicions about Trump&apos;s tactics have intensified because there have been clear signals that the windfarm project is extremely likely to be approved, as it is central to the Scottish government&apos;s strategy of making the country a global leader in windfarm technologies.", "The £200m project, which will be 2.5km (1.5 miles)south-east of the Menie estate coastline, is also being championed by many of Trump&apos;s prominent supporters in Aberdeenshire.", "The consortium behind it includes Aberdeenshire council, which backs Trump&apos;s resort.", "Trump&apos;s director of international development, George Sorial, denied Trump was using the windfarm as an excuse to abandon the project.", "Trump&apos;s threat was designed to underline his determination to resist the wind farm, he said."], "tags": ["Donald Trump", "Scotland", "Golf", "Wind power", "Recession", "US news", "Environment", "Renewable energy", "World news", "UK news", "Sport", "Conservation", "Endangered habitats"], "webUrl": "https://www.theguardian.com/world/2012/jan/18/donald-trump-scottish-golf-resort", "publicationDate": "2012-01-18T19:02:00Z", "title": "Donald Trump may fail to follow through on Scottish golf resort plan"}, {"sentences": ["And talking of jazz...Android / iPhone / iPad Jazz: Trump&apos;s Journey Alas, nothing to do with Donald."], "tags": ["Apps", "iPhone", "Android", "iPad", "Windows Phone", "BlackBerry", "Mobile phones", "Smartphones", "Tablet computers", "Media", "Technology", "Wikipedia", "Michael Owen", "Football", "Manchester United"], "webUrl": "https://www.theguardian.com/technology/appsblog/2012/jan/19/apps-rush-wikipedia-michael-owen", "publicationDate": "2012-01-19T10:11:00Z", "title": "Apps Rush: Wikipedia, Michael Owen, Soul Calibur, Tribe, Niko, FourFourTwo, Hatchi and more"}, {"sentences": ["And talking of jazz...Android / iPhone / iPad Jazz: Trump&apos;s Journey Alas, nothing to do with Donald."], "tags": ["Apps", "iPhone", "Android", "iPad", "Windows Phone", "BlackBerry", "Mobile phones", "Smartphones", "Tablet computers", "Media", "Technology", "Wikipedia", "Michael Owen", "Football", "Manchester United"], "webUrl": "https://www.theguardian.com/technology/appsblog/2012/jan/19/apps-rush-wikipedia-michael-owen", "publicationDate": "2012-01-19T10:11:00Z", "title": "Apps Rush: Wikipedia, Michael Owen, Soul Calibur, Tribe, Niko, FourFourTwo, Hatchi and more"}, {"sentences": ["Snooker Judd Trump beat Ronnie O&apos;Sullivan to reach the semi-finals of the BGC Masters at Alexandra Palace, London.", "Trump, the game&apos;s rising star and the UK champion, raced into a 4-0 lead at the mid-session interval in the best-of-11 match.", "Although O&apos;Sullivan improved after the resumption – amassing a tournament-best break of 141 – Trump picked up the frames required for a 6-2 victory.", "The four-times champion O&apos;Sullivan failed to live up to the promise of a first-round win over the reigning champion, Ding Junhui, but the rise of Trump continues and he will play Neil Robertson or Mark Williams in the final four.", "&quot;I&apos;ve come into it full of confidence and thinking I can win it, and the players are more under pressure playing me now than I am playing them, and they all really want to beat me now,&quot; Trump said."], "tags": ["Sport"], "webUrl": "https://www.theguardian.com/sport/2012/jan/19/sports-news-in-brief", "publicationDate": "2012-01-19T23:00:00Z", "title": "Sports news in brief"}, {"sentences": ["Don&apos;t advocate such postcode unfairness in the guise of Gladstone&apos;s &quot;efficiency&quot;; devolution is won through a battle for hearts and minds and the SNP&apos;s vision is one that has to prevail as part of the dream of a better Britain.Professor Craig RichardsonNorthumbria University • Anyone who imagines Alex Salmond is progressive needs to see Anthony Baxter&apos;s excellent documentary You&apos;ve Been Trumped.", "Donald Trump has sought to crush the rights of ordinary people who oppose his most recent vanity project – a gigantic golf resort on the Aberdeenshire coast, where a beautiful landscape of unique scientific significance is being destroyed.", "As the film shows, those who have stood in Trump&apos;s way have faced indifference, denigration and, at times, intimidation.", "It would be no exaggeration to say that Trump has no greater supporter in Scotland than the first minister.Jeremy HardyLondon • If this is Alex Salmond&apos;s idea of being a good neighbour, I am glad I don&apos;t live next door to him.", "It would have suited Messrs Trump and Soutar, though."], "tags": ["Scotland", "UK news", "Alex Salmond", "Politics", "Scottish National party (SNP)", "Labour", "Conservatives", "Liberal-Conservative coalition"], "webUrl": "https://www.theguardian.com/uk/2012/jan/25/snp-more-labour-than-labour", "publicationDate": "2012-01-25T21:00:02Z", "title": "Letters: How the SNP became more Labour than Labour"}, {"sentences": ["Open Mon-Sat 6pm-2am Trump Room     Photograph: duziem on Flickr/some rights reserved     First-time visitors can take a while to get their breath back when they arrive at this hipster playpen, housed in a rundown Shibuya building whose interior has been transformed into a mess of glitterballs, mirrors and stuffed animal heads."], "tags": ["Tokyo holidays", "Bars and clubs", "Japanese food and drink", "Japan holidays", "Clubbing", "Asia", "Travel", "Top 10s", "City breaks"], "webUrl": "https://www.theguardian.com/travel/2012/feb/01/top-10-clubs-bars-tokyo", "publicationDate": "2012-02-01T12:13:00Z", "title": "10 of the best bars and clubs in Tokyo"}, {"sentences": ["And in other rich guy news, Donald Trump."], "tags": ["US healthcare", "US news", "Women", "Breast cancer", "Society", "Health", "Planned Parenthood", "Susan G Komen for the Cure"], "webUrl": "https://www.theguardian.com/commentisfree/cifamerica/2012/feb/02/planned-parenthood-susan-g-komen-foundation-betrayal", "publicationDate": "2012-02-02T15:34:00Z", "title": "By defunding Planned Parenthood, the Susan G Komen Foundation betrays women | Lizz Winstead"}, {"sentences": ["Business magnate and champion self-publicist Donald Trump is set to endorse Republican presidential candidate today only two days before the Nevada primary, according to ABC news.", "Trump flew to Las Vegas on Wednesday night, setting off a flurry of reports by the US networks that now appear to be inaccurate: that he was about to back Romney&apos;s main rival Newt Gingrich.", "Trump&apos;s office said Wednesday he would make a major announcement today but declined to say what it would be.", "ABC quoted one of Trump&apos;s aides as saying he had been swithering over which candidate to back but phoned Romney&apos;s office before flying to Vegas.", "Trump toyed with the media last spring by claiming he was considering a presidential run and then resurrected the idea later in the year, saying he would run if there was no candidate in the field he considered worthy of the Republican nomination.", "Trump&apos;s endorsement carries little weight but is a good publicity opportunity for him, a chance to highlight the start of a new run of The Apprentice on February 19.", "Gingrich, asked about Trump&apos;s plans, said: &quot;I have no idea what the Donald is going to do."], "tags": ["Republican presidential nomination 2012", "Donald Trump", "US elections 2012", "US news", "US politics"], "webUrl": "https://www.theguardian.com/world/2012/feb/02/donald-trump-gingrich-romney-endorsement", "publicationDate": "2012-02-02T17:18:50Z", "title": "Donald Trump to give endorsement to frontrunner Mitt Romney"}, {"sentences": ["     Business magnate and champion self-publicist Donald Trump has endorsed Republican presidential Mitt Romney in an event of no importance but one that successfully diverted media attention from the other candidates only two days before the Nevada caucuses.", "Trump flew to Las Vegas on Wednesday saying he had a &quot;major announcement&quot; to make, a remark that resulted in a flurry of inaccurate reports in the US media that he was set to endorse Romney&apos;s main rival, Newt Gingrich.", "At a press conference at a Trump hotel in Las Vegas, he said: &quot;We really have an opportunity to do something great for the country.", "It&apos;s my honour, real honour, and privilege to endorse Mitt Romney.&quot; Although he has often criticised Romney in the past, Trump attempted to square this by saying he had not known him then and had only gotten to know him in the past few months.", "Last year, Trump described Romney as a &quot;small business guy&quot; who had not made anything like the wealth he had accumulated.", "Trump today described Romney as tough and sharp, and praised him for his combative stance towards trade with China.", "Romney, seemingly as bewildered as everyone else over why he was standing alongside Trump, acknowledged the bizarre nature of the occasion.", "This is one of them.&quot;  He acknowledged Trump&apos;s jibe last year about being the less successful of the two, at least in business.", "Romney, anticipating ridicule for his appearance alongside Trump, later issued a statement aimed at neutralising criticism, or at least putting it in perspective.", "He said the Trump endorsement was one of 2,500 he had received from elected officials, leaders and activists from across the country.Romney said: &quot;I am humbled by the endorsements I have received from Republicans across the political spectrum.&quot; The Ron Paul campaign put out a statement questioning the news value of the event.", "The Democratic National Committee also issued a statement, saying &quot;they both like firing people.&quot; The endorsement may finally bring an end to Trump&apos;s long tease in which he claimed he was considering joining the presidential race.", "Trump&apos;s is unlikely to sway many, if any, voters."], "tags": ["Mitt Romney", "Republican presidential nomination 2012", "Donald Trump", "US elections 2012", "Republicans", "Newt Gingrich", "US politics", "US news", "World news"], "webUrl": "https://www.theguardian.com/world/2012/feb/02/mitt-romney-wins-donald-trump-backing", "publicationDate": "2012-02-02T22:04:00Z", "title": "Mitt Romney wins backing of Donald Trump ahead of Nevada caucuses"}, {"sentences": ["The mystery of Donald Trump&apos;s endorsement of Mitt Romney is as large and complicated as his hair.", "First, there is the question of why Trump chose to endorse Romney at all.", "Around the same time, Trump took a view of Romney&apos;s work at Bain Capital lifted straight out of a Newt Gingrich ad, saying:  He walked away with some money from a very good company that he didn&apos;t create.", "Trump&apos;s dismissal of Romney made sense at the time.", "Though they share the same income bracket and the same affinity for firing people, Trump and Romney are, stylistically, from different planets.", "They couldn&apos;t even compete in the same Miss Universe pageant (a Trump franchise about as far removed from the Romney comfort zone as small talk or dancing).", "Aesthetically, Trump has much more in common with Newt Gingrich – though Gingrich has more ex-wives.", "Something about Gingrich resonated for Trump.", "Long after he bashed Romney&apos;s personality and resume, Trump lauded Gingrich.", "So Trump said in December.", "A month before, Trump defended Gingrich&apos;s immigration stance against criticism from those who favor strict deportation guidelines.", "Allowing the families of illegal immigrants to stay together is &quot;showing a lot of compassion&quot;, Trump told Fox News, saying that Gingrich&apos;s position would benefit him if he became the nominee:   With the overall electorate he did himself considerable good.", "Indeed, between the hair, the ego and the attitude, it&apos;s no wonder that many believed early reports that Trump&apos;s endorsement would go to Gingrich.", "What else might have influenced Trump?", "The pundits at ABC&apos;s the Note slyly pointed out that the next season Trump&apos;s &quot;Celebrity Apprentice&quot; airs on 19 February; the endorsement Thursday fell just right to both draw attention to Trump&apos;s Las Vegas properties and to keep him in the headlines prior to the premiere.", "Is Trump really crass enough for that kind of stunt?", "Let&apos;s go to Rick Santorum for some analysis:  I can&apos;t imagine Donald Trump being hypocritical.", "That would be totally out of character for Donald Trump.", "Trump&apos;s justification of his endorsement was atypically short and truly gnomic:  Mitt is tough, he&apos;s smart, he&apos;s sharp, he&apos;s not going to allow bad things to happen to this country that we all love.", "Trump&apos;s earlier explanations for whom he might wind up supporting are more enlightening.", "On the heels of Romney&apos;s decisive Florida win, Trump&apos;s bet on Romney is better-than-even odds.", "Polling shows Trump a net drag on any chosen candidate.", "Before the New Hampshire primary, an NBC poll found that a Trump endorsement would have a negative impact on 42% of that state&apos;s voters.", "A Pew poll found a Trump endorsement to have the most negative impact of any given by leading GOP figures.", "Could be that Romney campaign simply saw it as a chance to: 1) get that &quot;very poor&quot; story off the front page – of all the days on the campaign trail Romney might have been condemned to relive, it was probably the day before Groundhog Day that would have been the worst; and 2) rob Newt of the oxygen that would come if a rejected Trump took his ball and went to play at the neighbor&apos;s house.", "Romney&apos;s acceptance of Trump&apos;s patronage spoke to the moment&apos;s surreal qualities as much as to his gratitude:  There are some things you can&apos;t imagine happening in your life, and this is one of them.", "And Trump, for instance, might as well have been talking about how our trade competitors think of the US as how rivals might look at the press conference itself, when he said:  They take advantage of us, they laugh at us, they can&apos;t believe their good fortune. "], "tags": ["Donald Trump", "US news", "Republican presidential nomination 2012", "US politics", "Mitt Romney", "Newt Gingrich", "Rick Santorum"], "webUrl": "https://www.theguardian.com/commentisfree/ana-marie-cox-blog/2012/feb/03/mysteries-why-donald-trump-endorsed-romney", "publicationDate": "2012-02-03T19:46:00Z", "title": "The mysteries of Donald Trump's endorsement | Ana Marie Cox"}, {"sentences": ["Donald Trump and Mitt Romney in Nevada.", "Almost every Republican candidate had sought to win the &quot;Donald Trump Primary&quot; and trekked to New York to meet with the billionaire celebrity.", "Romney won and Trump endorsed him in Nevada with a huge amount of fanfare.", "Maybe Romney should have paid attention to a January poll from Pew who pointed out that more people (20%) said a Trump endorsement would put them off a candidate than said it would make them support one (13%)."], "tags": ["US elections 2012", "Republican presidential nomination 2012", "US news", "World news"], "webUrl": "https://www.theguardian.com/world/2012/feb/08/republican-endorsements-bum-note", "publicationDate": "2012-02-08T21:55:29Z", "title": "Why high-profile Republican endorsements have hit a bum note"}, {"sentences": ["The renewable energy industry has dismissed as &quot;trumped-up nonsense&quot; an attack by Donald Trump on Scottish wind energy projects.", "When asked in an interview on Thursday night about Trump&apos;s comments, Salmond replied only with a prediction that once renewable energy created a large number of jobs in Scotland, &quot;just about everybody will get on board, even Donald Trump&quot;.", "Trump is opposed to plans for an offshore windfarm near the site of his luxury golf resort in Aberdeenshire.", "In a letter sent to the first minister, Alex Salmond, Trump accused him of being &quot;hell-bent on destroying Scotland&apos;s coastline&quot;, and said he would halt work on his project until a decision on the windfarm was made by ministers.", "&quot;With the reckless installation of these monsters, you will single-handedly have done more damage to Scotland than virtually any event in Scottish history,&quot; Trump wrote.", "Niall Stuart, chief executive of Scottish Renewables, which represents the renewable energy industry in Scotland, criticised Trump&apos;s intervention, and said there was no reason why the two developments could not exist side by side.", "&quot;Who is Donald Trump to tell Scotland what is good for our economy and our environment?&quot; he said.", "&quot;People will be opposed for a whole variety of reasons but as we mobilise this industry, as we are established as world leaders, tens of thousands of jobs come to this country and as we re-industrialise this nation then, eventually, just about everybody will get on board, even Donald Trump.&quot; The Scottish government declined to respond directly to Trump&apos;s criticism, saying it was currently considering the views of interested parties in the project for 11 turbines in Aberdeen Bay, which has become the focus of Trump&apos;s ire.", "&quot;Unless he&apos;s going to put his golf course on the water, which seems unlikely.&quot; Trump&apos;s intervention follows the Scottish governments&apos; blueprint to help streamline the scope, planning and consent for offshore renewables developments.", "&quot;First Mr Trump accuses Scotland of being the laughing stock of the world,&quot; Rennie said.", "What Mr Trump needs to understand is that Scotland will live up to our responsibilities to tackle climate change.", "Instead of the world laughing at Scotland, Scotland is laughing at Mr Trump.&quot;"], "tags": ["Wind power", "Donald Trump", "Alex Salmond", "Renewable energy", "Energy", "Scotland", "Environment", "Scottish politics", "US news"], "webUrl": "https://www.theguardian.com/environment/2012/feb/10/scottish-renewable-energy-donald-trump", "publicationDate": "2012-02-10T11:51:57Z", "title": "Scottish renewable energy industry dismisses Donald Trump attack"}, {"sentences": ["Last week, when the first minister ought to have come under sustained pressure over his party&apos;s lamentable record of supporting small Scottish businesses, Donald Trump came to his rescue.", "Trump has been allowed by a cabal of local yokel Aberdeen politicians to destroy part of the north-east coastline by constructing one of his concrete casbahs and calling it a golf resort.", "Trump told the first minister that the world was laughing at him.", "Most of us, though, were laughing so much at the spectacle of Trump posing as an arbiter of good taste and aesthetics that we quite forgot why we were criticising the SNP."], "tags": ["Alex Salmond", "Scottish National party (SNP)", "Politics", "UK news", "Scotland", "Donald Trump", "Jeremy Paxman", "Nicola Sturgeon"], "webUrl": "https://www.theguardian.com/commentisfree/2012/feb/12/kevin-mckenna-alex-salmond-independence", "publicationDate": "2012-02-12T00:04:42Z", "title": "Alex Salmond can't lose in the face of such buffoonery | Kevin McKenna"}, {"sentences": ["Last week the billionaire Donald Trump also renewed his ongoing campaign against an offshore windfarm near the site of his luxury golf resort in Aberdeenshire, accusing the Scottish first minister, Alex Salmond, of being &quot;hell-bent on destroying Scotland&apos;s coastline&quot; and saying he would halt work on his resort until ministers made a decision on the turbines."], "tags": ["Wind power", "The National Trust", "UK news", "Energy", "Renewable energy", "Environment"], "webUrl": "https://www.theguardian.com/environment/2012/feb/14/national-trust-chairman-wind-power", "publicationDate": "2012-02-14T16:47:45Z", "title": "National Trust rejects chairman's anti-wind power comments"}, {"sentences": ["For those of us who have faith we were all created by the same Creator and therefore should respect ALL of his creations (yes, even Donald Trump!)."], "tags": ["Guardian sustainable business"], "webUrl": "https://www.theguardian.com/social-enterprise-network/2012/feb/15/best-links-of-the-web-wednesday-15-february", "publicationDate": "2012-02-15T11:21:18Z", "title": "Social enterprise network daily: Wednesday 15 february"}, {"sentences": ["&quot;Governor Johnson, if you had a reality TV show like Donald Trump does, what would it be?&quot; [Question at 53min 22sec]            (Bret Baier, Fox News | May 5, 2011 | Fox South Carolina Debate) 4."], "tags": ["Republican presidential nomination 2012", "US politics", "Republicans", "US television", "US television industry", "Media", "US news", "World news", "US elections 2012"], "webUrl": "https://www.theguardian.com/world/2012/feb/16/nine-quirkiest-questions-republican-debates", "publicationDate": "2012-02-16T18:54:00Z", "title": "The nine quirkiest questions from the Republican debates | Ana Maria Benedetti and Tracy Levy"}, {"sentences": ["&quot;Governor Johnson, if you had a reality TV show like Donald Trump does, what would it be?&quot; [Question at 53min 22sec]            (Bret Baier, Fox News | May 5, 2011 | Fox South Carolina Debate) 4."], "tags": ["Republican presidential nomination 2012", "US politics", "Republicans", "US television", "US television industry", "Media", "US news", "World news", "US elections 2012"], "webUrl": "https://www.theguardian.com/world/2012/feb/16/nine-quirkiest-questions-republican-debates", "publicationDate": "2012-02-16T18:54:00Z", "title": "The nine quirkiest questions from the Republican debates | Ana Maria Benedetti and Tracy Levy"}, {"sentences": ["Carlisle  2.00 South Leinster 2.30 Streamtown 3.05 Gleann Na Ndochais (nb) 3.40 Do It For Dalkey 4.10 Take Over Sivola 4.45 Diamond D&apos;Amour Wolverhampton 2.15 Magnitude 2.45 Flying Applause 3.20 Faithful Ruler 3.55 Croftamie 4.25 Warden Bond (nap) 5.00 Al Freej 5.30 Red Trump 6.00 Fleetwoodsands"], "tags": ["Horse racing", "Horse racing tips", "Sport"], "webUrl": "https://www.theguardian.com/sport/2012/feb/20/monday-tips-february-20-2012", "publicationDate": "2012-02-20T12:06:57Z", "title": "Monday's tips"}, {"sentences": ["While there has never been a moment when his frontrunner status has not faced a challenge, the challengers – from Donald Trump to Herman Cain – were scarcely plausible."], "tags": ["Barack Obama", "Mitt Romney", "Rick Santorum", "US politics", "Republican presidential nomination 2012", "World news", "US elections 2012"], "webUrl": "https://www.theguardian.com/commentisfree/cifamerica/2012/feb/20/barack-obama-lucky-with-enemies", "publicationDate": "2012-02-20T19:22:00Z", "title": "Barack Obama's lucky history of hapless opponents"}, {"sentences": ["News that Donald Trump was to fund the campaign against renewable energy in Scotland will provoke mixed emotions.", "An America tycoon, Trump has been objecting since September 2011 to plans to build an offshore windfarm near his luxury golf resort close to Aberdeen.", "Trump&apos;s £750m development on the Menie estate on the coast is at the centre of a storm about land ownership, democracy and the power of the filthy-rich.", "But now Trump is on the warpath.", "We have agreed to provide them with staff, with some of our team at our New York office working with them on a daily basis.&quot; I&apos;m tempted to suggest that the first thing that Trump gets his people to sort out is that logo.", "But the Trump golf fiasco is a potentially defining point for what sort of Scotland might emerge from the independence process.", "At one point first minister Alex Salmond seemed to be courting Donald Trump and his ilk, with rhetoric that &quot;Scotland was open for business&quot;.", "But earlier this month in a letter to Salmond, Trump blasted: &quot;You will single-handedly have done more damage to Scotland than any event in Scottish history.&quot; But the idea of Trump as good business versus loony-greens hellbent on no-jobs is nonsense.", "Niall Stuart, the chief executive of industry body Scottish Renewables, said: &quot;Who is Donald Trump to tell Scotland what is good for our economy and environment?", "Offshore wind is already attracting billions of pounds of investment and supporting hundreds of jobs across Scotland, including in his mother&apos;s hometown of Stornoway.&quot; But as the Trump jokes and controversy intensify – another much more positive wind-energy story has emerged further south.", "As Justin Kenrick of Pedal puts it: &quot;The question becomes not, &apos;are you for or against wind&apos;, but &apos;are you for or against society&apos;?&quot; The reality is that Trump has helped shape the alter-Scottish movement, whether it be from spawning film or tributes in poetry the cross-thatched business guru has created a useful iconic and defining focus."], "tags": ["Donald Trump", "Scotland", "Wind power", "Renewable energy", "Energy", "Environment", "Scottish politics", "Politics", "UK news", "World news"], "webUrl": "https://www.theguardian.com/commentisfree/2012/feb/24/donald-trump-wind-turbine-fiasco-scotland", "publicationDate": "2012-02-24T16:54:51Z", "title": "The Donald Trump wind turbine fiasco could be defining for Scotland | Mike Small"}, {"sentences": ["Not that Naomi Campbell, Cameron Diaz and Donald &quot;Disco&quot; Trump wouldn&apos;t have enjoyed your company, I&apos;m sure, but there are far less elitist, and far more accessible, ways of partying like it&apos;s 1979 virtually on your doorstep."], "tags": ["Dance music", "Pop and rock", "Music", "Culture"], "webUrl": "https://www.theguardian.com/music/2012/feb/26/disco-changed-world-for-ever", "publicationDate": "2012-02-26T00:06:07Z", "title": "How disco changed music for ever"}, {"sentences": ["Then there was his relationship with Donald Trump as the entire Scottish political class declared &quot;Scotland open for business&quot; and laid down before Trump&apos;s ambitions for a golf course in the sand dunes of north-east Scotland."], "tags": ["Alex Salmond", "Rupert Murdoch", "Scottish National party (SNP)", "Scotland", "Media", "Sun on Sunday", "The Sun", "Donald Trump", "Scottish politics", "News UK", "Politics", "National newspapers", "World news", "UK news"], "webUrl": "https://www.theguardian.com/commentisfree/2012/feb/26/alex-salmond-faustian-pact-murdoch", "publicationDate": "2012-02-26T15:01:00Z", "title": "Alex Salmond, beware this Faustian pact with Murdoch | Gerry Hassan"}, {"sentences": ["Everyone from Trump Hotels to McDonalds is offering something special today."], "tags": ["Internet"], "webUrl": "https://www.theguardian.com/world/us-news-blog/2012/feb/29/get-the-jump-on-leap-year-top-10", "publicationDate": "2012-02-29T17:30:00Z", "title": "Hop to it: our top 10 list on how to maximise your Leap Day potential"}, {"sentences": ["A stream of conspiratorialists as numerous as the Dead Sea Scrolls have already been down this road, of course, led by that epitome of investigative integrity Donald Trump."], "tags": ["Barack Obama"], "webUrl": "https://www.theguardian.com/world/us-news-blog/2012/mar/01/forgery-sheriff-joe-arpaio-barack-obama-birth-certificate", "publicationDate": "2012-03-01T23:20:00Z", "title": "Forgery most foul! Sheriff Joe Arpaio's birther revelations"}, {"sentences": ["So that&apos;s a positive.&quot; The good news is that something is to be done about the course now that it has been bought by Donald Trump.", "The even better news is that Trump has hired the golf course architect Gil Hanse to redesign the place."], "tags": ["PGA Tour", "Rory McIlroy", "Tiger Woods", "US sports", "Golf", "Sport", "Bubba Watson"], "webUrl": "https://www.theguardian.com/sport/2012/mar/10/justin-rose-masters", "publicationDate": "2012-03-10T15:41:53Z", "title": "Bubba Watson bursts forth to leave Rory McIlroy moaning in Miami"}, {"sentences": ["that Donald Trump was going to endorse a candidate for president last month.", "There&apos;s no reason why the notion of the scoop can&apos;t be recalibrated to mean not just letting us know 10 seconds before everybody else whom Donald Trump is going to endorse but also giving us more understanding, more clarity, a brighter spotlight on solutions."], "tags": ["Activate New York", "Media & Tech Network", "Activate New York"], "webUrl": "https://www.theguardian.com/media-network/media-network-blog/2012/mar/12/virality-fetishisation-social-media-cost", "publicationDate": "2012-03-12T13:42:15Z", "title": "Virality uber Alles: what the fetishisation of social media is costing us all"}, {"sentences": ["The Tony-Montana-meets-Donald-Trump aesthetic has always had a home in American hip-hop, and it&apos;s unsurprising to see it replicated in the music of a country where billionaire gangsters are a reality, rather than a romantic fiction."], "tags": ["Pop and rock", "Electronic music", "Dance music", "Music", "Culture", "Russia"], "webUrl": "https://www.theguardian.com/music/musicblog/2012/mar/14/pop-musik-sound-charts-russia", "publicationDate": "2012-03-14T17:05:00Z", "title": "Pop musik: the sound of the charts in … Russia"}, {"sentences": ["&quot;Donald Trump is interested,&quot; revealed the Observer&apos;s taxi driver."], "tags": ["Edinburgh", "Scotland", "UK news", "Edinburgh festival", "Festivals", "Culture", "Edinburgh city council", "Edinburgh holidays", "United Kingdom holidays", "Europe holidays", "Travel", "Edinburgh film festival", "Film", "Edinburgh trams", "Edinburgh festival 2012"], "webUrl": "https://www.theguardian.com/uk/2012/mar/18/edinburgh-cultural-renaissance", "publicationDate": "2012-03-18T00:00:40Z", "title": "Edinburgh takes pride in a cultural renaissance"}, {"sentences": ["The beauty contest was launched in 1952 to promote a California swimsuit company, and now belongs to bouffant billionaire Donald Trump.", "She also gets to enjoy the Trump Tower."], "tags": ["Transgender", "Equality", "LGBT rights", "Women", "Life and style", "Canada", "Fashion", "Society", "Sexuality"], "webUrl": "https://www.theguardian.com/society/shortcuts/2012/apr/11/pass-notes-miss-universe-transgender", "publicationDate": "2012-04-11T19:00:02Z", "title": "Pass notes No 3,157: Miss Universe"}, {"sentences": ["They got that discriminating gastronome Donald Trump to flog it; Trumpy barked that we had to eat the slices &quot;crust first&quot;.", "I flouted Trump and ate a slice point-first."], "tags": ["Life and style", "Food & drink", "Fast food", "Sausages"], "webUrl": "https://www.theguardian.com/lifeandstyle/wordofmouth/2012/apr/13/hot-dog-stuffed-crust-pizza", "publicationDate": "2012-04-13T08:52:00Z", "title": "The hot dog stuffed crust pizza: tested"}, {"sentences": ["&quot;So much time was spent giving serious currency to people like Michele Bachmann and Donald Trump when to me it seemed obvious that Mitt Romney was always going to be the nominee."], "tags": ["CNN", "TV news", "US television industry", "Television industry", "Media", "The news on TV", "US television", "Television", "Television & radio", "US news", "World news"], "webUrl": "https://www.theguardian.com/media/2012/apr/15/christiane-amanpour-interview", "publicationDate": "2012-04-15T18:30:01Z", "title": "Christiane Amanpour: 'There's still so much prejudice out there'"}, {"sentences": ["A team of make-believe baseball players descended on Trump Tower in New York on Tuesday afternoon, using tax day to highlight corporate unaccountability as Ann Romney, wife of Republican presidential frontrunner Mitt Romney, celebrated her birthday at an exclusive party inside.", "For Cathy Cyphers Soref, an attendee at Ann Romney&apos;s fundraising birthday party inside Trump Tower, the protesters&apos; repeated references to loopholes made little sense."], "tags": ["Occupy movement", "Occupy Wall Street", "New York", "US news", "World news", "Protest", "Mitt Romney", "Ann Romney"], "webUrl": "https://www.theguardian.com/world/us-news-blog/2012/apr/17/occupy-movement-tax-day-protest", "publicationDate": "2012-04-17T21:27:00Z", "title": "US protesters mark tax day with protest at Ann Romney's birthday party"}, {"sentences": ["The one thing I can say is maybe I&apos;m going in under the radar because there&apos;s people expected to do better than me.&quot; Higgins has had a poor year on the baize after an almost unbearably intense one last season, woven around a stirringly emotional defeat of Judd Trump in the final.", "People like Judd Trump, they want the limelight and in the next 10 years snooker will be in a better place with the razzmatazz side of it.&quot; Hearn has said, for now, that what he calls the &quot;eccentricity&quot; of the world championship, where a semi-final can stretch over three days, will remain untouched."], "tags": ["World Snooker Championship", "Snooker", "John Higgins", "Sport"], "webUrl": "https://www.theguardian.com/sport/2012/apr/20/john-higgins-world-snooker-championship", "publicationDate": "2012-04-20T17:36:30Z", "title": "John Higgins faces up to difficult world snooker championship defence"}, {"sentences": ["Detective Chief Inspector Andy Redwood, who is leading the British review into the disappearance of Madeleine, has spoken of now having the 'best opportunity' to at last solve the mystery of what happened to her Photograph: Teri Blythe/Metropolitan Police/PA       Looking every bit the American tycoon, Donald Trump arrives with his son at the Scottish parliament in Edinburgh where they will appear before the economy, energy and tourism committee.", "Trump is locked in a battle over wind turbines with Alex Salmond, who says he refuses to let Trump dictate energy policy Photograph: Andrew Milligan/PA       There's no crying over spilt milk at this protest in New Delhi, India."], "tags": ["World news", "UK news"], "webUrl": "https://www.theguardian.com/news/gallery/2012/apr/25/1", "publicationDate": "2012-04-25T12:46:00Z", "title": "Picture desk live: the day's best news images"}, {"sentences": ["Donald Trump, ever the crowd-pleasing showman, the brusque, blunt wheel-dealer, had his wish.", "After a relatively understated appearance at the Scottish parliament to decry Scotland&apos;s rush for windpower, where he in effect accused his one-time ally Alex Salmond of deliberately deceiving him to ensure his £750m golf course investment, Trump emerged on the streets of Edinburgh.", "Police officers rushed into the crowd and surrounded Trump in a protective cordon as the property baron tried to touch hands with admirers crushed behind a crowd barrier.", "Amid a bewildering array of competing placards, posters, flags and proclamatory T-shirts, there were loud repetitive chants of &quot;there&apos;s only one Donald Trump&quot; and &quot;no more turbines&quot; from a crowd dressed in Barbour jackets, ironic top hats and bright yellow UK Independence party tabards.", "But there were chants too from his opponents: one young man rushed at Trump to denounce the tycoon&apos;s repeated efforts to force residents living on the edge of his £750m golf resort to leave.", "You destroy people&apos;s lives in Aberdeenshire.&quot; Within minutes, Trump was bustled through photographers and television cameras into a waiting Range Rover, with the black paintwork customary for Trump&apos;s frequent visits to Scotland.", "Trump had been due to give a speech to his admirers, all drawn from the various local anti-windfarm campaign groups in the Scottish Borders, Dumfries and Galloway, Shetland and Perthshire, where Salmond&apos;s dream of building the thousands of turbines needed to hit his target of 100% renewable electricity by 2020 is being made real.", "This is perhaps Trump&apos;s boldest intervention into Scottish politics.", "The company building the experimental, 11-turbine windfarm, which is backed by the European Union and the Scottish government, insisted on Wednesday that the turbines would be three miles (4.9km) away from Trump&apos;s clubhouse and 2.4 miles offshore from the southern boundary of his course.", "At a press conference after Trump&apos;s 105 minutes of evidence alongside two CAT spokesmen to Holyrood&apos;s energy and tourism committee, the Guardian asked him how and when he would make good on his promise to block the windfarm.", "Trump was unable to confirm that £10m was in offer, replying: &quot;We&apos;re looking into that.", "We&apos;re looking into the laws of this country.&quot; Trump had arrived at the hearing in committee room one with his customary rolling, prizefighter&apos;s walk, with a serious look on his face.", "The MSP Chick Brodie, who sports two-tone shirts and well-oiled hair, pointed to a series of opinion polls on wind power commissioned deliberately to spike Trump&apos;s guns which showed that up to 70% of Scots support onshore windfarms.", "So too did the Irish, Brodie said, a nation cited by Trump earlier as &quot;laughing&quot; at Scotland over its love affair with wind power.", "Here came the first of Trump&apos;s characteristic boasts: he didn&apos;t need to produce any proof that tourism to Scotland was being damaged by subsidy-draining, inefficient and Chinese-built windfarms.", "I have won many, many awards … if you dot your landscape with these horrible, horrible structures, you will do tremendous damage.&quot; Trump was later pressed hard by reporters, flanked by more than 20 television cameras and photographers whose flashes pulsed every time Trump gestured, about his detailed claims that Salmond had promised him in 2007 that there was no prospect of the offshore windfarm being built.", "Sorial reminded Trump, who appeared hazy about the dates, that they had met for dinner in October 2007 – during Salmond&apos;s two-day trip to New York five months after he won power as first minister.", "Trump confirmed he had no written proof about Salmond&apos;s guarantees, but insisted no letters or witnesses were needed: &quot;I&apos;m the evidence,&quot; he proclaimed.", "And guess what, he was running around the park last week,&quot; Trump said.", "In the end, however, it took the Scottish Green party leader and committee member, Patrick Harvie, to express most succinctly the views of Trump&apos;s critics.", "As Trump was leaving the committee room, Harvie asked the mogul how he did his traditional victory sign, presenting Trump with two fingers pushed erect into the air."], "tags": ["Donald Trump", "Wind power", "Scottish politics", "Scotland", "Renewable energy", "Energy", "Politics", "Environment", "World news"], "webUrl": "https://www.theguardian.com/world/2012/apr/25/donald-trump-appearance-scottish-parliament", "publicationDate": "2012-04-25T17:30:47Z", "title": "Donald Trump's appearance sparks near-riot outside Scottish parliament"}, {"sentences": ["There is an attraction to wealth and power from Fred Goodwin to Donald Trump (giving evidence to the Scottish parliament yesterday against windfarms in light of his relationship with Salmond going sour), and Murdoch."], "tags": ["Scottish politics", "Alex Salmond", "Rupert Murdoch", "Politics", "Media", "The Sun", "Newspapers & magazines", "National newspapers", "Newspapers", "Scottish National party (SNP)", "Scotland", "UK news", "Leveson inquiry"], "webUrl": "https://www.theguardian.com/commentisfree/2012/apr/26/alex-salmond-rupert-murdoch", "publicationDate": "2012-04-26T14:41:20Z", "title": "Alex Salmond, Rupert Murdoch and the pitfalls of crony capitalism | Gerry Hassan"}, {"sentences": ["His more covert dealings with Donald Trump, the blow-dried American property man, has developed into a promising sub-plot.", "What Labour&apos;s leader, Lamont, is trying to plant in voters&apos; minds is that Salmond is a sucker for big business, someone who promises them things he can&apos;t deliver (no wind turbines near Trump&apos;s Aberdeenshire golf course?", "By coincidence, the Murdoch-owned Times this week carried a bad-tempered interview with Trump, another unsavoury tycoon, who plans to build a huge £750m golf course (and claims it will create between 4,200 and 7,000 jobs) on the Aberdeenshire coast.", "But Trump complained he still hadn&apos;t seen the reassuring artist&apos;s impressions, which the Houdini of the Heather promised him."], "tags": ["Leveson inquiry", "Rupert Murdoch", "Alex Salmond", "Scottish independence", "Scottish politics", "Milly Dowler", "Muammar Gaddafi", "Donald Trump", "Regional & local newspapers", "Jeremy Hunt"], "webUrl": "https://www.theguardian.com/politics/blog/2012/apr/27/alex-salmond-rupert-murdoch-disclosures", "publicationDate": "2012-04-27T13:09:38Z", "title": "Alex Salmond survives Rupert Murdoch's disclosures - so far"}, {"sentences": ["There could only ever have been one winner when Alex Salmond had a late dinner with Donald Trump in New York five years ago.", "Mr Trump, on the other hand, conveys the impression that he wouldn&apos;t know whether to drink it or apply it to his hair.", "So if Mr Salmond promised that there would be no ocean windfarms to contaminate the view from Mr Trump&apos;s golf resort, then, like a good margherita, it should have been taken with more than a pinch of salt.", "He proceeded to tell Mr Trump that, in any case, the defence ministry would object to windfarm development off the Aberdeenshire coast because it would interfere with shipping lanes.", "It remains to be seen if the wily old snake charmer can take Glasgow from Labour in this week&apos;s council elections as easily as he took Trump for a ride."], "tags": ["Alex Salmond", "Scottish politics", "Local elections 2012", "Scottish National party (SNP)", "Politics", "Donald Trump", "Scotland"], "webUrl": "https://www.theguardian.com/commentisfree/2012/apr/29/alex-salmond-glasgow-elections-coalition", "publicationDate": "2012-04-28T23:04:00Z", "title": "Glasgow's councillors must put their city first | Kevin McKenna"}, {"sentences": ["&quot;Last year at this time – in fact, on this very weekend – we finally delivered justice to one of the world&apos;s most notorious individuals.&quot; A screen showed a picture of Donald Trump."], "tags": ["Barack Obama", "World news", "US news", "Mitt Romney", "Newt Gingrich", "Obama administration", "US politics", "US elections 2012", "Sarah Palin"], "webUrl": "https://www.theguardian.com/world/2012/apr/29/barack-obama-mitt-romney-white-house-dinner", "publicationDate": "2012-04-29T22:22:01Z", "title": "Barack Obama ribs Mitt Romney at White House correspondents' dinner"}, {"sentences": ["It remains to be seen whether SNP support will be dented by Salmond&apos;s ties to Rupert and James Murdoch, and his spat with Donald Trump."], "tags": ["Scottish politics", "Local elections 2012", "Scotland", "UK news", "Local elections", "Politics", "Labour", "Scottish National party (SNP)", "Local government", "Society", "Glasgow"], "webUrl": "https://www.theguardian.com/politics/2012/may/01/labour-fears-losing-glasgow-to-snp", "publicationDate": "2012-05-01T16:38:00Z", "title": "Labour fears SNP will storm its Glasgow bastion"}, {"sentences": ["Then, on the adjacent video screens, came the punch line: a picture of Donald Trump.", "Just a day before announcing Bin Laden&apos;s death a year ago, the president had been reduced to providing his Hawaii birth certificate to squelch the stupid birther rumors being retailed by then GOP presidential hopeful Trump."], "tags": ["Barack Obama", "Obama administration", "US news", "Washington DC", "Media", "Newspapers", "Newspapers & magazines"], "webUrl": "https://www.theguardian.com/commentisfree/cifamerica/2012/may/01/laughing-white-house-correspondents-dinner", "publicationDate": "2012-05-01T20:21:55Z", "title": "Look who's laughing at the White House correspondents' dinner | Bob Garfield"}, {"sentences": ["Many parties claim the SNP&apos;s popularity is waning with controversies over Salmond&apos;s links to Rupert Murdoch and Donald Trump, and a backlash over the push to independence."], "tags": ["Scottish National party (SNP)", "Alex Salmond", "Scottish politics", "Labour", "Conservatives", "Liberal Democrats", "Local elections 2012", "Local elections", "Local politics", "Scottish independence", "Politics", "Scotland", "UK news", "Local government", "Society", "Donald Trump", "World news"], "webUrl": "https://www.theguardian.com/politics/2012/may/06/snp-alex-salmond-remarkable-victory-elections", "publicationDate": "2012-05-06T18:28:25Z", "title": "SNP won 'remarkable victory' in Scottish elections, says Alex Salmond"}, {"sentences": ["In the second round he thoroughly spooked last year&apos;s finalist, Judd Trump."], "tags": ["World Snooker Championship", "Ronnie O'Sullivan", "Snooker", "Sport"], "webUrl": "https://www.theguardian.com/sport/2012/may/06/ronnie-osullivan-ali-carter-snooker", "publicationDate": "2012-05-06T22:41:23Z", "title": "Ronnie O'Sullivan leads Ali Carter 10-7 in the world snooker final"}, {"sentences": ["Ed Black, Church Point, NSW, Australia • Donald Trump."], "tags": [], "webUrl": "https://www.theguardian.com/theguardian/2012/may/15/guardian-weekly-notes-and-queries", "publicationDate": "2012-05-15T12:59:03Z", "title": "Beam me back to my home planet"}, {"sentences": ["A cheerfully egomaniacal glory hound, the sports and media mogul had previously taken a few shots at stepping into Donald Trump&apos;s huge, crude shoes, most notably in The Benefactor, where he basically made the poor and needy dance for scraps."], "tags": ["US television", "Television", "Television & radio", "US news", "ABC", "Media", "Mad Men", "Reality TV"], "webUrl": "https://www.theguardian.com/tv-and-radio/tvandradioblog/2012/may/16/man-men-reality-tv-pitch", "publicationDate": "2012-05-16T16:14:03Z", "title": "Mad Men of reality TV: The Pitch is so boring it would drive Draper to drink"}, {"sentences": ["Last year, during his own brief and bizarre bid for the presidency, the billionaire entrepreneur Donald Trump ridiculed Romney as &quot;a funds guy&quot; who would &quot;buy companies … close companies [and] get rid of the jobs&quot;."], "tags": ["US elections 2012", "US news", "US politics", "World news", "Barack Obama", "Mitt Romney", "Banking reform", "Business", "Financial crisis"], "webUrl": "https://www.theguardian.com/commentisfree/cifamerica/2012/may/24/barack-obama-mitt-romney-apologist", "publicationDate": "2012-05-24T21:00:02Z", "title": "Sadly Barack Obama, like Mitt Romney, is an apologist for the 1% | Mehdi Hasan"}, {"sentences": ["When Mitt Romney sheepishly accepted Donald Trump&apos;s endorsement in a hastily arranged ballroom ceremony in Las Vegas in February, the political world scratched its collective head.", "Even Fox News polls showed that a Trump endorsement would be more likely to hurt a presidential candidacy than to help.", "It now appears that whatever motivated Romney&apos;s initial embrace of Trump, the two remain close.", "The Republican presidential candidate is strengthening his ties to the real estate mogul – and relying more on his fundraising – even as Trump demonstrates increasing adherence to cracked-mirror politics.", "Shortly after a Romney campaign announcement that Trump will host a major fundraiser for the presidential candidate at the end of June, Trump made an announcement of his own: the president was born in Kenya.", "&quot;Look, it&apos;s very simple,&quot; Trump told the Daily Beast&apos;s Lloyd Grove in an interview published Friday.", "His mother never spent a day in the hospital.&quot; Trump was referring to promotional copy circulated by Barack Obama&apos;s literary agent in 1991, unearthed last week by the website www.breitbart.com.", "&quot;That&apos;s what he told the literary agent,&quot; Trump told Grove.", "The literary agent wrote down what he said.&quot; Trump and Romney currently are planning two fundraisers together.", "The first is a fundraiser Tuesday at the Trump International Hotel in Las Vegas, with a special guest appearance by Newt Gingrich.", "The second Trump-Romney fundraiser is a lottery, with a June dinner with Trump and Romney as the grand prize.", "&quot;One (1) winner will receive round-trip transportation and accommodations for the winner to meet Donald Trump,&quot; the rules read.", "The prize description also includes &quot;One (1) round-trip coach class plane ticket within the continental United States&quot; and &quot;One (1) one-night hotel stay&quot; at the Trump International Hotel &amp; Tower in New York.", "&quot;Instead of rejecting Donald Trump&apos;s &apos;birther&apos; conspiracy theories and divisive attacks, he&apos;s endorsing them by campaigning and fundraising with him.&quot; The Romney campaign did not return a call for comment."], "tags": ["Mitt Romney", "Donald Trump", "US politics", "US news", "US elections 2012", "Barack Obama", "Republicans"], "webUrl": "https://www.theguardian.com/world/us-news-blog/2012/may/25/mitt-romney-donald-trump-birther", "publicationDate": "2012-05-25T19:32:24Z", "title": "Romney and Trump remain close amid fresh batch of birther comments"}, {"sentences": ["   A pregnant Reese Witherspoon arrives for the photocall for Mud – Jeff Nichols's follow up to Take Shelter Photograph: Rex Features       Director Giles Bourdos, and actors Christa Theret, Michel Bouquet, Thomas Doret and Vincent Rottiers pose at the Renoir photocall  Photograph: Andreas Rentz/Getty Images       Matthew McConaughey arrives at the Mud press conference  Photograph: Joseph Kerlakian/Rex Features       Jacob Lofland, Reese Witherspoon, director Jeff Nichols, Matthew McConaughey and Tye Sheridan at the Mud press conference Photograph: Vittorio Zunino Celotto/Getty Images       Ivana Trump and Massimo Garcia at the Sea Side restaurant in Cannes Photograph: Collet Guillaume/Rex Features       French director Cedric Kahn, France Culture radio station president Olivier Poivre d'Arvor, Italian actor Laura Morante, French director Pierre Schoeller and Radio France director Jean-Luc Hees attend the France Culture cinema prize ceremony  Photograph: Benjamin Legier/EPA       Actor Lisa Maria Falcone wears an I love Mud t-shirt to the photocall for the film Photograph: Rex Features       South Korean actors Kim Kang-Woo and Kim Hyo-Jin, director and screenwriter Im Sang-Soo and actors Youn Yuh-Jung and Baek Yoon-Sik at the photocall for Do-Nui Mat (The Taste of Money)  Photograph: Loic Venance/Getty Images       Matthew McConaughey poses with the young stars from Mud, Jacob Lofland and Tye Sheridan Photograph: Valery Hache/AFP/Getty Images       French actor Michel Bouquet takes pictures of photographers at the photocall for Renoir  Photograph: Alberto Pizzoli/AFP/Getty Images  "], "tags": ["Cannes 2012", "Cannes film festival", "Film", "Culture", "Festivals"], "webUrl": "https://www.theguardian.com/film/gallery/2012/may/26/cannes-2012-pictures", "publicationDate": "2012-05-26T21:18:47Z", "title": "Cannes 2012: day 11 - in pictures"}, {"sentences": ["Donald Trump is the best known and most extreme example of this and his cross-hatching has taken on near skyscraper proportions."], "tags": ["Men's fashion", "Beauty", "Fashion", "Life and style"], "webUrl": "https://www.theguardian.com/fashion/2012/may/28/donald-trump-bald-comb-forward", "publicationDate": "2012-05-28T14:28:01Z", "title": "Dear Donald Trump, it's better to be bald than sport a comb-forward"}, {"sentences": ["But Romney&apos;s looming victory was tainted by growing criticism of his planned appearance at a fundraiser with Donald Trump, who continues to question whether Barack Obama was born in the US.", "&quot;I&apos;m looking forward to the good news.&quot; But that victory has been soured by criticism of a joint appearance with Trump, the millionaire property developer who toyed with a run for the Republican nomination, at what will amount to Romney&apos;s victory party at the Las Vegas fundraiser.", "Trump is a &quot;birther&quot; who continues to question whether Obama was born in the US.", "What do they say about his place of birth.&quot; The Obama campaign has called on Romney to repudiate Trump&apos;s views.", "Commentator George Will said the Republican candidate was undermining his own cause by appearing with Trump.", "What voter is going to vote for him [Romney] because he is seen with Donald Trump?", "&quot;Donald Trump is redundant evidence that if your net worth is high enough, your IQ can be very low and you can still intrude into American politics.&quot; Senior Romney aide Eric Fehrnstrom also declined to condemn Trump&apos;s remarks in a recent interview.", "&quot;I can&apos;t speak for Donald Trump ... but I can tell you that Mitt Romney accepts that President Obama was born in the United States,&quot; Fehrnstrom said."], "tags": ["Republican presidential nomination 2012", "Texas", "Mitt Romney", "US elections 2012", "US politics", "US news", "Donald Trump", "World news"], "webUrl": "https://www.theguardian.com/world/2012/may/29/mitt-romney-nomination-donald-trump", "publicationDate": "2012-05-29T14:50:57Z", "title": "Mitt Romney to clinch presidential nomination as criticism stirs over Trump meeting"}, {"sentences": ["Question: Will it be &quot;Romney/Trump 2012?&quot; (CNN Political Ticker, 25 May) Answer: No.", "Donald Trump, meanwhile, is: c) a loose-cannon, germophobic reality TV star and beauty pageant operator who is obsessed with &quot;birther&quot; conspiracy theories, and who presently has, according to InTrade, a 0.1% chance of winning the spot.", "Closer inspection of CNN&apos;s story reveals that the source for the Donald Trump VP rumour is Donald Trump.", "And what does Donald Trump think about the credibility of the rumour?", "&quot;I think probably that won&apos;t happen,&quot; says Donald Trump."], "tags": ["US politics", "Barack Obama", "Donald Trump", "Mitt Romney", "US news", "US elections 2012"], "webUrl": "https://www.theguardian.com/commentisfree/2012/may/29/trump-veep-political-punditry", "publicationDate": "2012-05-29T16:05:33Z", "title": "Trump for Veep and other US political punditry fails | Oliver Burkeman"}, {"sentences": ["Mitt Romney&apos;s lap of victory after finally tying down the Republican presidential nomination was derailed by his host at the celebrations in Las Vegas – Donald Trump, the controversial billionaire who has repeatedly questioned whether President Barack Obama was born in America.", "In what appears to be another high-profile mis-step – just as his campaign&apos;s new smartphone app mis-spelled America – Romney appeared at a fundraising event with Trump rather than hold a rally in Texas where a primary win finally awarded him enough delegates to be declared the GOP winner.", "That moment of victory in Texas was overshadowed by a day of media appearances by Trump, a Romney backer and surrogate, that proved an unnecessary distraction.", "Some Republican strategists were blunt in their assessment of the potential damage Romney&apos;s joint appearance with Trump might cause, given widespread debunking of the main charge of birtherism and its tinge of racist sentiment.", "&quot;That was a big steaming plate of shit spaghetti Trump just deposited on CNN for his supposed friend Romney,&quot; tweeted David Frum, a former speechwriter for President George W Bush who came up with the phrase &quot;axis of evil&quot;.", "Mark McKinnon, a long-time adviser to 2008 Republican nominee John McCain told the New York Times that Trump made Romney look like &quot;an out-of-touch rich guy without any real core, which means he&apos;ll associate with anyone if he thinks it will further his ambition&quot;.", "Conservative columnist George Will called Trump a &quot;bloviating ignoramus&quot; on a TV news show and warned Romney that associating with him would bring a heavy political cost.", "Romney, who has stated that he does not believe in birtherism, has not spoken out publicly against Trump&apos;s views.", "In a statement emailed to reporters Obama campaign deputy campaign manager Stephanie Cutter said: &quot;Mitt Romney&apos;s continued embrace of Donald Trump and refusal to condemn his disgraceful conspiracy theories demonstrates his complete lack of moral leadership.&quot;  The Obama campaign also seized on the controversy to rush out a campaign video on the issue, claiming that McCain stood up to extremist elements of the Republican party in 2008 while Romney courts them in 2012.", "The video featured repeated clips of Trump espousing birtherist theories.", "But in an apparent rebuttal to that video Trump himself took to Twitter and said: &quot;[McCain] lost the election.", "No cameras were permitted to film Romney and Trump at the Las Vegas event, which was expected at raise at least $2m.", "Though the birth certificate issue was not raised at the Tuesday night Las Vegas fundraiser, former GOP rival Newt Gingrich told reporters that he believed Trump was unlikely to stop advocating it as a cause."], "tags": ["Mitt Romney", "Barack Obama", "Donald Trump", "Texas", "US politics", "US news", "US elections 2012", "World news", "Republican presidential nomination 2012"], "webUrl": "https://www.theguardian.com/world/2012/may/30/donald-trump-birther-mitt-romney", "publicationDate": "2012-05-30T16:41:00Z", "title": "Donald Trump's 'birther' questions overshadow Mitt Romney's Texas win"}, {"sentences": ["No, Romney&apos;s problem is that his embrace of Donald Trump (so repeatedly that Mitt risks being asked about group marriage again) only underscores his uncomplicated willingness to be seen with anyone who might be able to pull in an ungotten vote or two.", "Donald Trump&apos;s request for Obama&apos;s birth certificate (or his college transcripts, for that matter) are only the most ludicrous and high-profile versions of the kind of &quot;let me see your license&quot; bullshit that African Americans have to put up with every day.", "And Romney&apos;s bland acceptance of Trump&apos;s mercenary bullying is the birthright – the license, if you will – of someone whose real privilege is never having to worry about what other people think."], "tags": ["Mitt Romney", "Donald Trump", "Barack Obama", "US politics", "US news", "US elections 2012", "Race issues", "Republicans", "Democrats"], "webUrl": "https://www.theguardian.com/commentisfree/2012/may/30/what-we-learn-from-donald-trumps-birtherism", "publicationDate": "2012-05-30T17:51:13Z", "title": "What we learn from Donald Trump's blowhard birtherism | Ana Marie Cox"}, {"sentences": ["Instead, he visited a different land of make-believe: he appeared at a Las Vegas fundraiser with Donald Trump.", "Just hours earlier, Trump had appeared on CNN for a contentious exchange with Wolf Blitzer over whether President Barack Obama was really born in the United States.", "&quot;A lot of people do not believe that birth certificate,&quot; Trump told Blitzer.", "RT @davidfrum: That was a big steaming plate of shit spaghetti Trump just deposited on CNN for his supposed friend Romney&mdash; Andrew Kaczynski (@BuzzFeedAndrew) May 29, 2012   So why, instead of disavowing Trump, does Romney instead come back for seconds?", "Romney had previously declined a debate invite from Trump, so he (or at least, his campaign) must know the risks the association carries.", "The day Romney clinched the nomination, the news cycle was dominated by Trump and birth certificates rather than Romney&apos;s primary victory or Obama&apos;s record on jobs and the economy.", "Trump, whatever his political opinions or personal faults, is a pop culture icon.", "If Romney alienates Trump, he has to worry about who else he will alienate.", "Don&apos;t forget that Trump briefly led the GOP presidential field in national polls.", "Finally, there is the biggest problem: having blundered into Trump&apos;s embrace, which included welcoming his endorsement, it is not clear how Romney can extricate himself.", "Trump won&apos;t simply shut up and go away.", "The media would have happily covered Trump&apos;s angry claims that Romney had dissed or double-crossed him.", "Trump&apos;s media feuds are legendary.", "Despite his fame and fortune, it&apos;s not clear that Trump does command the loyalty of many conservatives.", "His shortlived poll surge notwithstanding, Trump failed to wrest the nomination of a small third party – the Ross Perot-founded Reformers – away from Pat Buchanan in 2000."], "tags": ["Donald Trump", "Mitt Romney", "US politics", "US elections 2012", "Republican presidential nomination 2012", "Republicans", "Texas", "Barack Obama", "CNN"], "webUrl": "https://www.theguardian.com/commentisfree/2012/may/30/mystery-mitt-romney-tryst-with-donald-trump", "publicationDate": "2012-05-30T22:24:37Z", "title": "The mystery of Mitt Romney's tryst with Donald Trump | James Antle"}, {"sentences": ["In other film production news, the US businessman Donald Trump has announced ambitious plans for a new studio facility in Florida.", "Trump Studio City would be built on public-owned land 30 miles south of Miami, and could be twice the size of Universal Studios in LA, making it one of the largest facilities on earth."], "tags": ["Film", "Film industry", "Culture", "UK news"], "webUrl": "https://www.theguardian.com/film/2012/jun/08/twickenham-film-studios-saved-closure", "publicationDate": "2012-06-08T10:05:26Z", "title": "Twickenham film studios saved from closure after campaigners intervene"}, {"sentences": ["When Al Neuharth, USA Today&apos;s founder and columnist-for-life, called fellow egomaniac Donald Trump a &quot;clown&quot;, the Donald did not strike back with his stinging riposte on his prime time NBC show Celebrity Apprentice.", "Founder (cont) tl.gd/hn7gjp&mdash; Donald J. Trump (@realDonaldTrump) June 5, 2012   Liberal broadcast blowhard Ed Schultz and conservative broadcast blowhard Sean Hannity had a confrontation on Twitter about whether Barack Obama really wanted Osama bin Laden dead."], "tags": ["Twitter", "Media", "Social media", "Social networking", "Newspapers", "Rupert Murdoch", "Donald Trump", "Rush Limbaugh", "US television", "US television industry", "Oprah Winfrey", "Talk radio"], "webUrl": "https://www.theguardian.com/commentisfree/2012/jun/09/twitter-register-media-power", "publicationDate": "2012-06-09T15:00:01Z", "title": "The Twitter register of awe-inspiring media power | Bob Garfield"}, {"sentences": ["Salmond&apos;s standing in Scotland is built on the idea that he is not just a breed apart from Westminster politicians, but a self-confident grown-up in a world of mere kids – but as with the more pantomimic Donald Trump, the SNP leader&apos;s dealings with the Murdochs suggest he may also have slightly less heroic aspects."], "tags": ["Leveson inquiry", "Politics", "UK news", "Media", "Society"], "webUrl": "https://www.theguardian.com/commentisfree/2012/jun/10/leveson-elite-shames-new-politics", "publicationDate": "2012-06-10T18:45:01Z", "title": "Leveson matters, and not just to the elite it shames | John Harris"}, {"sentences": ["Salmond&apos;s standing in Scotland is built on the idea that he is not just a breed apart from Westminster politicians, but a self-confident grown-up in a world of mere kids – but as with the more pantomimic Donald Trump, the SNP leader&apos;s dealings with the Murdochs suggest he may also have slightly less heroic aspects."], "tags": ["Leveson inquiry", "Politics", "UK news", "Media", "Society"], "webUrl": "https://www.theguardian.com/commentisfree/2012/jun/10/leveson-elite-shames-new-politics", "publicationDate": "2012-06-10T18:45:01Z", "title": "Leveson matters, and not just to the elite it shames | John Harris"}, {"sentences": ["The Last Trump, the serried crowds, fade and a sense of shortness of time, the necessity of repentance, becomes paramount."], "tags": ["Poetry", "Religion", "Books", "World news"], "webUrl": "https://www.theguardian.com/commentisfree/belief/2012/jun/11/john-donne-two-judgments", "publicationDate": "2012-06-11T07:30:02Z", "title": "John Donne, priest and poet, part 4: two kinds of judgment | Roz Kaveney"}, {"sentences": ["The flame&apos;s fortitude may well be put to the test, this being one of the windiest locations in Britain – something one infamous island exile, Donald Trump (his mother Mary was born here) – found to his chagrin on a homecoming jaunt last year when the adhesion of his candy-floss hairpiece was sorely tested by a gentle force 9."], "tags": ["Olympic torch", "Olympic Games 2012", "Sport", "UK news", "Olympic Games"], "webUrl": "https://www.theguardian.com/sport/2012/jun/11/olympic-torch-route-isle-of-lewis", "publicationDate": "2012-06-11T14:00:00Z", "title": "Olympic torch route, day 24: sport is woven into the Isle of Lewis's fabric"}, {"sentences": ["And finally, the vote decider, who is saddled with Donald Trump?"], "tags": ["US elections 2012", "US politics", "Barack Obama", "Mitt Romney", "Republicans", "Democrats", "US Congress", "US news", "Super Pacs"], "webUrl": "https://www.theguardian.com/commentisfree/cifamerica/2012/jun/12/how-predict-outcome-us-election", "publicationDate": "2012-06-12T19:00:00Z", "title": "How to predict the outcome of the US election | Hadley Freeman"}, {"sentences": ["And finally, the vote decider, who is saddled with Donald Trump?"], "tags": ["US elections 2012", "US politics", "Barack Obama", "Mitt Romney", "Republicans", "Democrats", "US Congress", "US news", "Super Pacs"], "webUrl": "https://www.theguardian.com/commentisfree/cifamerica/2012/jun/12/how-predict-outcome-us-election", "publicationDate": "2012-06-12T19:00:00Z", "title": "How to predict the outcome of the US election | Hadley Freeman"}, {"sentences": ["Obama supporters were invited to enter a $3 lottery to have dinner with the Sex and the City star Sarah Jessica Parker; Romney aped the idea, inviting his supporters to enter a $3 lottery to have dinner with Donald Trump."], "tags": ["Mitt Romney", "Barack Obama", "US elections 2012", "Technology", "US politics", "Internet", "Social networking", "US news", "World news"], "webUrl": "https://www.theguardian.com/world/2012/jun/14/romney-campaign-digital-data-obama", "publicationDate": "2012-06-14T17:50:00Z", "title": "Mitt Romney's campaign closing gap on Obama in digital election race"}, {"sentences": ["Indeed, Wendi&apos;s friends, among the richest and most press-savvy people in the land – David Geffen, Arianna Huffington, Diana von Furstenberg, Ivanka Trump – would not talk about Wendi without her asking them to and having supplied them with detailed what-to-say-what-not-to-say instructions."], "tags": ["Rupert Murdoch", "News Corporation", "Business", "Media business", "Phone hacking", "Media", "New York Times"], "webUrl": "https://www.theguardian.com/commentisfree/2012/jun/19/wendi-murdoch-freelance-career", "publicationDate": "2012-06-19T20:25:31Z", "title": "Wendi Murdoch's freelance career | Michael Wolff"}, {"sentences": ["Hamilton 6.50 Stags Leap 7.20 Red Joker 7.50 Outback 8.20 Hot Rod Mamma 8.50 Fol Hollow 9.20 Able Master 9.50 Botham Leicester 6.40 Just For Mary 7.10 Yourartisonfire 7.40 Final Delivery 8.10 Ozz (nap) 8.40 Dalayir 9.10 Ascription Newcastle 2.00 Jubilee Games 2.30 Unsinkable 3.00 Prince Of Sorrento (nb) 3.30 Pokfulham 4.00 Ptolomeos 4.30 Shaloo Diamond 5.00 Red Trump Warwick 2.10 Indigo Iris 2.40 Celestial Dawn 3.10 Cardinal 3.40 Diala 4.10 April Ciel 4.40 Join Up Yarmouth 2.20 Rocky Ground 2.50 Elusive Hawk 3.20 Sarah Berry 3.50 Multi Bene 4.20 First Class 4.50 Laverre 5.20 La Pampita 5.50 Sommersturm"], "tags": ["Horse racing", "Sport", "Horse racing tips"], "webUrl": "https://www.theguardian.com/sport/2012/jun/27/horse-racing-tips-thursday-28-june", "publicationDate": "2012-06-27T17:00:01Z", "title": "Horse racing tips: Thursday 28 June"}, {"sentences": ["You&apos;ve Been Trumped Scotland v Donald Trump&apos;s golf course."], "tags": ["Film", "Culture"], "webUrl": "https://www.theguardian.com/film/2012/jun/30/this-weeks-new-films", "publicationDate": "2012-06-29T23:05:18Z", "title": "This week's new films"}, {"sentences": ["Superficially, this is a tub-thumper, a stonking panto smackdown between Donald Trump, riding roughshod over the law and the landscape in his bid to build a colossal golf course in Aberdeenshire, and the revolted locals fighting compulsory purchase.", "You&apos;ve Been Trumped works rousingly as that: first-time director Anthony Baxter neatly marshals arguments and wrangles warring sides.", "But Trumped finds breath for subtler touches to make a complex portrait of a singular wilderness."], "tags": ["Film", "Culture", "Documentary", "Donald Trump"], "webUrl": "https://www.theguardian.com/film/2012/jul/05/youve-been-trumped-review", "publicationDate": "2012-07-05T21:18:01Z", "title": "You've Been Trumped – review"}, {"sentences": ["You&apos;ve Been Trumped (PG) (Anthony Baxter, 2011, UK) 95 mins Stubborn Scots give Donald Trump a run for his money in this protest doc by mounting a Local Hero-style challenge to his habitat-wrecking golf resort plan."], "tags": ["Film", "Culture"], "webUrl": "https://www.theguardian.com/film/2012/jul/07/this-weeks-new-films", "publicationDate": "2012-07-06T23:05:17Z", "title": "This week's new films"}, {"sentences": ["Another British documentary with a sporting connection looks at the outrageous shenanigans involved in the US property tycoon Donald Trump constructing a golf course near Aberdeen, in the constituency of Scottish leader Alex Salmond, no less."], "tags": ["Documentary", "Film", "Culture", "Donald Trump", "Golf", "Alex Salmond"], "webUrl": "https://www.theguardian.com/film/2012/jul/08/youve-been-trumped-review", "publicationDate": "2012-07-07T23:03:00Z", "title": "You've Been Trumped – review"}, {"sentences": ["     Two of Scotland&apos;s top golfers teed off with Donald Trump at the opening of his controversial £1bn golf course in Aberdeenshire today, despite calls for a boycott from conservationists.", "The Scottish Wildlife Trust wrote an open letter urging golfers Colin Montgomerie, Paul Lawrie and Martin Laird not to play at the Trump International Golf Links course at Menie Estate on the grounds it was built on &quot;a unique, protected area&quot; with &quot;nationally important landforms and wildlife&quot;.", "Despite fierce protest from environment groups, Trump was given the go-ahead for &quot;stabilisation&quot; of the dunes to construct the resort in 2008, as Scottish ministers deemed the economic benefits to outweigh the environmental costs.", "An action group, Tripping Up Trump, has supported local residents opposed to the construction, and a film company called Montrose Pictures produced a documentary following the development.", "You&apos;ve Been Trumped was shown in cinemas in Edinburgh, Glasgow and London last weekend to coincide with the course&apos;s opening.", "A trailer for the film places footage of Trump stating &quot;we&apos;ve had tremendous support from the environmental groups&quot;, alongside a spokesperson for the RSPB explaining that &quot;the whole package is wrong&quot;.", "However, environmental concerns could prevent Trump from completing the final stages of his development.", "Trump appeared before the Scottish parliament&apos;s economy, energy and tourism committee in April to describe wind turbines as &quot;one of the most serious problems Scotland will have or has had&quot;.", "When asked to back up his claim that they were detrimental to tourism, Trump responded: &quot;I am the evidence.&quot; Speaking on Radio 4&apos;s Today programme today, David Milne, a resident on the Menie Estate, questioned Trump&apos;s projections for the course, and summed up: &quot;I do not believe this course is environmentally sustainable, and therefore will not be economically sustainable.&quot;"], "tags": ["Conservation", "Environment", "Endangered habitats", "Wildlife", "Activism", "Donald Trump", "Golf", "Sport", "Colin Montgomerie"], "webUrl": "https://www.theguardian.com/environment/2012/jul/10/donald-trump-scotland-golf-course", "publicationDate": "2012-07-10T13:51:04Z", "title": "Donald Trump opens controversial Scottish golf course"}, {"sentences": ["     With a swish of his wood, Donald Trump drove the first ball to open his £100m Aberdeenshire golf course on Monday and it looked like it might be heading for the rough.", "The opening of the Manhattan property magnate&apos;s Trump International course had been mired in controversy over his decision to bulldoze fairways over protected sand dunes, and outrage at his treatment of neighbours.", "But Trump was not about to let anything mar his public relations drive.", "Trump had flown into Aberdeen on a private jet emblazoned in gold with the Trump brand.", "Trump claims to have stabilised the land to create the &quot;greatest golf course in the world&quot;.", "But that did not stop Trump denying there were any protesters, declaring after the first nine holes: &quot;The environmentalists love what I have done.&quot; A second question about the environmental impact saw the billionaire shepherded by an aide away from the media and towards the VIP refreshment tent.", "To Trump&apos;s evident pride, Sandy Jones, chief executive of the Professional Golfers Association, declared it &quot;an iconic golf course that will no doubt in my mind be in the top three [in the world], but I don&apos;t know who will be two and three&quot;.", "A public inquiry to win permission to build the course means the opening was three years behind schedule, and plans for a clubhouse, hotel and villas rest, according to Trump, on whether the Scottish government approves an offshore windfarm and whether there is an upturn in the economy.", "Trump took a swipe at windfarms, labelling them &quot;ridiculous monsters&quot; that would &quot;destroy Scotland&quot;.", "As Trump&apos;s children, Donald junior, Ivanka and Eric teed off with the rest of the guests, local opponents fumed.", "Milne, who lives in a former coastguard station overlooking the course, has resisted Trump&apos;s attempts to buy him out, but is now forced to live behind a row of tall spruce trees planted on Trump&apos;s orders at the edge of his property which screen off his once spectacular view of the dunes and the sea.", "Trump ordered the planting after telling an aide: &quot;I want to get rid of that house&quot;.", "In an exchange captured in the US TV programme Donald Trump&apos;s Fabulous World of Golf, he said: &quot;It&apos;s our property, we can do what we want.", "This house is ugly.&quot; Not more than 100 metres from the clubhouse, Susan Monro also refused to sell and Trump has piled an 8 metre high sand berm around her house, blocking her sea views.", "Huge gates have been erected at the end of her lane and she complains Trump&apos;s security staff shine lights into her home at night.", "He says &apos;I don&apos;t want to see you your houses&apos;, well, I don&apos;t want to see your golf course.&quot; Back on the course as Trump prepared to tackle the back nine, he was defiant."], "tags": ["Donald Trump", "Scotland", "World news", "UK news", "Golf", "Sport"], "webUrl": "https://www.theguardian.com/world/2012/jul/10/donald-trump-100m-golf-course", "publicationDate": "2012-07-10T18:00:14Z", "title": "Donald Trump opens £100m golf course"}, {"sentences": ["It should have been Donald Trump&apos;s day of triumph as his controversial golf course at Balmedie near Aberdeen finally opened in the presence of golfing great Colin Montgomerie.", "Alex Salmond was in danger of going the same way after his Scottish government intervened to rescue Trump&apos;s rejected plan – but the first minister has mercifully been kicked into the long grass for daring to back the construction of offshore wind turbines beyond &quot;Donald&apos;s&quot; dunes.", "Nothing feels very good about Trump&apos;s &quot;sporting triumph&quot;.", "Trump has contrived to do the opposite.", "But Trump has effortlessly managed to strike the wrong note in just about everything he&apos;s done.", "In his bizarre appearance before Holyrood&apos;s energy committee, Trump explained his opposition to the planned European Offshore Wind Deployment Centre – a test centre that should help reduce the need for onshore wind farms – by calling it a &quot;tourism-crushing eyesore&quot;.", "Donald Trump represents next to no one in Scotland except Donald Trump."], "tags": ["Donald Trump", "Andy Murray", "Golf", "World news", "Scotland", "UK news"], "webUrl": "https://www.theguardian.com/commentisfree/2012/jul/10/donald-trump-andy-murray-scotland-golf", "publicationDate": "2012-07-10T18:06:24Z", "title": "How Donald was trumped | Lesley Riddoch"}, {"sentences": ["He died in his home late on Monday night of a heart attack, aged 91 Photograph: Felipe Dana/AP       It's been rough for Donald Trump but finally he's on course, playing a round of golf after the opening of the Trump International golf links in Balmedie, Aberdeenshire."], "tags": ["World news", "UK news"], "webUrl": "https://www.theguardian.com/news/gallery/2012/jul/10/picture-desk-live-best-images", "publicationDate": "2012-07-10T18:16:00Z", "title": "Picture desk live: the day's best news images"}, {"sentences": ["New York property magnate Donald Trump opened his controversial new golf course north of Aberdeen, Scotland, on Monday.", "But Trump dismissed the concerns when he teed off with a rather unimpressive shot.", "Trump says they rest on whether the Scottish government approves an offshore windfarm (which he opposes) and – more plausibly – change in the economic climate."], "tags": ["Donald Trump", "World news", "UK news", "Scotland", "US news", "Golf", "Sport", "Environment"], "webUrl": "https://www.theguardian.com/world/2012/jul/10/donald-trump-golf-course-internet", "publicationDate": "2012-07-10T20:33:16Z", "title": "Donald Trump's new golf course in Scotland: the internet responds"}, {"sentences": ["Environment news • Scientists attribute extreme weather to man-made climate change• Flood protection to cost UK at least £860m by 2015, ministers warned• British farmers told to grow curry ingredients for sustainability• Donald Trump opens controversial Scottish golf course• Rightwing US thinktank uses FoI laws to pursue climate scientists• Baby leatherback turtles die in their thousands in Trinidad blunder• BMW accused of hypocrisy over opposition to European car targets On the blogs     An offshore wind farm in the Thames Estuary."], "tags": ["Environment"], "webUrl": "https://www.theguardian.com/environment/2012/jul/11/green-news-roundup", "publicationDate": "2012-07-11T13:21:37Z", "title": "Green news roundup: Flood protection, Donald Trump and curry"}, {"sentences": ["Castle Stuart has again borne the brunt of inclement weather but the competition&apos;s organisers are confident of a smoother weekend, thereby calming local fears that sponsors could soon look to move the Scottish Open to Royal Aberdeen or Donald Trump&apos;s newly opened course on the outskirts of the city."], "tags": ["Luke Donald", "The Open", "The Open 2012", "Golf", "Sport"], "webUrl": "https://www.theguardian.com/sport/2012/jul/11/luke-donald-scottish-open-world-no1", "publicationDate": "2012-07-11T19:57:38Z", "title": "Luke Donald heads to Scottish Open celebrating a year as world No1"}, {"sentences": ["France\n       Ireland\n       Bolivia\n       Estonia\n      \n     US property magnager Donald Trump has just opened a golf course in which part of Scotland?"], "tags": ["Extra"], "webUrl": "https://www.theguardian.com/extra/quiz/2012/jul/13/friday-quiz-13-july", "publicationDate": "2012-07-13T12:35:00Z", "title": "The Friday quiz"}, {"sentences": ["Based on similar data points, one could posit Romney picking Donald Trump."], "tags": ["Condoleezza Rice", "Mitt Romney", "Barack Obama", "Obama administration", "US news", "US politics", "Republicans", "US Congress", "US taxation", "US elections 2012", "Media", "Race issues", "US economy", "Business", "US unions"], "webUrl": "https://www.theguardian.com/commentisfree/2012/jul/14/amc-week-in-review-condi-mitt", "publicationDate": "2012-07-14T15:43:19Z", "title": "AMC's week in review: Condi, Mitt and more | Ana Marie Cox"}, {"sentences": ["Do you work at Trump Tower?&quot; Right I&apos;m off for scran.", "&quot;On Rob&apos;s &apos;watch&apos;, I&apos;ve been called Clarkson-esque and linked to Donald Trump,&quot; says Matt Dony."], "tags": ["The Open 2012", "The Open", "Golf", "Sport"], "webUrl": "https://www.theguardian.com/sport/2012/jul/19/the-open-2012-round-one-live", "publicationDate": "2012-07-19T18:15:00Z", "title": "The Open 2012: round one –as it happened | Tom Lutz and Rob Bagchi"}, {"sentences": ["He was cruelly cast adrift by the British after Popstars and Survivor, but celebrated by the Yanks on America&apos;s Got Talent for his sub-Donald Trump hairstyle and biting approach to deconstructing hip-hop ballet routines."], "tags": ["US news", "US politics", "World news", "US television", "Television", "Television & radio", "Culture", "Media", "UK news"], "webUrl": "https://www.theguardian.com/media/2012/jul/27/london-olympic-hell-american-dream", "publicationDate": "2012-07-27T17:00:02Z", "title": "Why endure London Olympic hell when you can live the American dream?"}, {"sentences": ["Donald Trump was in the audience, and the baseball star Derek Jeter, and an odd combination of big men with thick necks and skinny hipsters unsure of what to do when Tyson starts throwing the word &quot;faggot&quot; around."], "tags": ["Mike Tyson", "Spike Lee", "Broadway", "Culture", "New York", "US news", "Boxing", "Theatre"], "webUrl": "https://www.theguardian.com/sport/us-news-blog/2012/aug/03/mike-tyson-broadway-debut", "publicationDate": "2012-08-03T16:30:00Z", "title": "Mike Tyson's Broadway debut: weird, a little combative and not very grown up"}, {"sentences": ["The show, directed by Spike Lee, transferred from Las Vegas to New York this week and opening night guests included Donald Trump, Gayle King and Derek Jeter."], "tags": ["Twitter", "Mike Tyson", "NYPD", "US news", "New York", "Broadway", "Theatre", "Technology", "Aurora shooting", "World news", "US crime", "Internet", "Privacy"], "webUrl": "https://www.theguardian.com/technology/us-news-blog/2012/aug/08/twitter-mike-tyson-aurora-threats", "publicationDate": "2012-08-08T15:02:37Z", "title": "Twitter supplies info on Aurora-style threats against Mike Tyson show"}, {"sentences": ["Donald Trump to run for president      Donald Trump running for office is like a game of three-card monty.", "Anyone who knows anything knows that Trump likes to fool around, but at the end of the day, is never going to run.", "Somehow, Morris thought that Trump had great potential.", "Trump would plummet in the polls … and, of course, didn&apos;t run."], "tags": ["US politics", "US news", "US elections 2012", "US Congress", "George Bush", "Bill Clinton", "US television", "Fox News", "Media", "World news", "US elections 2008", "Democrats", "Republicans"], "webUrl": "https://www.theguardian.com/commentisfree/2012/aug/08/is-dick-morris-worlds-worst-political-pundit", "publicationDate": "2012-08-08T22:14:00Z", "title": "Is Dick Morris the world's worst political pundit? | Harry J Enten"}, {"sentences": ["Like many writers who emerged from the folk scene, she is fascinated by history, and there&apos;s a grand sweep of ideas in many of the songs, with King of Birds examining the history of the City of London, and the gently furious Cover Your Eyes mixing childhood memories with an attack on the Trump Corporation golf development in Aberdeenshire."], "tags": ["Folk music", "Music", "Culture"], "webUrl": "https://www.theguardian.com/music/2012/aug/09/karine-polwart-traces-review", "publicationDate": "2012-08-09T21:15:01Z", "title": "Karine Polwart: Traces – review"}, {"sentences": ["Cover Your Eyes takes aim at Donald Trump&apos;s Aberdeen golf course, promising the revenge of the haar (sea fog) for his defilement and &quot;crooked heart&quot;."], "tags": ["Folk music", "Music", "Culture"], "webUrl": "https://www.theguardian.com/music/2012/aug/12/karine-polwart-traces-review", "publicationDate": "2012-08-11T23:05:16Z", "title": "Karine Polwart: Traces – review"}, {"sentences": ["Your wireframes are your blueprints, the architects&apos; drawings to your Trump Tower."], "tags": ["Accessing expertise", "Guardian Small Business Network"], "webUrl": "https://www.theguardian.com/small-business-network/2012/aug/13/small-business-web-design-tips", "publicationDate": "2012-08-13T10:30:00Z", "title": "Mastering the art of web design"}, {"sentences": ["Related: Paul Ryan offers to step down as GOP convention chair if Donald Trump asks    Public records show that on the same day as the meeting, Ryan sold stock in troubled banks including Wachovia and Citigroup and bought shares in Goldman Sachs, Paulson’s old employer and a bank that had been disclosed to be stronger than many of its rivals."], "tags": ["Paul Ryan", "Mitt Romney", "US politics", "US news", "US elections 2012", "Republicans", "Banking", "Banking reform", "Business", "US Congress"], "webUrl": "https://www.theguardian.com/world/2012/aug/13/paul-ryan-sold-shares-banking-crisis", "publicationDate": "2012-08-14T01:19:00Z", "title": "Paul Ryan sold shares on same day as private briefing of banking crisis"}, {"sentences": ["Indeed, while most people visit Borneo to respectfully stroke an orangutan, Cooke prefers that country&apos;s proboscis monkey with its giant bulbous nose, soft pot belly, Donald Trump hair and permanent erection that looks like the world&apos;s least appealing chilli pepper."], "tags": ["Wildlife", "Television"], "webUrl": "https://www.theguardian.com/environment/shortcuts/2012/aug/14/lucy-cooke-war-cute-wildlife", "publicationDate": "2012-08-14T15:05:01Z", "title": "Lucy Cooke and the war on cute wildlife"}, {"sentences": ["Even Donald Trump thinks &quot;it&apos;s a very dirty campaign&quot;, which must be distressing for the germophobic property developer and all-round decent chap.", "It is no surprise whatsoever that Romney&apos;s advisor Eric Ferhnstrom has been leading the &quot;meanest ever&quot; charge, nor that he should be joined in it by Trump, who as birther-in-chief long surrendered any standing to accuse anyone else of meanness."], "tags": ["US politics", "Mitt Romney", "US elections 2012", "Barack Obama", "US news", "World news"], "webUrl": "https://www.theguardian.com/commentisfree/2012/aug/20/meanest-us-election-campaign", "publicationDate": "2012-08-20T12:30:00Z", "title": "The meanest presidential election campaign since … the last one"}, {"sentences": ["The &quot;Donald Trump does anything at all&quot; scenario:  according to several reports, the billionaire self-promoter and hair comedian has been given a &quot;surprise role&quot; on the convention&apos;s opening day, though Trump himself shyly insists it will be &quot;rather minor&quot;."], "tags": ["Republican national convention 2012", "US politics", "Republicans", "Tampa", "Florida", "John McCain", "Sarah Palin", "Mitt Romney", "Paul Ryan", "Natural disasters and extreme weather", "Democrats", "Joe Biden", "Donald Trump"], "webUrl": "https://www.theguardian.com/commentisfree/oliver-burkemans-blog/2012/aug/23/republican-national-convention-2012", "publicationDate": "2012-08-23T22:35:00Z", "title": "The Republican National Convention: what could possibly go wrong? | Oliver Burkeman"}, {"sentences": ["His comment come after years in which Obama has been dogged by conspiracy theorists such as Donald Trump, who argue that Obama was not born in the US and is therefore not eligible to be president.", "&quot;It&apos;s one thing to give the stage in Tampa to Donald Trump, Sheriff Arpaio, and Kris Kobach."], "tags": ["Mitt Romney", "US news", "US politics", "Barack Obama", "World news", "Michigan"], "webUrl": "https://www.theguardian.com/world/2012/aug/24/mitt-romney-birth-certificate-quip", "publicationDate": "2012-08-24T19:23:42Z", "title": "Mitt Romney makes birth certificate quip at Michigan rally"}, {"sentences": ["And then there is another Tea Party favourite who has been given a prominent role in Tampa: real estate mogul and reality TV star Donald Trump.", "Trump has told his fans to prepare for a surprise at Tampa, which is likely to be a video in which he sacks an Obama impersonator and deploys his famous &quot;You&apos;re fired!&quot; catchphrase.", "But having Trump so visible is a political risk."], "tags": ["Republican national convention 2012", "Republicans", "Mitt Romney", "US elections 2012", "US politics", "World news", "US news", "Tea Party movement"], "webUrl": "https://www.theguardian.com/world/2012/aug/25/republican-convention-romney-radical-right", "publicationDate": "2012-08-25T11:22:26Z", "title": "Radical right threatens to blow Mitt Romney off course as Republicans gather in Tampa"}, {"sentences": ["The compressed convention schedule caused another high-profile cancellation: entrepreneur and Romney backer Donald Trump was due to have a speaking slot on Monday, but was bumped from the schedule."], "tags": ["Republican national convention 2012", "US elections 2012", "US news", "US politics", "World news", "Republicans", "Mitt Romney", "Florida", "Hurricanes", "Natural disasters and extreme weather", "Environment", "US weather", "New Orleans", "Hurricane Isaac"], "webUrl": "https://www.theguardian.com/world/2012/aug/27/republicans-disruption-isaac-new-orleans", "publicationDate": "2012-08-27T18:34:00Z", "title": "Republicans braced for more disruption as Isaac heads for New Orleans"}, {"sentences": ["And then, there&apos;s serial hatchet man and noted genealogist Donald Trump.", "I fully understand why her former husband left her for a man – he made a good decision.&quot; All things considered, I think marriage equality advocates would rather not have Trump on their side.", "Why would women support candidates who ally themselves with misogynists such as Trump?"], "tags": ["Republican national convention 2012", "Republicans", "Women", "Gender", "US news", "US politics", "World news", "Abortion", "Contraception and family planning", "Rape and sexual assault", "Society", "US elections 2012"], "webUrl": "https://www.theguardian.com/commentisfree/2012/aug/29/what-do-republican-women-want", "publicationDate": "2012-08-29T11:30:01Z", "title": "What do Republican women want? | Ana Marie Cox"}, {"sentences": ["• This article was amended on 4 September 2012 to remove a reference to Donald Trump opposing the windfarm off Caithness because he believes the turbines will spoil the view from his new golf course."], "tags": ["Wind power", "Energy", "Renewable energy", "Environment", "Scotland", "UK news", "Energy industry", "Business"], "webUrl": "https://www.theguardian.com/environment/2012/aug/31/world-biggest-offshore-windfarm-scotland", "publicationDate": "2012-08-31T16:13:56Z", "title": "World's biggest offshore windfarm planned off Scottish coast"}, {"sentences": ["Three centuries later, Americans still think rich people (even Donald Trump) must be doing something right."], "tags": ["Republicans", "Republican national convention 2012", "Mitt Romney", "Paul Ryan", "Religion", "Todd Akin", "US news", "US politics", "World news", "Catholicism", "Mormonism", "US elections 2012"], "webUrl": "https://www.theguardian.com/commentisfree/belief/2012/sep/01/mitt-romney-paul-ryan-wealthiness-godliness", "publicationDate": "2012-09-01T14:00:01Z", "title": "Why Mitt Romney and Paul Ryan believe wealthiness is next to godliness | Diane Roberts"}, {"sentences": ["• A report about plans to build a windfarm off the Caithness coast in the Moray Firth said the American billionaire Donald Trump opposed the scheme because he believed the turbines would spoil the view from his planned new golf course."], "tags": [], "webUrl": "https://www.theguardian.com/theguardian/2012/sep/04/corrections-and-clarifications", "publicationDate": "2012-09-04T12:23:23Z", "title": "Corrections and clarifications"}, {"sentences": ["Manigault, a considerable presence in &quot;reality&quot; television, made her name as a controversial participant in the American version of The Apprentice with Donald Trump, and feuded with Piers Morgan in The Celebrity Apprentice."], "tags": ["Michael Clarke Duncan", "Film", "Culture", "US news", "World news", "US television", "Vegetarianism", "Veganism"], "webUrl": "https://www.theguardian.com/film/2012/sep/04/michael-clarke-duncan", "publicationDate": "2012-09-04T12:46:21Z", "title": "Michael Clarke Duncan obituary"}, {"sentences": ["Donald Trump&apos;s absurd assurances that Barack Obama&apos;s birth certificate is fake, Mitt Romney&apos;s birth certificate &quot;joke&quot;, the bullfrog chorus of Republicans from John Sununu to Sarah Palin repeatedly croaking that Obama is a socialist/radical/elitist hell-bent on transforming America into France all sound like code for &quot;Oh God!"], "tags": ["Republicans", "Race issues", "Republican national convention 2012", "Mitt Romney", "US news", "World news", "US politics"], "webUrl": "https://www.theguardian.com/commentisfree/2012/sep/10/no-country-for-angry-old-white-men", "publicationDate": "2012-09-10T18:06:00Z", "title": "No country for angry old white men: the GOP's diminishing demographic | Diane Roberts"}, {"sentences": ["   Google founder Sergey Brin and designer Diane von Furstenberg, wearing Google glasses, sit and watch the rehearsal for her spring/summer 2013 collection Photograph: Carlo Allegri/Reuters       Solange Knowles and her son attend the Tibi show  Photograph: Michael Stewart/WireImage       Actress Jessica Chastain talks with Vogue editor Anna Wintour at the Altuzarra show Photograph: Jason DeCrow/AP       David Beckham stands near singer Natasha Bedingfield and Adidas executive Erich Stamminger (second right) before a presentation of the Y-3 spring/summer 2013 collection Photograph: Lucas Jackson/Reuters       Joan Rivers and daughter Melissa Rivers leave one of the shows Photograph: Carlo Allegri/Reuters       Mark Ruffalo at Zero + Maria Cornejo  Photograph: Andrew Burton/Reuters       R.E.M's Michael Stipe and Alicia Keys attend the Edun show Photograph: Chelsea Lauren/Getty Images       Miss USA 2012 Olivia Culpo and Donald Trump attend the Sherri Hill show  Photograph: Wendell Teodoro/WireImage       Ricky Martin at Marc Jacobs  Photograph: Lucas Jackson/Reuters       Actress Sarah Jessica Parker (right) and producer Andy Cohen watch the Diane von Furstenberg show Photograph: Carlo Allegri/Reuters       Rapper A$AP Rocky attends the Alexander Wang show Photograph: Andrew Burton/Reuters       Singer and TV personality Paula Abdul and a guest watch the Carlos Miele spring/summer 2013 collection show  Photograph: Carlo Allegri/Reuters       The New York Knicks' Tyson Chandler at the Altuzarra show  Photograph: Jason DeCrow/AP       US Olympic swimmer Ryan Lochte at the Rebecca Minkoff show Photograph: Andrew H. Walker/Getty       Actress Rose Byrne at the Jill Stuart show Photograph: Andrew Kelly/Reuters  "], "tags": ["New York fashion week spring/summer 2013", "Fashion", "New York fashion week", "Life and style", "Fashion weeks", "Celebrity"], "webUrl": "https://www.theguardian.com/fashion/gallery/2012/sep/11/new-york-fashion-week-celebrity", "publicationDate": "2012-09-11T16:47:00Z", "title": "The famous front row at New York fashion week – in pictures"}, {"sentences": ["If there&apos;s a new hotel in town – and there is: Trump, all black bathrooms and diamanté walls – then that&apos;s where people head."], "tags": ["Toronto film festival 2012", "Joss Whedon", "Steve Coogan", "Julianne Moore", "Christina Hendricks", "Joseph Gordon-Levitt", "Bill Murray", "Ryan Gosling", "William Shakespeare", "Drama", "Science fiction and fantasy", "Film", "Culture", "Toronto film festival", "Jason Reitman", "Festivals", "Cannes film festival", "Venice film festival", "Kevin Spacey", "Mad Men", "Breaking Bad", "Salman Rushdie", "Charles Dickens", "Tom Hanks", "Hugh Grant", "Emily Blunt", "Colin Firth", "Colin Farrell", "Twitter"], "webUrl": "https://www.theguardian.com/film/2012/sep/16/toronto-film-festival-review-2012", "publicationDate": "2012-09-15T23:06:00Z", "title": "Toronto film festival – review"}, {"sentences": ["The anti-wind turbine campaigning body, which is known by the acronym Trump, admitted that the photograph was not of Scotland but was &quot;illustrative&quot; of what could happen of the government took its renewable energy policy forward."], "tags": ["Advertising Standards Authority", "Advertising", "Media", "Wind power", "Energy", "Renewable energy", "Environment", "Scotland", "UK news"], "webUrl": "https://www.theguardian.com/media/2012/sep/19/scottish-anti-wind-turbine-ad-banned", "publicationDate": "2012-09-19T07:15:18Z", "title": "Scottish anti-wind turbine group's ad rapped for using images of Hawaii"}, {"sentences": ["Here&apos;s the email in full (minus personal information):  From: Chris Heaton-Harris MP [mailto:trumpdinnerinlondon@gmail.com] Sent: XX August 2012  Subject: An Invitation: Donald Trump Dinner in London - 6th October 2012 Dear XXXXXX, Please forgive the &quot;cold call&quot; approach, but I was wondering if I could interest you in dinner?I am the Member of Parliament for Daventry and was the person who put together the letter of over 100 MPs calling, so far unsuccessfully, for the Government to drastically reduce the subsidies available for wind turbines and I lead the campaign against these things in Parliament.", "My speaker on the evening is Donald Trump.", "Mobile: XXXXXXXXXWebsite: www.heatonharris.com  Meanwhile, on 8 September, a slightly different invitation appeared on the East Midlands Conservative&apos;s Facebook page:  An invitation from Chris Heaton-Harris MP - dinner with Donald Trump Dear Fellow Conservative, I am writing to tell you about an exciting and very rare dinner opportunity that will take place on Saturday 6th October 2012.", "The well known Republican and business tycoon, Donald Trump, has very kindly agreed to take time out of his busy diary and fly over from New York to support my campaign against onshore wind turbines.", "Like many Conservative Party members, Mr Trump, who owns property in Aberdeen, holds very strong views on the inefficiencies of wind energy.", "At the dinner on 6th October Mr Trump will warn guests as to the very real threat from turbines to Britain&apos;s landscape and tourism industry, with the aim of raising public awareness.", "Obviously, with this dinner being less than a month before the Presidential Election in the United States, Mr Trump will talk about other political newsworthy topics and take a handful of questions.", "In order to accommodate Mr Trump&apos;s busy diary, the dinner is being held in London, at the Emirates Stadium, which is home to Arsenal Football Club.Dinner will start with a champagne reception, followed by a 4 course meal.", "So, even with the star attraction of Donald Trump (who – lest we forget – is opposed to offshore turbines being built within eyesight of his £100m luxury hotel development in Aberdeenshire), Heaton-Harris couldn&apos;t get his anti-wind fundraiser off the ground due to &quot;lack of interest&quot;?", "We are now going to try and hold it in February or March, depending on Mr Trump&apos;s diary."], "tags": ["Environment", "Wind power", "Conservatives", "Donald Trump", "Energy", "Green politics"], "webUrl": "https://www.theguardian.com/environment/blog/2012/sep/20/donald-trump-anti-wind-power-fundraiser", "publicationDate": "2012-09-20T13:08:12Z", "title": "Donald Trump anti-wind power fundraiser fails to get off the ground"}, {"sentences": ["Photograph: Matthew Wright     • Is there even less Arctic sea ice than the satellites show?• Get used to &apos;extreme&apos; weather, it&apos;s the new normal• New cycle safety campaign says: it&apos;s everyone&apos;s responsibility• Donald Trump anti-wind power fundraiser fails to get off the ground Multimedia     epa03388921 An assortment wild daisies in the West Coast National Park near Velddrif, South Africa, 07 September 2012."], "tags": ["Environment"], "webUrl": "https://www.theguardian.com/environment/2012/sep/20/green-news-roundup", "publicationDate": "2012-09-20T15:22:04Z", "title": "Green news roundup: Arctic sea ice, badger cull and mega mine"}, {"sentences": ["There can&apos;t be a lot of people who have lain in bed at the Trump hotel in Toronto and watched The Decalogue, Krzysztof Kieslowski&apos;s 10-hour take on the biblical edicts.", "I cried a little bit too.&quot; Dano is taking a break from communist Warsaw to brunch at Trump&apos;s 31st-floor restaurant."], "tags": ["Film", "Culture", "Toronto film festival", "Toronto film festival 2012", "Daniel Day-Lewis", "Paul Thomas Anderson", "Joseph Gordon-Levitt", "Bruce Willis", "Looper", "Paul Dano"], "webUrl": "https://www.theguardian.com/film/2012/sep/20/paul-dano-like-idea-consequence", "publicationDate": "2012-09-20T19:00:00Z", "title": "Paul Dano: 'I like the idea of consequence'"}, {"sentences": ["We have our little ins and outs and of course there was his recent speech about me [Obama was very funny about Trump at the Washington State Dinner].", "He called the Trump World Tower &quot;a handsome hunk&quot;, which it is.", "I fought my way through a bad situation [Trump was $900m in the red in the early 90s] and now my company is worth more than $8bn, bigger and stronger than it&apos;s ever been.", "My faith [Trump is Presbyterian] keeps me humble, while striving for great things.", "Donald Trump is speaking at the National Achievers Congress, 5-7 October, London ExCel (nationalachieverscongress.co.uk)"], "tags": ["Donald Trump", "Business"], "webUrl": "https://www.theguardian.com/lifeandstyle/2012/sep/23/this-much-know-donald-trump", "publicationDate": "2012-09-22T23:04:16Z", "title": "This much I know: Donald Trump"}, {"sentences": ["We landed at Dyce airport outside Aberdeen, with a fine view of Donald Trump&apos;s personal jet (it has TRUMP in massive capitals along the fuselage, just so he won&apos;t lose it).", "In the welcoming clubhouse, the members are discussing the new Trump course.", "The more visiting golfers to the area, the better for all – and these two courses are half the price of Trump International&apos;s £150 a round."], "tags": ["Golfing holidays", "Scotland holidays", "Travel", "United Kingdom holidays", "Europe holidays", "Whisky", "Food & drink", "Life and style", "Ryder Cup", "Ryder Cup 2012"], "webUrl": "https://www.theguardian.com/travel/2012/sep/23/scotland-golf-holiday", "publicationDate": "2012-09-22T23:05:16Z", "title": "Fairways to heaven – a golfing break in Scotland"}, {"sentences": ["Altogether, in 2011, ABC, CBS, NBC and Fox spent twice as much time discussing Donald Trump&apos;s &quot;will he, won&apos;t he&quot; run for president rather than climate change.", "In fact, NBC&apos;s Meet the Press devoted 23 minutes to Trump that year – but not a single minute to climate change."], "tags": ["Environment", "Climate change", "US news", "World news", "Media", "Barack Obama", "US politics", "United Nations", "Global economy", "Natural disasters and extreme weather", "US television", "Fox News"], "webUrl": "https://www.theguardian.com/commentisfree/2012/sep/23/america-miasma-misinformation-climate-change", "publicationDate": "2012-09-23T12:00:01Z", "title": "America's miasma of misinformation on climate change | Anna M Clark"}, {"sentences": ["Donald Trump does not attribute his success to having shit hair, and men are not devoting the same column inches to this topic."], "tags": ["Miranda Hart", "Beauty", "Life and style", "Culture", "Comedy", "Comedy", "Television"], "webUrl": "https://www.theguardian.com/commentisfree/2012/sep/25/miranda-hart-looks", "publicationDate": "2012-09-25T09:30:03Z", "title": "Hey Miranda Hart, stop going on about your looks | Rhiannon Lucy Cosslett"}, {"sentences": ["His hair is long; his sort-of-beard grows patchily over his face like moss; his wild-teen presence in the airless, business-district Trump International Hotel &amp; Tower seeming somehow absurd."], "tags": ["Film", "Culture", "Toronto film festival 2012", "We Need to Talk About Kevin"], "webUrl": "https://www.theguardian.com/film/2012/sep/29/ezra-miller-perks-of-wallflower", "publicationDate": "2012-09-28T23:00:00Z", "title": "Ezra Miller and the perks of being a new kind of pin-up"}, {"sentences": ["We&apos;ve arranged to meet in the poolside bar of the Trump SoHo, where women in very short dresses and very high heels are shouting in each other&apos;s ears and failing to hear anything over brain-pulverisingly loud Ibiza beats.", "&quot;Well, this,&quot; she says, &quot;is not going to work.&quot; We end up taking refuge in a corner of the half-renovated, closed-off library, which, a member of staff anxiously explains, &quot;hasn&apos;t been Trumpified yet&quot;."], "tags": ["Television & radio", "Homeland"], "webUrl": "https://www.theguardian.com/tv-and-radio/2012/sep/30/claire-danes-interview-homeland", "publicationDate": "2012-09-29T23:05:15Z", "title": "Claire Danes – interview"}, {"sentences": ["The sheer number of world religions given a shout-out in the film – Hindu, Christian, Muslim, Buddhist – is enough to send Donald Trump&apos;s comb-over scampering up the nearest tree trunk, looking for cover."], "tags": ["Ang Lee", "Life of Pi", "Books", "Film", "New York", "US news", "World news", "Film adaptations", "Culture", "3D"], "webUrl": "https://www.theguardian.com/film/2012/sep/30/life-of-pi-review-film", "publicationDate": "2012-09-30T13:19:00Z", "title": "Life of Pi – first look review"}, {"sentences": ["MacFarlane has prior form hosting ceremonies; he has had stints on Saturday Night Live, and served as Roast Master on Comedy Central Roasts of the likes of Donald Trump, Charlie Sheen and David Hasselhoff."], "tags": ["Oscars 2013", "Film", "Oscars", "Culture", "Seth MacFarlane", "Billy Crystal", "Awards and prizes", "Golden Globes", "Ted"], "webUrl": "https://www.theguardian.com/film/2012/oct/01/seth-macfarlane-host-oscars-2013", "publicationDate": "2012-10-01T17:10:42Z", "title": "Seth MacFarlane to host Oscars"}, {"sentences": ["In case of emergency, break out the Donald Trump option.", "\"&mdash; Donald J. Trump (@realDonaldTrump) October 1, 2012    The original version of this story was published on Talking Points Memo."], "tags": ["Mitt Romney", "US politics", "Republicans", "US elections 2012", "Media", "US news", "World news"], "webUrl": "https://www.theguardian.com/world/2012/oct/02/mitt-romney-conservative-pundit-roundup", "publicationDate": "2012-10-02T16:53:00Z", "title": "How Mitt Romney is blowing it, according to Every Conservative Pundit | Benjy Sarlin"}, {"sentences": ["Hello, Mr Trump, how&apos;s New York?", "Speaking of the death of Scotland, how&apos;s the golf course, Trump International Golf Links in Aberdeenshire?", "My apartment is in the Trump Tower in New York and it was easier to build the building than it was the apartment.", "(2)Back to article Donald Trump&apos;s companies have filed for bankruptcy four times.", "(3)Back to article Trump flirted with running for president last year.", "Trump&apos;s best friend Sarah Palin, for one, didn&apos;t release hers until after the election.", "(7)Back to article &quot;Unlikely to provide the fond memory that some worthwhile extravagances do&quot; – New York Times review of Trump International Hotel &amp; Tower Toronto."], "tags": ["Donald Trump", "Business", "US news", "US television", "Politics", "Barack Obama", "Mitt Romney"], "webUrl": "https://www.theguardian.com/world/2012/oct/02/donald-trump-my-hair-amazing", "publicationDate": "2012-10-02T17:50:29Z", "title": "Donald Trump: 'It is my hair and it's an amazing thing'"}, {"sentences": ["But aberrations abound, such as Donald Trump, who insists his comb-over is &quot;100% real&quot;."], "tags": ["Business", "Life and style", "Men's hair"], "webUrl": "https://www.theguardian.com/business/2012/oct/04/bald-men-dominant-image", "publicationDate": "2012-10-04T14:02:50Z", "title": "Bald men have more dominant image, study finds"}, {"sentences": ["On the other side the gaming moguls Sheldon Adelson, Steve Wynn and Donald Trump, with a combined worth greater than $25bn, are investing their reputations and chequebooks to promote Mitt Romney.", "Trump, unabashed by Obama&apos;s Hawaiian birth certificate, has repeatedly depicted the president as a possibly foreign-born left-wing extremist."], "tags": ["Super Pacs", "US elections 2012", "US news", "World news", "Nevada", "Mitt Romney", "Barack Obama", "US politics", "US political financing", "Las Vegas"], "webUrl": "https://www.theguardian.com/world/2012/oct/14/las-vegas-casino-super-pac-election", "publicationDate": "2012-10-14T16:55:00Z", "title": "Las Vegas activists try to 'level the field' as casino moguls pump up Super Pacs"}, {"sentences": ["She started with Cover Your Eyes, a drifting piece that developed into a furious attack on Donald Trump&apos;s controversial golf development on the Aberdeenshire coast, and ended with the threat that the haar, the Scottish sea mist, will take its revenge."], "tags": ["Folk music", "Music", "Culture"], "webUrl": "https://www.theguardian.com/music/2012/oct/15/karine-polwart-review", "publicationDate": "2012-10-15T17:19:51Z", "title": "Karine Polwart – review"}, {"sentences": ["The Lock Master (7-1), Another Trump (7-2) and Lucky Money (7-2)."], "tags": ["Horse racing tips", "Sport", "Horse racing"], "webUrl": "https://www.theguardian.com/sport/blog/2012/oct/17/horse-racing-live-17-october-2012", "publicationDate": "2012-10-17T11:05:00Z", "title": "Talking Horses: Latest news and best bets in our daily racing blog"}, {"sentences": ["The film-maker Bill Forsyth has claimed that people living next to Donald Trump&apos;s golf course have suffered from &quot;malign, egotistical bullying&quot; and &quot;craven&quot; political behaviour comparable to living in communist-era Romania.", "In an article for the Guardian Forsyth said there were striking parallels between the experiences of Trump&apos;s neighbours in Aberdeenshire and the fictional disputes in his cult classic Local Hero involving a US billionaire who wants to buy a remote Scottish beach and village.", "The director, who won a Bafta for Local Hero in 1983, said that a highly critical documentary on the Trump golf course called You&apos;ve Been Trumped, which will be broadcast on UK television for the first time this Sunday, had left him &quot;dazed and shocked&quot;.", "Forsyth, right, said: &quot;We&apos;re watching real lives and livelihoods mercilessly put to hazard by a malign concoction of egotistical bullying, corporate muscle flexing, craven averting of gaze by national politicians and crass misreading of events by local authorities including police.&quot; The documentary, which recorded Trump&apos;s neighbours losing their water supply, having vast earth walls built outside their homes and the film-makers arrested, was &quot;a moving depiction of human survival and dignity amidst murky doings akin to seventies Romania.&quot; Many cited Local Hero after one of Trump&apos;s most stubborn neighbours, Michael Forbes, resisted the property developer&apos;s repeated efforts to buy and demolish his home to expand the golf resort.", "Trump said Forbes&apos;s home was a &quot;pigsty&quot; and a &quot;slum&quot; and called Forbes &quot;dirty&quot; and &quot;a loser&quot;.", "Forsyth writes that Trump emerged from the documentary as an unsophisticated, shallow &quot;Johnny One Note&quot; whose character &quot;would have very limited utility in a sophisticated fictional drama.", "That&apos;s not to deny his usefulness elsewhere, say in a comparatively primitive or cheap drama.&quot; Trump reacted to news that the documentary was being shown on BBC2 by launching a tirade on Twitter against its director, Anthony Baxter, and other &quot;morons&quot; who criticised his now mothballed £750m resort, which was to be built at the course.", "Trump stated: &quot;All the morons that cause the controversy in Scotland have made my development far more successful than anticipated.&quot; He then added that the film, which has now been screened in US cinemas and was acclaimed by the radical filmmaker Michael Moore, had helped him &quot;promote &amp; make Trump International Golf Links Scotland so successful you stupid fool!&quot; In another tweet, he told Baxter: &quot;Your documentary has died many deaths.", "You have, in my opinion, zero talent.&quot; The documentary&apos;s broadcast on Sunday night is an awkward piece of timing for the first minister Alex Salmond, once an influential supporter of Trump&apos;s £750m plan for a major golf resort in his Aberdeenshire constituency.", "The Scottish National party wraps up its annual conference in Perth on Sunday, and the broadcast follows a fresh row over Salmond&apos;s formerly close relationship with Trump.", "It emerged last week the first minister had written privately to Trump seeking his public support for the controversial decision to release Abdelbaset al-Megrahi, the man convicted of the Lockerbie bombing.", "Trump refused.", "The pair have since fallen out publicly over Trump&apos;s repeated attacks on a government-backed offshore windfarm test site planned near his estate north of Aberdeen.", "Those intensified on Tuesday after Trump&apos;s lawyers threatened again to sue Scottish agencies supporting the windfarm proposal.", "Trump&apos;s executive vice president and counsel, George Sorial, would not comment directly on Forsyth&apos;s remarks but said Baxter&apos;s film was &quot;a gross misrepresentation of the facts.&quot; Sorial said the project was widely supported by local people, business leaders and local politicians."], "tags": ["Donald Trump", "Aberdeen", "Scotland", "UK news", "Golf"], "webUrl": "https://www.theguardian.com/world/2012/oct/17/local-hero-donald-trump-bullying", "publicationDate": "2012-10-17T19:35:37Z", "title": "Local Hero film-maker takes swing at Donald Trump for 'malign bullying'"}, {"sentences": ["Recently however, I&apos;ve been obliged to confront reality head-on in the form of the film You&apos;ve Been Trumped.", "Local Hero film poster    It turns out that an old piece of fiction of mine, Local Hero, bears unavoidable comparison with real life events in Aberdeenshire where the property developer Donald Trump is building his &quot;world class&quot; golf resort, captured in Anthony Baxter&apos;s compelling work of factual observation.", "This is certainly true of the local heroines and heroes in You&apos;ve Been Trumped.", "That&apos;s an old Greek word for baddie, but I&apos;m sure my old pal Will would come up with a few spicy Anglo Saxon terms to describe the actual character in the frame, our Mister Trump.", "It&apos;s Donald Trump&apos;s job in the film to stir things up and mess things around.", "How well does Trump accomplish this?", "It could be that Trump was denying Baxter access to his fully rounded self, which comes across as a big mistake, because even a baddie has to be rounded (psychopath excepted, see above).", "Trump&apos;s fellow New Yorker Mel Brooks summed it up in his film The Producers, when a venal money hungry character voiced the ambition to show the world &quot;... the real Hitler, the Hitler with a song in his heart!&quot; That&apos;s a Trump we would have liked to have seen in You&apos;ve Been Trumped.", "So as things stand, the Trump character as essayed in the documentary would have very limited utility in a sophisticated fictional drama.", "That&apos;s the lesson for the factual Trump if he wants to graduate to the fictional.", "As for Mister Trump&apos;s contribution, I see that he&apos;s appropriated at least the cashmere coat of my own eighties&apos; screen villain Happer, but that&apos;s not quite enough.", "Performance-wise, Trump is just &quot;Johnny One Note&quot; from beginning to end."], "tags": ["Environment", "Film", "UK news", "Society", "Scotland", "Donald Trump"], "webUrl": "https://www.theguardian.com/uk/scotland-blog/2012/oct/17/scotland-donald-trump-local-hero", "publicationDate": "2012-10-17T19:46:02Z", "title": "Local Hero and Donald Trump: 'a malign mix of bullying, muscle flexing and craven politicians'"}, {"sentences": ["Donald Trump has pushed the theory."], "tags": ["New York Yankees", "MLB", "US sports", "Sport", "Alex Rodriguez"], "webUrl": "https://www.theguardian.com/sport/blog/2012/oct/18/alex-rodriguez-decline-new-york-yankees", "publicationDate": "2012-10-18T18:17:00Z", "title": "A-Rod by the numbers: explaining the decline of a damned New York Yankee | Harry J Enten"}, {"sentences": ["The film-maker Bill Forsyth has been described by Donald Trump&apos;s organisation as a &quot;misinformed jackass&quot; after he accused the property magnate of &quot;egotistical bullying&quot; at his golf course near Aberdeen.", "In an article for the Guardian, Forsyth said there were strong parallels between Trump&apos;s efforts to remove local people living next to his now mothballed £750m golf resort and Forsyth&apos;s fictional US billionaire in his cult classic Local Hero from 1983, which won the best film Bafta.", "The director said You&apos;ve Been Trumped, an award-winning documentary investigating the experiences of Trump&apos;s nearest neighbours being shown on BBC2 this Sunday, was &quot;akin to 1970s Romania&quot;.", "He said: &quot;We&apos;re watching real lives and livelihoods mercilessly put to hazard by a malign concoction of egotistical bullying, corporate muscle-flexing, craven averting of gaze by national politicians and crass misreading of events by local authorities, including police.&quot; Trump&apos;s right-hand man, George Sorial, retorted that Forsyth was simply trying to exploit Trump&apos;s fame.", "He told the Daily Mail: &quot;Mr Forsyth is nothing more than a misinformed jackass looking for a few headlines on the back of the Trump name.&quot; Sorial had initially refused to respond to Forsyth&apos;s criticisms after being contacted by the Guardian on Wednesday.", "Earlier this week, Trump published several hostile tweets about the documentary by Anthony Baxter, describing those who objected to his golf course as &quot;morons&quot; who had &quot;made my development far more successful than anticipated&quot;.", "Meanwhile a major anti-windfarm campaign which Trump had promised to support, at one point pledging up to £10m to fund legal challenges to fight windfarm applications, has suffered a public split on the eve of a demonstration at the Scottish National party&apos;s conference because of its ties with the property magnate.", "Trump offered legal and financial help earlier this year for Communities Against Turbines (CATS), the main Scotland-wide coalition of local anti-windfarm protest groups.", "But the organiser of the protest in Perth on Saturday against Alex Salmond&apos;s &quot;ruinous&quot; drive to dramatically increase renewable energy production in Scotland, said Trump&apos;s influence has been a &quot;distraction&quot; for the anti-windfarm movement&apos;s supporters.", "She said: &quot;Trump has been a distraction from the thousands of ordinary Scottish folk who feel outraged by the government&apos;s relentless push to turbinise Scotland whatever the cost.", "They are not being listened to, they feel helpless and they are crying out for action.&quot; Kim Terry, the secretary and treasurer of CATS, said Trump had only given it a small donation and it was no longer working with him."], "tags": ["Donald Trump", "Scotland", "Documentary", "Film", "Culture", "World news", "UK news"], "webUrl": "https://www.theguardian.com/world/2012/oct/19/donald-trump-organisation-film-maker", "publicationDate": "2012-10-19T12:00:22Z", "title": "Donald Trump's organisation attacks film-maker as 'misinformed jackass'"}, {"sentences": ["It&apos;s hardly an exposé of inequality: Grant revels in the salubriousness of it all, meeting, among others, Gene Simmons and Donald Trump and delighting at anecdotes about Leona Helmsley, billionaire proprietor of the New York Palace hotel, who was eventually sent down for tax evasion."], "tags": ["Television", "Television & radio", "Culture"], "webUrl": "https://www.theguardian.com/tv-and-radio/2012/oct/21/tv-listings-preview-22-26-october", "publicationDate": "2012-10-21T18:00:01Z", "title": "TV listings and previews: plan your week's viewing - 22-26 October"}, {"sentences": ["That&apos;s the story of You&apos;ve Been Trumped (BBC2, Sunday).", "The hotel complex is on hold while Donald Trump (another correction, but over here that means fart) waits to see if an offshore windfarm he says will spoil the view wins approval.", "It it extraordinary that Trump&apos;s monstrosity ever got the green light – given that planning was denied by the council on the grounds that it was unsustainable and messed with an SSSI (the decision was overturned in the Scottish government).", "&quot;We&apos;ve had tremendous support from environmental groups,&quot; says Trump.", "It&apos;s not just the sand and the birds Trump interferes with, it&apos;s the people who live there and have always lived there – Michael, Molly, Susan, Finlay, David.", "Baxter asked for – and was refused – interviews with the Scottish government, with the Grampian police (who detained him), with Trump himself.", "Trump did find time to tweet him: &quot;Your documentary has died many deaths,&quot; he wrote."], "tags": ["Donald Trump", "Golf", "Business", "Sport", "Television", "Television & radio", "Culture", "World news"], "webUrl": "https://www.theguardian.com/tv-and-radio/2012/oct/21/youve-been-trumped-tv-review", "publicationDate": "2012-10-21T22:30:02Z", "title": "TV review: You've Been Trumped; The Thick Of It"}, {"sentences": ["Donald Trump tried to force the BBC to drop the broadcast of a critically acclaimed documentary on his alleged bullying of residents near his Scottish golf resort.", "Lawyers for the New York property magnate contacted the BBC two days before the feature-length film You&apos;ve Been Trumped was screened on BBC2 on Sunday night, claiming it was highly defamatory, biased and misleading, and demanding a right of reply.", "In a letter to the BBC from Dundas &amp; Wilson, a prominent Scottish law firm which has acted for Trump for several years, and seen by the Guardian, the Trump organisation threatened to complain formally to Ofcom and the BBC Trust if the screening went ahead.", "Trump&apos;s organisation retaliated saying it was appalled by the BBC&apos;s decision to show the &quot;highly biased and manipulative so-called documentary&quot;.", "George Sorial, Trump&apos;s chief counsel, said the trust should sack Roger Mosey, the acting director of BBC Vision.", "&quot;The BBC is now an active participant in what many who are familiar with Baxter&apos;s work know is a complete false telling of the story behind the construction of Trump Golf Scotland,&quot; Sorial told the Guardian.", "&quot;We&apos;re filing complaints with Ofcom and the BBC Trust and are considering other available legal actions.&quot; Sarah Malone, the executive vice-president of Trump International Golf Links, who featured in the film, said: &quot;We totally denounce the BBC for further abandoning its own editorial integrity by blatantly refusing us a right of reply at the end of the broadcast last night.", "It is not a documentary – it is a piece of propaganda that is wildly inaccurate, defamatory and deliberately misleading.&quot; She said Baxter had sought to make &quot;a sensationalist, Local Hero story, through underhand, clandestine means, in the hope of making money off the Trump name.", "&quot;You&apos;ve Been Trumped is an award-winning film that has been screened at international festivals around the world,&quot; it said.", "&quot;During the making of the film, Donald Trump declined the opportunity to take part.", "We are confident that Donald Trump was offered sufficient right to reply in accordance with BBC editorial guidelines.", "Donald Trump chose not to participate but the film-maker took care to reflect his views on a number of different occasions in the film.", "&quot;In addition, Donald Trump was offered the chance to be interviewed live on the BBC following the BBC2 broadcast.", "He has not taken up our invitation.&quot; Trump has refused to see the film but on Twitter last week he described his critics as &quot;morons&quot;.", "Baxter said he repeatedly asked Trump for an interview while he was making the documentary but none of the offers were taken up.", "The film showed Baxter asking Trump to respond to allegations of bullying and ill-treatment against local residents a number of times.", "It featured Trump talking 16 times and quoted his supporters backing the project.", "Baxter said: &quot;At one press conference, Donald Trump claimed I wasn&apos;t a real journalist, and at one stage his organisation put out statements claiming I was working for the [protest group] Tripping Up Trump, and I was actually banned from some press events."], "tags": ["Donald Trump", "Documentary", "BBC2", "BBC", "Media", "Television industry", "Scotland", "Roger Mosey", "US news", "UK news", "World news", "Film", "Travel & leisure", "Commercial property"], "webUrl": "https://www.theguardian.com/media/2012/oct/22/donald-trump-bbc-film-row", "publicationDate": "2012-10-22T16:17:39Z", "title": "Donald Trump lawyers tried to stop BBC showing Scottish bullying film"}, {"sentences": ["• As the election campaign grinds towards an excruciatingly close result, one person not biting his nails is Donald Trump – because, he explains, he&apos;s in possession of a &quot;bombshell&quot; secret that could swing the race.", "Aficionados of Trump surprises (not to be confused with surprise trumps, though it&apos;s an easy mistake to make) may recall his promise of a similar &quot;big surprise&quot; for the Republican National Convention in August.", "Or b) actually there was no option b), because it was so obviously going to be a tedious video in which Trump pretended to fire Barack Obama.", "&quot;I know one thing,&quot; Trump told his Fox questioners about Wednesday&apos;s incendiary revelation."], "tags": ["US elections 2012", "US news", "US politics", "Donald Trump", "CBS", "World news", "Arizona", "Florida", "Utah"], "webUrl": "https://www.theguardian.com/world/2012/oct/22/donald-trump-election-bombshell-promise", "publicationDate": "2012-10-22T17:18:28Z", "title": "Oliver Burkeman's election diary: Trump primes media for a bombshell"}, {"sentences": ["Always treated me fairly.&mdash; Donald J. Trump (@realDonaldTrump) October 23, 2012    Then Schieffer kicked off the debate by asking a particularly convoluted question on Libya:   The first segment is the challenge of a changing Middle East and the new face of terrorism."], "tags": ["US presidential debates 2012", "CBS", "Media", "US politics", "US news", "Mitt Romney", "Barack Obama"], "webUrl": "https://www.theguardian.com/world/us-news-blog/2012/oct/23/bob-schieffer-moderator-role-criticised", "publicationDate": "2012-10-23T04:33:53Z", "title": "Bob Schieffer's muted moderator role in final US presidential debate"}, {"sentences": ["Daily Express, P16 Also on MediaGuardian.co.uk today Virgin Media adds 60,000 internet subscribers High-speed broadband and Usain Bolt ad campaign help company boost internet customer base to 4.2 million Jeff Ford to leave Channel 5 Long-serving Channel 5 executive departs Richard Desmond-owned broadcaster after two years as director of programmes Trump lawyers tried to stop BBC showing Scottish bullying filmYou&apos;ve Been Trumped alleges bullying by US property magnate Frankie Boyle wins more than £50,000 libel damages from Daily MirrorJury decides comedian was libelled by claims he is a &apos;racist&apos; and that he was &apos;forced to quit&apos; BBC show Mock the Week Daily Mail, Daily Mirror fined for contempt Newspapers fined £10,000 each over coverage of Levi Bellfield&apos;s conviction for the abduction and murder of Milly Dowler Channel 4 cleared over MacKenzie reportOfcom rules that Alex Thomson&apos;s report following Hillsborough Panel findings did not breach privacy of the former Sun editor The Herald&apos;s editor steps downJonathan Russell is stepping down after weeks of speculation about his future."], "tags": ["Media"], "webUrl": "https://www.theguardian.com/media/2012/oct/23/1", "publicationDate": "2012-10-23T08:33:36Z", "title": "Today's media stories from the papers"}, {"sentences": ["     Donald Trump has released a web video in which he offers to donate $5m to charity if President Obama releases his college records.", "Trump has previously said he was donating millions to a Super Pac supporting the Romney campaign.", "In the video, Trump says, &quot;I have a deal for the president, a deal that I don&apos;t believe he can refuse, and I hope he doesn&apos;t. &quot;If Barack Obama opens up and gives his college records and applications, and if he gives his passport applications and records, I will give to a charity of his choice … a check, immediately, for $5m.&quot; Trump did give $100,000 to a Super Pac linked to House majority leader John Boehner."], "tags": ["Donald Trump", "US elections 2012", "US news", "World news", "Barack Obama"], "webUrl": "https://www.theguardian.com/world/2012/oct/24/donald-trump-october-surprise-video", "publicationDate": "2012-10-24T16:28:00Z", "title": "Donald Trump's 'October surprise' a bribe for Obama's college records"}, {"sentences": ["      • Possibly the least credible statement in the election campaign so far – and that&apos;s an extremely crowded field – appeared on the Facebook page of angry multimillionaire and windfarm-hating germophobe Donald Trump, in advance of what he promised would be a gamechanging &quot;October Surprise&quot; revelation about Barack Obama.", "&quot;This is not a media event or about Donald J Trump,&quot; he wrote – a claim that, if true, would have made it unique in his professional career.", "&quot;This is about the United States of America.&quot; Oh, but it very much was about Donald J Trump – and far from being a gamechanging revelation, the much reported revelation, when it finally came, wasn&apos;t even a revelation.", "It was a two-and-three-quarter-minute YouTube video in which the mogul, sitting behind a desk and seemingly channelling the spirit of a Bond villain, offered Obama &quot;a deal I don&apos;t believe he can refuse.&quot;  It was this: &quot;If Obama opens up and gives his college records and applications, and if he gives his passport applications and record, I will give to a charity of his choice … a cheque, immediately, for $5m (£3.1m).&quot; And so the political media slunk away, feeling soiled that they&apos;d let Trump manipulate them so easily, and swearing not to be so gullible again.", "Besides, there was an important story to cover: the celebrity feminist lawyer Gloria Allred, Trump&apos;s opposite in almost every sense except in her enthusiasm for self promotion, announced that she&apos;d soon be revealing material damaging to Mitt Romney."], "tags": ["US elections 2012", "US news", "US politics", "World news", "Donald Trump", "Lindsay Lohan", "Anna Wintour"], "webUrl": "https://www.theguardian.com/world/2012/oct/24/election-diary-donald-trump", "publicationDate": "2012-10-24T17:21:14Z", "title": "The Donald trumps even himself for idiocy | Oliver Burkeman's US election diary"}, {"sentences": ["&quot;As President, Mitt Romney will create jobs and give American workers the recovery they deserve.&quot;     Updated at 11.04pm BST     10.10pm BST       The Guardian&apos;s Adam Gabbatt calls Donald Trump&apos;s office to ask for his college records and passport records.", "Updated at 5.53pm BST     5.34pm BST       SWAK    Photo of the day: twitter.com/BarackObama/st…&mdash; Barack Obama (@BarackObama) October 24, 2012        5.31pm BST       An aide to Donald Trump said in September that Trump planned to give &quot;millions&quot; to support Mitt Romney&apos;s candidacy.", "So far there&apos;s no indication that that has happened, although Trump did write a check for $100,000 to a Republican Super PAC.", "Today Trump released a video offering to give $5m to the charity of the president&apos;s choice if the president released his college records.", "Mitt Romney (L) and Donald Trump shake hands during a news conference held by Trump to endorse Romney for president at the Trump International Hotel & Tower Las Vegas February 2, 2012 in Las Vegas, Nevada.", "Here&apos;s a summary of where things stand:  • Literally certified bushwa artist and media puppet master Donald Trump of New York, New York, has telegraphed a punch against the president to land at noon ET.", "Idea: let's put Gloria Allred and Donald Trump in a steel cage death match with tire irons, and ignore whoever survives.&mdash; David Burge (@iowahawkblog) October 24, 2012   • A CBS/Quinnipiac poll released today &quot;found that, riding a wave of strong support among women, President Barack Obama holds a 50 - 45 percent lead&quot; in Ohio."], "tags": ["US politics", "World news", "US news"], "webUrl": "https://www.theguardian.com/world/richard-adams-blog/2012/oct/24/romney-obama-october-surprise-politics-live", "publicationDate": "2012-10-24T22:04:54Z", "title": "Romney and Obama braced for duelling 'October surprises' – US politics live"}, {"sentences": ["While Donald Trump had no problem demanding that Barack Obama reveal details about his passport and time at college on Wednesday, the billionaire business mogul proved rather less forthcoming when it came to a request for information about himself.", "Trump announced on Wednesday that he would donate $5m to a charity of Obama&apos;s choosing, if the president handed over his &quot;college records and applications, and passport application and records&quot;.", "But when the Guardian contacted Trump&apos;s office to ask for Trump&apos;s college and passport records, it was accused of &quot;trying to be funny&quot; and the request was deemed to be &quot;stupid&quot;.", "&quot;I tell you what, he&apos;ll provide them to you when you provide yours to him,&quot; said Michael Cohen, executive vice president at the Trump Organization and special counsel to Trump, in what began as a friendly encounter.", "I readily agreed to the deal, and offered to provide my college records and passport-application records to the Trump office for inspection.", "Mr Trump&apos;s not the president of the United States and he&apos;s not running for the presidency,&quot; Cohen said.", "&quot;And pretty much all you need to do is go to one of the thousand different books that Mr Trump has been featured in or has written and so on, and you could learn more about him than you know about pretty much anybody on the planet.&quot; Trump has authored and co-authored at least 18 books, including: Trump: The Art of the Deal; Trump: How to Get Rich; and Trump: Surviving at the Top.", "Unfortunately, none of Trump&apos;s oeuvre graces the bookshelves at the Guardian&apos;s New York office – an oversight which is in the process of being rectified.", "Why don&apos;t you turn around and say if Mr Trump releases all of his records to you, you will donate $5m to the charity of his choice?&quot; I pointed out that I did not have $5m to hand.", "Your reporter protested that if Trump was demanding that others producer their records, it was only fair that he produced his own.", "Cohen said: &quot;Do you not think Mr Trump has been scrutinised his entire life?&quot; Surely, I countered, Obama, as president of the United States, had also been subject to considerable scrutiny?", "&quot;No, actually Mr Trump does not [think that],&quot; Cohen said.", "&quot;I tell you what, since you want our records, do it under the terms Mr Trump has.", "Make a donation to Mr Trump&apos;s favourite charity.&quot;  I agreed to a donation, but said that it would probably not amount to $5m.", "Not being able to put my hands on even so modest a sum as this, I attempted to steer the conversation back to the original suggestion – that Trump would turn over his records in exchange for mine, for free.", "Cohen promised that he would &quot;take it up with Mr Trump&quot;.", "So, sadly, we are probably not going to get Donald Trump&apos;s college records and passport-application details."], "tags": ["Donald Trump", "Barack Obama", "US elections 2012", "US news", "US politics"], "webUrl": "https://www.theguardian.com/world/us-news-blog/2012/oct/24/donald-trump-barack-obama-records", "publicationDate": "2012-10-25T07:15:00Z", "title": "Donald Trump wants to see Obama's college and passport records... but won't reveal his own"}, {"sentences": ["     It is no secret that there is little love lost between Donald Trump and Barack Obama, with the latter&apos;s origins and place of birth increasingly an obsession for the former.", "When we finally moved to America, I thought it would be over.&quot; On Monday Trump promised a &quot;gigantic&quot; announcement about Obama that could change the course of the presidential race.", "Trump said: &quot;I have a deal for the president, a deal that I don&apos;t believe he can refuse, and I hope he doesn&apos;t. If Barack Obama opens up and gives his college records and applications, and if he gives his passport applications and records, I will give to a charity of his choice – inner-city kids in Chicago, American Cancer Society, Aids research, anything he wants – a cheque, immediately, for $5m.&quot; Critics accused the mogul of pulling another publicity stunt.", "The comedian Andy Borowitz tweeted: &quot;Attention parents: if you give your children even the tiniest bit of attention now, maybe they won&apos;t grow up to be Donald Trump.&quot; Jim Geraghty, of the conservative National Review, posted: &quot;If at any point you seriously considered Donald Trump for president, please study the error of your ways in quiet, private contemplation.&quot; Trump defended his actions, tweeting: &quot;This is not a media event or about Donald J Trump – this is about the United States of America.&quot; He added: &quot;&apos;The response has been fantastic – actually overwhelming!"], "tags": ["Barack Obama", "Donald Trump", "US elections 2012", "US politics", "US news", "World news"], "webUrl": "https://www.theguardian.com/world/2012/oct/25/donald-trump-kenyan-barack-obama", "publicationDate": "2012-10-25T08:44:10Z", "title": "Donald Trump has a Kenyan childhood grudge, jokes Barack Obama"}, {"sentences": ["There was something bizarre, sad and deeply unsettling about Donald Trump&apos;s much-hyped &quot;bombshell&quot; announcement on the US presidential election.", "Nevertheless, the stunt had the desired effect that Trump stunts always do – lulling people into thinking that, love him or loathe him, Donald Trump is, first and foremost, a celebrity, a television star, and an entertainer.", "However, there is another side to Trump, as the 1 million viewers who watched my film, You&apos;ve Been Trumped, on BBC2 this week can attest.", "And this Trump is not harmless.", "Trump&apos;s first career is as a property developer, and his foray into Scotland to build a golf course has resulted in the needless destruction of a site of special scientific interest.", "And there is widespread fear Grampian police have been acting as Trump&apos;s private security force.", "But from the thousands of tweets and emails we have received this week following the broadcast, what really gets viewers&apos; ire up is not so much what Trump did, and even how he behaved, but how he was able to get away with it.", "Trump is a businessman out to get the best deal he can.", "Trump certainly got his way when he convinced the Scottish government to ignore years of careful environmental planning and give him permission to build a luxury resort on what one scientist called &quot;the crown jewels of Scotland&apos;s natural heritage&quot;.", "When in July 2010 my colleague Richard Phinney and I were arrested and put in an Aberdeen jail cell and charged with &quot;breach of the peace&quot; for interviewing Trump&apos;s greenkeeper, the National Union of Journalists called it an &quot;unprecedented&quot; infringement of press freedom.", "It was also a reflection of the kind of intimidation felt by local residents, who believed the police were firmly on Trump&apos;s side in the many disputes that arose during construction.", "Salmond and his ministers also passed up two opportunities to see You&apos;ve Been Trumped at the Scottish parliament in Edinburgh and at dozens of cinema screenings up and down the country.", "To the residents who have had to deal with the Bond villain Trump and his cronies, Salmond&apos;s response – or the lack of one – is deeply insulting and they are right to call it a cover-up."], "tags": ["Donald Trump", "World news", "Barack Obama", "Scotland", "UK news", "Alex Salmond", "Politics", "Conservation", "Environment", "Aberdeen", "Golf", "Sport", "Scottish politics"], "webUrl": "https://www.theguardian.com/commentisfree/2012/oct/25/donald-trump-joke-not-harmless", "publicationDate": "2012-10-25T12:38:38Z", "title": "Donald Trump is a joke, but not a harmless one | Anthony Baxter"}, {"sentences": ["Whether it&apos;s GOP Senate candidates Richard Mourdock and Todd Akin disparaging rape survivors, Rush Limbaugh referring to Georgetown student Sandra Fluke as a &quot;slut&quot; and a &quot;prostitute&quot; after she spoke in support of mandating insurance coverage for contraception, or Donald Trump demanding Obama&apos;s college transcripts, Romney has chosen polite distance over forthright denunciation, preferring to cajole than confront."], "tags": ["Colin Powell", "George Bush", "George HW Bush", "US politics", "US news", "US elections 2012", "Mitt Romney", "Republicans", "Iraq", "Race issues", "World news", "US foreign policy", "Massachusetts"], "webUrl": "https://www.theguardian.com/commentisfree/2012/oct/25/colin-powell-endorsement-vote-obama-romney", "publicationDate": "2012-10-25T16:27:00Z", "title": "Colin Powell's endorsement: less a vote for Obama than a vote against Romney | Gary Younge"}, {"sentences": ["• Where now for multimillionaire self-embarrasser, journalist-manipulator and Scotland-annoyer Donald Trump, after yesterday&apos;s heartless announcement that he&apos;d be withholding $5m from deserving charities unless the president did something he&apos;d obviously never do?", "The New York property news site The Real Deal reports that Trump, who enjoys pretending to &quot;fire&quot; people, has been fired in a non-pretend fashion, after the board of one of his flagship buildings, Manhattan&apos;s Trump Place, voted to replace the Trump Organisation as the building&apos;s manager.", "&quot;At long last, you have made yourself irrelevant,&quot; he writes, and vows, on behalf of his employer the Daily Beast, no further coverage of Trump&apos;s antics for the foreseeable future."], "tags": ["Barack Obama", "Mitt Romney", "Republicans", "US politics", "World news", "Democrats", "US elections 2012"], "webUrl": "https://www.theguardian.com/world/2012/oct/25/obama-romney-bullshitter-rolling-stone", "publicationDate": "2012-10-25T18:00:39Z", "title": "Barack Obama calls Romney a 'bullshitter' – and the election just got a whole lot coarser"}, {"sentences": ["Registered Voters: #Obama 48% (-), #Romney 47% (-);Likely Voters: Romney 50% (-), Obama 47% (-)... gallup.com/poll/150743/Ob…&mdash; gallupnews (@gallupnews) October 25, 2012        6.18pm BST       Here&apos;s some lunchtime fun for you: conservative firebrand Michelle Malkin is figuratively kicking Donald Trump to death on Twitter:    There are people who defend/espouse conservatism on TV.", "You can tell the difference.&mdash; Michelle Malkin (@michellemalkin) October 25, 2012   The Malkin/Trump bad blood goes back some way, but what kicked it off today appears to be this trolling from Trump:    How does @michellemalkin get a conservative platform?", "She is a dummy--just look at her past.&mdash; Donald J. Trump (@realDonaldTrump) October 25, 2012   There&apos;s not a lot of love for Malkin on the left but she&apos;s a serious conservative.", "Which is more than you can say about Trump."], "tags": ["Rape and sexual assault", "US politics", "Abortion", "US news", "World news"], "webUrl": "https://www.theguardian.com/world/2012/oct/25/mourdock-republicans-obama-voting-live", "publicationDate": "2012-10-26T00:49:37Z", "title": "Republicans run for cover from Mourdock rape remarks as Obama prepares for early vote - US politics live"}, {"sentences": ["Donald Trump is being taken semi-seriously."], "tags": ["US politics", "US news", "World news"], "webUrl": "https://www.theguardian.com/world/2012/oct/29/oliver-burkeman-us-election-diary", "publicationDate": "2012-10-29T18:40:24Z", "title": "A buffet of improbable outcomes"}, {"sentences": ["Remember, before Donald Trump replaced bedbugs as America&apos;s No 1 pest, he stepped up and forked out the cash to finally finish the skating rink in Central Park?"], "tags": ["Super Pacs", "US news", "US politics", "US political financing", "World news", "Hurricane Sandy", "Hurricanes", "New York", "New Jersey", "Natural disasters and extreme weather"], "webUrl": "https://www.theguardian.com/commentisfree/2012/oct/30/superpacs-superstorm-sandy-disaster-relief", "publicationDate": "2012-10-30T16:50:50Z", "title": "Super Pacs, superstorm Sandy just gave you a great cause for your millions | Lizz Winstead"}, {"sentences": ["Or, as he puts it: &quot;376 families.&quot; Not all buildings in Manhattan are like Trump Tower."], "tags": ["Hurricane Sandy", "New York", "US news", "World news", "Natural disasters and extreme weather", "Hurricanes"], "webUrl": "https://www.theguardian.com/commentisfree/2012/oct/31/sandy-new-york-doormen", "publicationDate": "2012-10-31T16:47:51Z", "title": "Superstorm Sandy: New York doormen stay to help residents | Ariel Leve"}, {"sentences": ["As well as a mansion in Monaco and a sleek 165-footer on the water, you can probably get an accurate measure of the man by the fact he has paid £62m to buy Maison de L&apos;Amitié, Donald Trump&apos;s old pad in Florida, with its 18 bedrooms and private beach."], "tags": ["Roberto Mancini", "Manchester City", "Monaco", "Sheikh Mansour", "Football", "Sport"], "webUrl": "https://www.theguardian.com/football/blog/2012/nov/01/roberto-mancini-manchester-city-monaco", "publicationDate": "2012-11-01T16:55:22Z", "title": "Roberto Mancini: why was he tempted to make a golden move? | Daniel Taylor"}, {"sentences": ["The fact is, Mr Adelson is among the world&apos;s greatest philanthropists and has created tens of thousands of jobs throughout his business career.&quot; What vaulted Adelson into a league Donald Trump can only dream of was Macau, the former Portuguese colony that is part of China and hosts gambling under the &quot;one country, two systems formula&quot;."], "tags": ["Super Pacs", "US elections 2012", "Nevada", "Mitt Romney", "Newt Gingrich", "US political lobbying", "US politics", "Republicans", "US news", "World news", "Benjamin Netanyahu", "Israel", "Media", "Newspapers"], "webUrl": "https://www.theguardian.com/world/2012/nov/01/sheldon-adelson-billions-politics-influence", "publicationDate": "2012-11-01T18:07:00Z", "title": "Sheldon Adelson's billions shape US politics as many question his influence"}, {"sentences": ["On Twitter, political know-it-alls dismissed the mayor weighing in as an ineffectual gesture by an east coast elite with sarcasm along the lines of &quot;I&apos;d been waiting for the New York billionaire to tell me what to do!&quot; (Of course, for some reason, we&apos;re still paying attention to Donald Trump.)"], "tags": ["Michael Bloomberg", "Barack Obama", "US elections 2012", "US politics", "Climate change", "Hurricane Sandy", "Natural disasters and extreme weather", "US news", "World news", "Mitt Romney", "US economy"], "webUrl": "https://www.theguardian.com/commentisfree/2012/nov/01/bloomberg-obama-endorsement-vote-big-government", "publicationDate": "2012-11-01T21:24:37Z", "title": "Bloomberg's Obama endorsement is a vote for big government in time of crisis | Ana Marie Cox"}, {"sentences": ["After the president produced his long-form birth certificate, Donald Trump demanded his college transcripts (claiming he was not smart enough to get into an Ivy League school)."], "tags": ["US elections 2012", "Barack Obama", "US news", "US politics", "World news", "Poverty", "US economic growth and recession"], "webUrl": "https://www.theguardian.com/commentisfree/2012/nov/03/obama-african-americans-paradox", "publicationDate": "2012-11-03T16:44:00Z", "title": "Barack Obama and the paradox behind his African American support base | Gary Younge"}, {"sentences": ["But only because attention-seeking birther conspiracist and hair innovator Donald Trump was, for inexplicable reasons, already world-famous."], "tags": ["World news", "US elections 2012", "US news", "US politics", "Mitt Romney", "Barack Obama", "Republicans", "Democrats"], "webUrl": "https://www.theguardian.com/world/2012/nov/06/oliver-burkeman-election-diary-awards", "publicationDate": "2012-11-06T08:59:01Z", "title": "The 2012 Presidential Campaign Awards"}, {"sentences": ["Donald Trump has attacked Barack Obama&apos;s US election victory on Twitter, calling it a &quot;travesty&quot; and a &quot;disgusting injustice&quot;.", "— Donald J. Trump (@realDonaldTrump) November 7, 2012  He went on:  This election is a total sham and a travesty.", "— Donald J. Trump (@realDonaldTrump) November 7, 2012  and continued to tweet that the country was in &quot;serious and unprecedented trouble … like never before&quot;.", "— Donald J. Trump (@realDonaldTrump) November 7, 2012  Trump suggested the House of Representatives, which is still controlled by the Republican party, should &quot;hold our country together&quot;, writing:  Hopefully the House of Representatives can hold our country together for four more years...stay strong and never give up!", "— Donald J. Trump (@realDonaldTrump) November 7, 2012   He also suggested representatives &quot;shouldn&apos;t give anything to Obama unless he terminates Obamacare&quot;."], "tags": ["Donald Trump", "US elections 2012", "US politics", "US news"], "webUrl": "https://www.theguardian.com/world/2012/nov/07/donald-trump-twitter-tirade-obama", "publicationDate": "2012-11-07T07:45:00Z", "title": "Donald Trump launches Twitter tirade over Barack Obama's victory"}, {"sentences": ["As we know, Donald Trump is less sanguine about this issue:    This election is a total sham and a travesty.", "We are not a democracy!&mdash; Donald J. Trump (@realDonaldTrump) November 7, 2012     The electoral college is a disaster for a democracy.&mdash; Donald J. Trump (@realDonaldTrump) November 7, 2012   And he’s hoping the Republicans can block the president’s second-term agenda as they have frustrated many parts of his first:    Hopefully the House of Representatives can hold our country together for four more years...stay strong and never give up!&mdash; Donald J. Trump (@realDonaldTrump) November 7, 2012     House of Representatives shouldn't give anything to Obama unless he terminates Obamacare.&mdash; Donald J. Trump (@realDonaldTrump) November 7, 2012        7.35am GMT    Tea party hits out at Romney    Did Romney lose because he was a “weak moderate”?"], "tags": ["US news", "US politics", "Wisconsin", "World news"], "webUrl": "https://www.theguardian.com/world/blog/2012/nov/07/obama-reelection-senate-democrats-live", "publicationDate": "2012-11-07T14:06:00Z", "title": "Barack Obama wins second term in decisive victory – reaction as it happened"}, {"sentences": ["We should have a revolution in this country!&quot; noted Donald Trump, in a tweet that he slyly deleted once it became clear that, in fact, Obama had actually won the popular vote.", "&quot;The world is laughing at us,&quot; Trump added, apparently without irony."], "tags": ["US elections 2012", "Karl Rove", "Donald Trump", "Mitt Romney", "Republicans", "US politics", "US news", "World news"], "webUrl": "https://www.theguardian.com/world/2012/nov/07/donald-trump-karl-rove-revolution", "publicationDate": "2012-11-07T19:26:30Z", "title": "Donald Trump and Karl Rove lead calls for revolution"}, {"sentences": ["Photograph: Martin H Simon/Corbis    Donald Trump: Quite."], "tags": ["US elections 2012", "US politics", "US news", "Karl Rove", "Donald Trump", "Kid Rock", "Bill Clinton", "Barack Obama", "Condoleezza Rice"], "webUrl": "https://www.theguardian.com/world/2012/nov/07/us-elections-2012-winners-losers", "publicationDate": "2012-11-07T19:32:00Z", "title": "US election 2012: winners and losers"}, {"sentences": ["On Twitter, meanwhile, Donald Trump called for a &quot;march on Washington&quot; and a &quot;revolution&quot;, while the most unpleasant instant response probably came from Fox&apos;s Bill O&apos;Reilly: &quot;Obama wins because it&apos;s not a traditional America anymore."], "tags": ["US elections 2012", "US news", "US politics", "Barack Obama", "Democrats", "Mitt Romney", "Karl Rove", "Republicans", "World news", "Fox News", "US television industry", "Fox", "Media"], "webUrl": "https://www.theguardian.com/world/2012/nov/07/us-presidential-election-commentary", "publicationDate": "2012-11-07T20:53:55Z", "title": "Barack Obama's election victory is signed, sealed and delivered"}, {"sentences": ["And then there was this:    Joe the Plumber got 23.5% in his losing bid against Rep Marcy Kaptur D-Ohio&mdash; Jamie Dupree (@jamiedupree) November 7, 2012     Updated at 10.16pm GMT     9.22pm GMT       Uh oh, Donald Trump is off on another Twitter rampage.... although this one is a sign of the Republican civil war to come perhaps?", "What a waste of money.&mdash; Donald J. Trump (@realDonaldTrump) November 7, 2012        9.15pm GMT    Democrat wins Montana governor's race    Another bright spot for the Democratic party: Steve Bullock has been declared the winner of the Montana governor&apos;s race by 49% to 47%, following popular Democratic governor Brian Schweitzer&apos;s retirement."], "tags": ["US news", "World news", "US politics"], "webUrl": "https://www.theguardian.com/world/2012/nov/07/romney-loss-obama-reelection-live", "publicationDate": "2012-11-08T00:36:00Z", "title": "Republicans contemplate Romney loss as Florida tallies votes – US politics live"}, {"sentences": ["Especially delicious was Donald Trump, calling for a march on the White House and a revolution in the US, and conservative rocker Ted Nugent, who called voters &quot;soulless fools&quot; and &quot;pimps whores &amp; welfare brats&quot;."], "tags": ["Celebrity", "Beyoncé", "US elections 2012", "US news", "US politics", "World news", "Music", "Life and style"], "webUrl": "https://www.theguardian.com/lifeandstyle/lostinshowbiz/2012/nov/08/beyonce-democrats-celebrate-obamas-victory", "publicationDate": "2012-11-08T19:10:00Z", "title": "Beyoncé leads the Democrat celebrities as they celebrate Obama's victory"}, {"sentences": ["Updated at 5.40am GMT     5.32am GMT       Donald Trump appears to have launched a one-man Twitter frenzy of rage:    This election is a total sham and a travesty.", "We are not a democracy!&mdash; Donald J. Trump (@realDonaldTrump) November 7, 2012        5.29am GMT       Well, well, well: Michele Bachmann&apos;s lead in the sixth Minnesota congressional district has shrunk to just 206 votes, with 61% of precincts reporting."], "tags": ["Wisconsin", "US politics", "US news", "World news"], "webUrl": "https://www.theguardian.com/world/2012/nov/06/us-election-2012-results-live-blog", "publicationDate": "2012-11-09T02:04:00Z", "title": "US election 2012: Obama wins second term – as it happened"}, {"sentences": ["Why is it that even though there are no rules on Twitter, it still feels as though Donald J Trump is breaking them?", "His boorish ranting started almost immediately after Barack Obama was re-elected on Tuesday night and, a few tweets aside, Trump hasn&apos;t really stopped since.", "— Donald J. Trump (@realDonaldTrump) November 8, 2012   While television at one time was a unifying force that created America&apos;s collective living room, it now cedes the bulk of that job more and more to Twitter.", "— Donald J. Trump (@realDonaldTrump) November 7, 2012  All of which makes Trump&apos;s barkings even tougher to tolerate than if he really were just ranting at us intermittently from his own TV show.", "— Donald J. Trump (@realDonaldTrump) November 7, 2012  Over at Buzzfeed, McKay Coppins chronicled the Trump intrusion on Mitt Romney&apos;s campaign.", "Trump comes across much the same there as he has since Tuesday night on Twitter – a loudmouth big shot who thinks his money makes him the boss of everything.", "— Donald J. Trump (@realDonaldTrump) November 7, 2012  But maybe we should take it easy on the Donald.", "— Donald J. Trump (@realDonaldTrump) November 7, 2012  The problem is that when there&apos;s nothing left to success but the image of it, as Christopher Lasch once diagnosed, &quot;men have nothing against which to measure their achievements except the achievements of others.&quot; Now, Lasch said, &quot;men seek the kind of approval that applauds not their actions but their attributes.", "They want to be envied rather than respected.&quot; So maybe Trump does deserve our scorn or laughs."], "tags": ["Donald Trump", "US elections 2012", "Twitter", "Social media", "Media"], "webUrl": "https://www.theguardian.com/commentisfree/2012/nov/09/donald-trump-twitter-rant", "publicationDate": "2012-11-09T12:47:00Z", "title": "Donald Trump: Twitter's greatest villain rails against the US election | Colin Horgan"}, {"sentences": ["In this election, the America of Steve Jobs defeated that of Donald Trump."], "tags": ["Photography", "Art and design", "Barack Obama", "Donald Trump", "Steve Jobs", "Michelle Obama", "Rupert Murdoch", "Media"], "webUrl": "https://www.theguardian.com/artanddesign/jonathanjonesblog/2012/nov/09/obamas-love-most-retweeted-history", "publicationDate": "2012-11-09T15:52:17Z", "title": "Obamas in love: the most retweeted moment in history"}, {"sentences": ["Anger against the voters, whether expressed by the corporate egotist Donald Trump or the rightwing commentator Bill O&apos;Reilly, is widespread."], "tags": ["US elections 2012", "US news", "US politics", "World news", "Republicans", "Conservatives", "Politics"], "webUrl": "https://www.theguardian.com/commentisfree/2012/nov/09/us-elections-learning-lessons-editorial", "publicationDate": "2012-11-09T20:59:39Z", "title": "US election: learning the right lessons | Editorial"}, {"sentences": ["From business mogul Donald Trump to top elected officials, Republicans have carefully crafted a message of Obama as a radical &quot;other&quot; hoping to transform America in some dangerous way."], "tags": ["US elections 2012", "Republicans", "Tea Party movement", "Fox News", "Glenn Beck", "Rush Limbaugh", "Mitt Romney", "Barack Obama", "Karl Rove", "Marco Rubio", "Democrats"], "webUrl": "https://www.theguardian.com/world/2012/nov/10/us-elections-republicans-tea-party-conservatives", "publicationDate": "2012-11-10T12:39:56Z", "title": "Republican right weeps over Obama's victory – then begins internal civil war"}, {"sentences": ["The Donald problem     Governor Mitt Romney and Donald Trump shake hands during a news conference held by Trump to endorse Romney in his failed presidential bid.", "Photograph: Ethan Miller/Getty Images    The Romney campaign decided a Donald Trump endorsement was worth chasing, because it would translate to support from the base.", "BuzzFeed&apos;s McKay Coppins reported on the bozo ego babysitting that ensued:   By the time the deal was finally sealed, several of the campaign staffers in Boston had grown so sick of Trump&apos;s demands that they refused to deal with him anymore.", "Trump&apos;s entourage called campaign headquarters constantly, eagerly passing along strategy ideas from their boss, and the calls were always patched through to Saul&apos;s office.", "Her desk became littered with Trump aides&apos; business cards, and post-it notes reminding her to call them back."], "tags": ["Democrats", "Mitt Romney", "US elections 2012", "Barack Obama", "US news", "Republicans", "US politics"], "webUrl": "https://www.theguardian.com/world/us-news-blog/2012/nov/10/us-elections-2012-obama-romney", "publicationDate": "2012-11-10T17:06:00Z", "title": "US election 2012: the inside track on Obama's victory and Romney's defeat | Tom McCarthy"}, {"sentences": ["Harry Hurt III took on another big-name target when he wrote a biography of Donald Trump, &quot;Lost Tycoon: Many Lives of Donald J Trump&quot; at a low point in Trump&apos;s professional career.", "The book was unauthorized, but Trump &quot;didn&apos;t stand in my way, he&apos;s the greatest self-promoter of all time&quot;, says Hurt.", "I recognized in Trump certain traits that I recognize in myself – and in all of us.&quot; Hurt believes that the ideal relationship in biography is when you could have access to your subject but not be beholden."], "tags": ["David Petraeus", "Biography", "Books", "US news", "World news"], "webUrl": "https://www.theguardian.com/world/2012/nov/10/affairs-biographies-seduction-betrayal", "publicationDate": "2012-11-10T17:12:00Z", "title": "Like affairs, biographies hold seduction and betrayal between the pages"}, {"sentences": ["Do Donald Trump&apos;s post-election tweets not sound precisely like a holy fool&apos;s ramblings?", "We should have a revolution in this country!&quot; Although Trump is in no way a radical leftist, it is easy to discern in his tweets the doubt about &quot;bourgeois formal democracy&quot; usually attributed to the radical left: superficial freedoms mask the power of elites that enforce their will through media control and manipulations."], "tags": ["Barack Obama", "Philosophy", "US healthcare", "US news", "US politics", "Politics", "Donald Trump", "Margaret Thatcher", "Obama administration", "Norway", "Europe", "UK news", "World news"], "webUrl": "https://www.theguardian.com/commentisfree/2012/nov/13/obama-ground-floor-thinking", "publicationDate": "2012-11-13T20:59:00Z", "title": "Why Obama is more than Bush with a human face | Slavoj Žižek"}, {"sentences": ["Donald Trump, stellar self-promoter and proud owner of improbable hair, is getting a little taste of his recent brand of medicine as the subject of a new petition.", "The petition reads: &quot;Donald Trump does not reflect the &apos;magic of Macy&apos;s&apos;.&quot; It goes on to ask the chain to &quot;act and dump Trump&quot;.", "Trump has been a face of Macy&apos;s for a number of years now, and the store carries his homeware range – his Mar-a-Largo crystal bowl costs $600 (£378), if you&apos;re interested – as well as a menswear range.", "Indeed, Trump&apos;s spokesman told the NY Daily News that his ties are the &quot;No 1 selling ties at Macy&apos;s&quot;.", "It&apos;s clearly a useful relationship for both parties: Trump appears alongside other celebrities in the shop&apos;s new Christmas ad, tugging on Santa&apos;s beard (&quot;What&apos;s with the get-up, Kris?&quot; he asks.", "So are Trump&apos;s wares good business for the department store?", "Fashion psychologist Kate Nightingale speculates that Macy&apos;s has checked what effect dropping Trump&apos;s merchandise would have on their sales.", "&quot;From what I&apos;ve read in BusinessWeek they discounted Trumps line considerably,&quot; she says.", "&quot;That might have been their answer as quite possibly the contract doesn&apos;t allow them to drop the line completely or they would suffer too big a financial loss.&quot; Crucially, she points out, Trump&apos;s comments may not be that big a deal to some.", "&quot;We have to remember that some of Macy&apos;s target market will actually agree with Trump&apos;s comments,&quot; she says.", "As Santa says to Trump in the ad: &quot;If I can win you over, there&apos;s still hope.&quot;"], "tags": ["Donald Trump", "Fashion", "World news", "US news", "Life and style", "Barack Obama", "Business", "Retail industry"], "webUrl": "https://www.theguardian.com/world/shortcuts/2012/nov/14/will-macys-drop-donald-trump", "publicationDate": "2012-11-14T16:05:00Z", "title": "Will Macy's drop Donald Trump for his 'despicable' behaviour?"}, {"sentences": ["Donald Trump, George Osborne, and Rebekah Brooks are other obvious candidates."], "tags": ["Gangnam Style", "Dance music", "Music", "Pop and rock", "Dance", "Culture"], "webUrl": "https://www.theguardian.com/music/shortcuts/2012/nov/14/can-anyone-kill-gangnam-style", "publicationDate": "2012-11-14T20:30:00Z", "title": "Can anyone kill Gangnam Style?"}, {"sentences": ["His verdict of Donald Trump&apos;s latest Twitter rant against him?"], "tags": ["US news", "Barack Obama", "Olympic Games 2012", "Sport", "Olympics 2012: gymnastics", "Gymnastics", "Olympic Games"], "webUrl": "https://www.theguardian.com/world/us-news-blog/2012/nov/17/barack-obama-mckayla-maroney-not-impression", "publicationDate": "2012-11-17T16:55:00Z", "title": "Barack Obama and McKayla Maroney: not impressed"}, {"sentences": ["About the only conservative structure to survive intact was Donald Trump&apos;s hair – and to be fair, entertainers such as Trump have no interest, yet, in changing their weirdly comforting (to some) message about voter fraud and the &quot;food stamp president&quot;."], "tags": ["Republicans", "US politics", "US news", "US elections 2012", "World news", "Mitt Romney", "Fox News", "Media", "Barack Obama"], "webUrl": "https://www.theguardian.com/commentisfree/2012/nov/20/republicans-choice-fantasy-follies", "publicationDate": "2012-11-20T18:11:28Z", "title": "Republicans' choice: fantasy follies or reality-based relevance | Ana Marie Cox"}, {"sentences": ["Its inquiry, which featured a combative evidence session about the US billionaire Donald Trump&apos;s damage caused by wind power from the US billionaire Donald Trump this year, urged the Scottish government, banks and UK energy regulators to quickly speed up reform and spending.", "Despite giving Trump a headline-grabbing platform earlier this year to denounce windpower – he claimed these &quot;horrible, horrible structures&quot; would mean &quot;financial suicide&quot; for the tourism industry – the committee said there was no robust, empirical evidence to back up his claims it was damaging tourism.", "At one point in his evidence, where he attempted to bolster his attacks on an offshore windfarm near his stalled £750m golfing resort, Trump claimed he was the proof that this was true."], "tags": ["Renewable energy", "Energy", "Environment", "Scotland", "UK news"], "webUrl": "https://www.theguardian.com/environment/2012/nov/23/scotland-green-energy-target", "publicationDate": "2012-11-23T15:49:22Z", "title": "Obstacles threaten Scotland's 100% green electricity target, MSPs warn"}, {"sentences": ["While it may have a sic sense of humour, @YourinAmerica is the best thing on Twitter since the please-don&apos;t-engage-Donald-Trump-bot, particularly as the mentality it positions itself against is far from being isolated online."], "tags": ["Language", "Twitter", "Media", "Internet", "Blogging", "Technology", "US news", "World news"], "webUrl": "https://www.theguardian.com/commentisfree/2012/nov/28/your-in-america-grammar-fascists", "publicationDate": "2012-11-28T12:44:28Z", "title": "'Your in America' sets grammar fascists against fascists  | Arwa Mahdawi"}, {"sentences": ["Chump and Trump?"], "tags": ["Media", "Culture", "Jonathan Franzen", "Nora Ephron", "Alec Baldwin", "Film", "Elizabeth Taylor", "New York Times", "Huffington Post"], "webUrl": "https://www.theguardian.com/commentisfree/emma-brockes-blog/2012/nov/28/franzen-fieri-five-rules-review-takedown", "publicationDate": "2012-11-28T17:36:00Z", "title": "From Franzen to Fieri, the five rules of the review as takedown | Emma Brockes"}, {"sentences": ["Property magnate Donald Trump has gone to war with one of the world&apos;s largest whisky companies after it sponsored an award given to an arch critic of his controversial Scottish golf course.", "In what is emerging as the battle of the billionaires, Trump said he has banned every brand of whisky sold by William Grant &amp; Sons from his resorts and hotels after Michael Forbes, his obstinate neighbour in Aberdeenshire, was voted Top Scot in a ceremony sponsored by the distiller&apos;s leading brand, Glenfiddich.", "The closest resident to Trump&apos;s golf course, Forbes won the award last week after a public vote, beating the Olympic tennis gold medallist and US Open winner Andy Murray.", "Trump said that decision was &quot;an insult to both Andy Murray and Scotland itself&quot;.", "Trump claimed that William Grant &amp; Sons, which broke through the £1bn sales barrier this year and owns several of the world&apos;s most popular whiskies, including Grant&apos;s, was jealous of his own inhouse single malt whisky brand.", "The distillery sold more than one million cases of Glenfiddich, but Trump continued: &quot;Glenfiddich should be ashamed of themselves for granting this award to Forbes, just for the sake of publicity.", "People at our clubs do not ask for Glenfiddich, and I make a pledge that no Trump property will ever do business with Glenfiddich or William Grant &amp; Sons.", "&quot;I hereby call for a boycott on drinking Glenfiddich products because there is no way a result such as this could have been made by the Scottish people.&quot; After suggesting that the voting for Forbes had been fixed by &quot;a small group of detractors&quot; casting multiple votes, he continued: &quot;Glenfiddich&apos;s choice of Michael Forbes, as Top Scot, will go down as one of the great jokes ever played on the Scottish people and is a terrible embarrassment to Scotland.&quot; William Grant &amp; Sons gave short shrift to Trump&apos;s criticisms, which he first aired on Twitter on Tuesday, insisting it had nothing to do with the voting for the award, which Glenfiddich has sponsored for 15 years."], "tags": ["Donald Trump", "World news", "Food & drink industry", "Business", "Scotland", "UK news"], "webUrl": "https://www.theguardian.com/world/2012/dec/05/donald-trump-whisky-award", "publicationDate": "2012-12-05T14:00:18Z", "title": "Donald Trump's Scottish love affair on the rocks after whisky award slight"}, {"sentences": ["The 52-year-old former teacher is portrayed in China as a sort of home-grown Donald Trump – ultra-ambitious and preternaturally gifted at navigating the country&apos;s vast network of &quot;guanxi&quot;, or personal connections."], "tags": ["China", "Asia Pacific", "World news", "Construction industry", "Business"], "webUrl": "https://www.theguardian.com/world/2012/dec/06/china-flatten-mountain-lanzhou-new-area", "publicationDate": "2012-12-06T17:48:51Z", "title": "China to flatten 700 mountains for new metropolis in the desert"}, {"sentences": ["In the red corner, representing New York, the silliest faction of American Republicans and haircuts that look like monkey bottoms: Donald Trump.", "The pair seem to have been circling each other for months now, both in terms of letting the world know they don&apos;t watch the other&apos;s version of The Apprentice and starting witless online squabbles with anyone they can think of, but yesterday Trump and Sugar finally charged at each other headfirst, and it was spectacular to witness.", "How can George Osborne reduce UK debt while spending billions to subsidize Scotland’s garbage wind turbines that are destroying the country?&mdash; Donald J. Trump (@realDonaldTrump) December 6, 2012    First, Trump used Twitter to criticise the UK government&apos;s fondness for wind turbines – possibly because they might spoil the views from his country-crushing megacorp of a golf course – to which Sugar replied &quot;The Scottish don&apos;t want you!&quot; Sadly for posterity, Sugar has since deleted his contributions to the row from his Twitter feed.", "@lord_sugarIf you think ugly windmills are good for Scotland you are an even worse businessman than I thought...&mdash; Donald J. Trump (@realDonaldTrump) December 6, 2012    It escalated from there.", "Trump shot back with: &quot;If you think ugly windmills are good for Scotland you are an even worse businessman than I thought and, in my opinion, should not be doing The Apprentice.&quot; Never a man to take the directionless frothing of an egotist lying down, Sugar quickly hammered out an oblivious missive of his own: &quot;well you have NO SAY in that.", "You were never successful enough...&mdash; Donald J. Trump (@realDonaldTrump) December 6, 2012    On and on it went.", "Trump: &quot;Sugar – unlike you, I own The Apprentice.", "Shut up and argue with Obama.&quot; Trump: &quot;Keep working hard so I make plenty of $ with your show.", "Drop to your knees, Sugar, and say thank you, Mr. Trump.&mdash; Donald J. Trump (@realDonaldTrump) December 6, 2012    Trump replied: &quot;Drop to your knees, Sugar, and say thank you, Mr. Trump.&quot;    Don't wish to interfere obviously @realdonaldtrump - but it may be time to fire @lord_sugar from YOUR show for his impertinence?&mdash; Piers Morgan (@piersmorgan) December 6, 2012    At this point, bang on cue, Piers Morgan – a man who has flown planes with Alan Sugar, won Trump&apos;s Celebrity Apprentice and will never knowingly let anything high-profile pass without wedging his gelatinous face right in the middle of it – barged in to suggest that Trump should fire Sugar.", "And this is where Alan Sugar lost it, ranting: &quot;You are full of sh.. Trump you have no power over the UK Apprentice, just like the Scottish people.&quot; Whether he meant that a) Donald Trump has no power over Scottish people, b) Donald Trump has no power over the UK Apprentice or c) that Scottish people have no power over the UK Apprentice, will for ever be lost to the ages.", "She couldn&apos;t have possibly sided with Trump.", "Trump, it seems, rules with a mixture of grandiose claims and a kind of General Zod-style imperiousness."], "tags": ["The Apprentice", "Alan Sugar", "Donald Trump", "Wind power", "Scotland", "Television", "Culture"], "webUrl": "https://www.theguardian.com/tv-and-radio/tvandradioblog/2012/dec/07/donald-trump-alan-sugar-twitter-fight", "publicationDate": "2012-12-07T13:25:36Z", "title": "Donald Trump and Alan Sugar's Twitter fight – blow-by-blow"}, {"sentences": ["That second term was also won in an election many saw as a rejection of a Tea Party-infused Republicanism that saw extreme figures like pizza magnate Herman Cain, social conservatives Rick Santorum and Michele Bachmann and even business mogul Donald Trump briefly leading the Republican field."], "tags": ["Fox News", "Karl Rove", "Rupert Murdoch", "US television", "US television industry", "Republicans", "US politics"], "webUrl": "https://www.theguardian.com/media/2012/dec/07/fox-news-new-reality-republican", "publicationDate": "2012-12-07T16:02:24Z", "title": "Fox News adjusts to new reality as it faces four more years of Obama"}, {"sentences": ["Donald Trump I&apos;m just going to come out and say it: what the hell is Donald Trump on?", "No one can be this much of a douche for this long without some kind of narcotic assistance so I&apos;m thinking that whatever substance Trump puts in his hair has polluted his brain.", "Trump has never really been anything but a blowhard topped with a Weetabix, but he has outdone himself this year, with his bleating about Birtherism and Obama&apos;s college records (even offering, Dr Evil style, $5m to see the latter); his shameless bullying of an independent film-maker; and his feuding with Lord Sugar on Twitter that tips into homoeroticism (&quot;Lord Sugar, you should say thank you, Donald, like a good little boy … &quot;).", "I&apos;ve just lost my lunch and Trump has earned a lead dreidel."], "tags": ["World news", "Hillary Clinton", "Donald Trump", "Newspapers", "Newspapers & magazines", "Media", "Starbucks", "Cory Booker"], "webUrl": "https://www.theguardian.com/commentisfree/2012/dec/11/hanukah-honours-list-2012", "publicationDate": "2012-12-11T21:16:00Z", "title": "My Hanukah honours list for 2012 | Hadley Freeman"}, {"sentences": ["Or he might get into a fight with Donald Trump."], "tags": ["Pope Benedict XVI", "Religion", "Catholicism", "Christianity", "World news", "Twitter", "Media", "Internet", "Technology", "Social media", "Digital media", "The papacy"], "webUrl": "https://www.theguardian.com/world/shortcuts/2012/dec/12/popes-first-tweet-worth-wait", "publicationDate": "2012-12-12T13:26:41Z", "title": "Was the pope's first tweet worth the wait?"}, {"sentences": ["Self-aggrandizing rightwing celebrities like Donald Trump and radio jockey Rush Limbaugh fuel white southern resentment with lies about a biracial president&apos;s illegitimacy."], "tags": ["US gun control", "Gun crime", "Newtown shooting", "Connecticut", "US news", "World news", "Barack Obama", "Race issues", "US politics", "NRA", "Virginia Tech shooting 2007", "US constitution and civil liberties"], "webUrl": "https://www.theguardian.com/commentisfree/2012/dec/16/newtown-americans-resist-obama-gun-laws", "publicationDate": "2012-12-16T12:40:00Z", "title": "Even after Newtown, Americans will resist Obama's call to tighten gun laws | Lucinda Roy"}, {"sentences": ["Donald Trump arrives at the 2012 Miss Universe pageant at Planet Hollywood in Las Vegas, Nevada."], "tags": ["World news", "Photography", "UK news"], "webUrl": "https://www.theguardian.com/news/2012/dec/20/picture-desk-live-the-best-news-pictures-of-the-day", "publicationDate": "2012-12-20T20:49:00Z", "title": "Picture desk live: the best news pictures of the day"}, {"sentences": ["We had constant run-ins on the soccer field, he wasn&apos;t very good and resented it.&quot;Obama on Donald Trump, after Trump revisited claims that Obama had been born in east Africa &quot;At the end of the day, all he did was jump off a platform – admittedly very high.&quot;John Humphrys isn&apos;t impressed by Felix Baumgartner&apos;s 24-mile skydive &quot;I don&apos;t look at my pension."], "tags": ["Celebrity", "Life and style", "Barack Obama", "Joe Biden", "World news", "Madonna", "David Cameron", "Boris Johnson", "Karl Lagerfeld", "Donald Trump"], "webUrl": "https://www.theguardian.com/lifeandstyle/2012/dec/27/slapdowns-2012-madonna-obama-karl-lagerfeld", "publicationDate": "2012-12-27T07:00:00Z", "title": "Best slapdowns of 2012"}, {"sentences": ["&quot;Some time after the cock crows on the morning of 7 November, Mitt Romney will be declared America&apos;s 45th president,&quot; Karl Rove predicted a few days before he wasn&apos;t. Implacable faith in a Romney win, even a landslide, was commonplace among US conservatives this year, among them Newt Gingrich, Glenn Beck and Donald Trump."], "tags": ["Jimmy Savile", "Television", "Mitt Romney", "World news", "Media", "Barack Obama", "Culture"], "webUrl": "https://www.theguardian.com/world/2012/dec/28/worst-ideas-2012-ignoring-reality", "publicationDate": "2012-12-28T23:00:00Z", "title": "Worst ideas of 2012: ignoring reality"}, {"sentences": ["&apos;Hey, you tried big guy&apos; award Donald Trump."], "tags": ["Culture", "Mo Farah", "Tom Daley", "Mitt Romney", "Lauren Laverne", "Mayan apocalypse"], "webUrl": "https://www.theguardian.com/culture/2012/dec/29/positive-troll-year-in-positivity", "publicationDate": "2012-12-29T00:07:28Z", "title": "2012: Positive Troll's year in positivity"}, {"sentences": ["Inevitably, parallels have been drawn with the controversy that surrounded Donald Trump&apos;s £750m golf resort in Aberdeenshire, with Hanna playing the part of the unloved US billionaire.", "But the comparisons with Trump can be overblown."], "tags": ["Northern Ireland", "Conservation", "The National Trust", "Environment", "UK news", "Unesco", "Golf", "Sport"], "webUrl": "https://www.theguardian.com/uk/2012/dec/29/national-trust-giants-causeway-golf-course", "publicationDate": "2012-12-29T23:25:17Z", "title": "National Trust attempts to block £100m Giant's Causeway golf course"}, {"sentences": ["Deliberately saying nothing, while pretending only to be accidentally saying nothing, is a subtly hard trick to pull off, and he didn&apos;t. Meanwhile, as Donald Trump became the most loathed visitor to Scotland since Edward Longshanks, Salmond&apos;s earlier over-accommodating smiles began to look, retrospectively, deeply ill-advised."], "tags": ["UK news", "Culture", "Politics", "World news"], "webUrl": "https://www.theguardian.com/uk/2012/dec/29/2012-review-best-worst", "publicationDate": "2012-12-29T23:46:00Z", "title": "2012 review: it was the best of times. It was the worst of times …"}, {"sentences": ["David Cameron left his daughter Nancy there by mistake after a &quot;lunch &quot;67 Raisa, now dead, was the horse lent to Rebekah Brooks by the Met, which she in turn lent to Mr Cameron68 Tony Nicklinson69 £16070 Won the Grand National; the Galapagos tortoise who died aged (it&apos;s thought) 100; President of Nigeria71 Unexpected attacks by forces trained by and thought to be loyal to said &quot;blue&quot; side; as in Afghan soldiers, co-opted by the British Army against the Taliban, who then turn round and kill them72 Donald Trump&apos;s Scottish golf course73 Russell Brand74 Michael Frayn75 198876 Rory McIlroy77 QPR78 Kevin Pietersen, after texting his South African rivals79 Luxembourg80 The Hillary Shield81 David Beckham82 John Terry83 Bunny Austin84 David Millar "], "tags": ["New year"], "webUrl": "https://www.theguardian.com/lifeandstyle/2012/dec/30/quiz-of-the-year", "publicationDate": "2012-12-30T00:05:43Z", "title": "Quiz of the year"}], "sentences": 600}