{"docs": 63, "results": [{"title": "UK comedy in crisis and Ant and Dec to go silent", "publicationDate": "2013-01-15T17:55:17Z", "sentences": ["There&apos;s nothing wrong with free speech, but sometimes it goes too far.&quot; And finally, squillionnaire Donald Trump is threatening to sue comedian Bill Maher for $5m (£3.1m), having made public his birth certificate and thus proved that his father isn&apos;t an orangutan."], "webUrl": "https://www.theguardian.com/stage/2013/jan/15/uk-comedy-crisis-ant-dec-silent"}, {"title": "Groupon to stop gun deals after deciding they are 'not a fit right now'", "publicationDate": "2013-01-22T20:11:52Z", "sentences": ["Slate noted that Groupon said in an April 2011 blogpost that it actively chose not to offer deals on guns while responding to controversy about advertisements on the website for Donald Trump&apos;s show The Apprentice."], "webUrl": "https://www.theguardian.com/world/us-news-blog/2013/jan/22/groupon-online-discount-gun-deals"}, {"title": "Trump to buy New York Times? Never", "publicationDate": "2013-01-23T09:50:07Z", "sentences": ["Donald Trump is evidently eager to buy the New York Times, according to a report in New York magazine.", "Writer Joe Hagan cites &quot;sources familiar with the situation&quot; who claim Trump &quot;has engaged in more than one meeting to discuss how he might buy the Grey Lady.&quot; He rightly notes that there is scant chance of the owners, the Sulzberger family, selling to Trump.", "As Business Insider&apos;s Jay Yarow remarks, Trump&apos;s timing is poor."], "webUrl": "https://www.theguardian.com/media/greenslade/2013/jan/23/new-york-times-donaldtrump"}, {"title": "Nigella Lawson brings her signature style to saucy new food show The Taste | Emma G Keller", "publicationDate": "2013-01-23T15:18:00Z", "sentences": ["In addition to Nigella, we have Brian Malarkey, a restaurateur and finalist on Top Chef Miami; the classically handsome, classically trained French chef Ludo Lefebvre (biography nugget: his wife has competed on Donald Trump&apos;s The Apprentice); and the most important judge of all, Anthony Bourdain, the scowly, sarcastic star of No Reservations."], "webUrl": "https://www.theguardian.com/tv-and-radio/tvandradioblog/2013/jan/23/nigella-lawson-abc-the-taste"}, {"title": "Beyoncé and Lupe Fiasco: your inauguration-scandal roundup", "publicationDate": "2013-01-24T17:07:52Z", "sentences": ["But that&apos;s just what LiS would do were it in that position, which of course it isn&apos;t. As things stand, it simply looks forward to the next Obama-linked StartUp RockOn event, featuring Ted Nugent, Kid Rock, Meat Loaf, former Velvet Underground drummer Maureen Tucker, and your comperes for the evening Glenn Beck and Donald Trump."], "webUrl": "https://www.theguardian.com/lifeandstyle/lostinshowbiz/2013/jan/24/beyonce-lupe-fiasco-inauguration-scandal-roundup"}, {"title": "Beyoncé's Super Bowl: after scandal, singer has everything to play for", "publicationDate": "2013-01-25T14:49:00Z", "sentences": ["In a recent GQ interview to promote her forthcoming &quot;self-directed&quot; documentary, she led the writer into &quot;a narrow room that contains the official Beyoncé archive, a temperature-controlled digital-storage facility that contains virtually every existing photograph of her, starting with the very first frames taken of Destiny&apos;s Child … every interview she&apos;s ever done; every video of every show she&apos;s ever performed; every diary entry she&apos;s ever recorded while looking into the unblinking eye of her laptop.&quot; Beyoncé has every right to be impressed with herself, but paradoxically, the minute she lets the self-worship show, she undermines her value as the inspirer of worship; aloofness is a requirement of being at the top, and the archive has about it a whiff of vanity associated with more desperate types, those trying to persuade themselves of something, ie Donald Trump."], "webUrl": "https://www.theguardian.com/music/emma-brockes-blog/2013/jan/25/beyonce-superbowl-half-time-show"}, {"title": "Catch-up TV guide: from Celebrity Apprentice USA to Comic Turns", "publicationDate": "2013-01-26T06:00:05Z", "sentences": ["BBC iPlayer TV: The Celebrity Apprentice USA The BBC is currently hiding Donald Trump&apos;s Celebrity Apprentice USA in a Monday night graveyard slot, so it&apos;s worth catching up on iPlayer just to see how much more away with the fairies American celebrities are, even the ones you&apos;ve never heard of."], "webUrl": "https://www.theguardian.com/tv-and-radio/2013/jan/26/catch-up-tv-guide"}, {"title": "Conrad Black to host TV talk show", "publicationDate": "2013-01-29T10:32:00Z", "sentences": ["We should make it moderately interesting.&quot;  He also said former US secretary of state Henry Kissinger would &quot;be happy to be our foreign-policy commentator.&quot; In a pilot episode, which Znaimer is showing to international programmers in order to sell the show elsewhere, Black interviewed Donald Trump via Skype."], "webUrl": "https://www.theguardian.com/media/greenslade/2013/jan/29/conradblack-canada"}, {"title": "China's self-billed No 1 environmentalist gives away fresh air", "publicationDate": "2013-01-31T18:17:55Z", "sentences": ["He has the apparently unsinkable self-belief of Donald Trump, the publicity flair of Richard Branson and teeth as strong as the Bond villain Jaws: his party trick, demonstrated this morning, is to lift a bike using his teeth and spin it around in the air."], "webUrl": "https://www.theguardian.com/world/2013/jan/31/china-smog-environmentalist-fresh-air-stunt"}, {"title": "Chuck Norris tries to give Binyamin Netanyahu an electoral boost", "publicationDate": "2013-01-31T18:48:00Z", "sentences": ["Well, LiS suspects the reason lies with his other US celebrity supporter, who made a similar supportive broadcast: come on down, Donald Trump."], "webUrl": "https://www.theguardian.com/film/lostinshowbiz/2013/jan/31/chuck-norris-binyamin-netanyahu-boost"}, {"title": "Comedians get chance to fall flat on TV, and Eddie Izzard sets sights on politics", "publicationDate": "2013-02-05T16:36:20Z", "sentences": ["People will grumble and say, &apos;Oh, you were interesting but now you are boring&apos;, but I will try and do it with a good heart.&quot; From one election candidate to another, and – as anticipated by Laughing Stock three weeks ago – Donald Trump is now suing a US comedian for $5m (£3m), after Bill Maher failed to pay up when Trump proved – as Maher had challenged him to do – that his father was not an orangutan."], "webUrl": "https://www.theguardian.com/stage/2013/feb/05/comedians-fall-flat-tv-eddie-izzard-politics"}, {"title": "Donald Trump's orangutan bet joke lawsuit against Bill Maher is … a joke | Bob Garfield", "publicationDate": "2013-02-14T16:32:06Z", "sentences": ["Somehow – and it is inexplicable how this had come to pass – a majority of Americans had failed for more than 14 hours to pay attention to Donald Trump.", "Thankfully, Trump rectified the situation by filing suit against comedian Bill Maher for breach of contract, or some such.", "Remember when Trump was offering $5m to charity if someone would release Barack Obama&apos;s college records, during which time Trump was also trading in lunacy about the president&apos;s birthplace?", "Well, Maher had out-birthered him by offering $5m to charity if Trump could prove his father was not an orangutan.", "Trump nonetheless took Maher&apos;s one-liner not only as an insult (although the joke was premised on him being merely half-orangutan), but also as a literal challenge.", "In the meantime, however, everybody had long since forgotten about Maher&apos;s Trump-baiting episode altogether.", "So, of course, Donald Trump had no choice but to sue.", "Donald Trump is accustomed to ridicule, for that is the price of being ridiculous.", "Trump filed the tort, alerted the media and produced the certificate of his birth.", "Though the document, if genuine, was silent on &quot;Fred&quot;&apos;s species, Trump believes he has fulfilled Maher&apos;s dare and wants to see the $5m check to charity.", "But, of course, Trump does not for a moment believe he will prevail in court.", "Trump doesn&apos;t even have reason to believe he will prevail in the court of public opinion."], "webUrl": "https://www.theguardian.com/commentisfree/2013/feb/14/donald-trump-orangutan-joke-lawsuit-bill-maher"}, {"title": "Connecticut's wealthy Gold Coast: where life is good, if you can afford it", "publicationDate": "2013-02-15T16:38:00Z", "sentences": ["Real estate mogul Donald Trump has got in on the action, too, constructing a Trump Parc residential tower that juts out of the skyline.", "&quot;It looks like Trump is giving the finger."], "webUrl": "https://www.theguardian.com/world/2013/feb/15/connecticut-gold-coast-life-afford"}, {"title": "Triumphant Trump wants second golf links on Scotland's wild coastline", "publicationDate": "2013-02-16T23:52:34Z", "sentences": ["A few more years must yet elapse before we can properly test Donald Trump&apos;s claim that he has built the finest golf course in the world, though he has certainly built the most inclusive.", "The Trump International Golf Links, just north of Aberdeen, on the anointed and golden Menie coastline, treats both sexes equally.", "At each of Trump International&apos;s holes there are six tee boxes ranging from &quot;professional&quot; to &quot;barely ambulant&quot;.", "Trump, the billionaire American property developer is, very possibly, the only man God has created who does not possess the embarrassment gene.", "When it was revealed last week that he was seeking planning permission for a second golf course, to the south of the current one, it seemed, on the face of it, that his dream of creating a sprawling millionaires&apos; &quot;Trumpland&quot; resort would be fulfilled.", "Trump triumphant in fact.", "In the three months or so following the course&apos;s grand opening last July, Trump&apos;s people said that more than 10,000 visitors flocked to it.", "Credit: Observer graphics    Martin Hawtree, the golf architect who designed the first course has been commissioned to craft the second, the Mary Macleod Links, named after Trump&apos;s mother, a native of Scotland&apos;s north-east.", "He says: &quot;Now the wind farm project is as good as dead, I can reaffirm my commitment to the north-east of Scotland and deliver the world&apos;s best golfing destination.&quot; Stephen Park Brown, a Lanarkshire businessman and single-handicap golfer, is typical of Trump&apos;s target market: affluent, successful and ambitious.", "There are others who disagree and who want nothing other than for Trump to dismantle his course and disappear back to America.", "He is one of the leaders of the Trump refuseniks.", "What has unfolded since Trump announced plans for his resort has resembled a circus to which we have all been granted a ringside seat.", "Trump&apos;s people made several attempts to purchase these and this is where what was an intriguing story pitting big business against the environment became almost farcical.", "Trump&apos;s people claim that they offered each householder &quot;very financially attractive options&quot;.", "Trump, though, was about to meet a force he had never encountered: the cussed and implacably thrawn northern Scot.", "We also offered lifetime membership and the option to purchase another property within the development at cost price.&quot; Milne flatly denies this: &quot;I can&apos;t speak for the others but I was only offered half the market value of my property, and why would I want to be relocated to an unspecified property within an as-yet-unbuilt housing estate?&quot; Trump would later describe one of Milne&apos;s neighbours, a farmer called Michael Forbes, as &quot;living like a pig.", "The Trump people claim that the film was laughably one-sided and distorted.", "To my untutored eye, Trump&apos;s course has done little to violate the integrity of the natural topography."], "webUrl": "https://www.theguardian.com/uk/2013/feb/16/trump-golf-links-coastline"}, {"title": "Donald Trump threatens to sue 'Dump Trump' internet campaigner for $25m", "publicationDate": "2013-02-19T22:13:00Z", "sentences": ["Donald Trump is threatening an online internet campaigner with a $25m lawsuit over a campaign to encourage Macy&apos;s to drop Trump&apos;s products from its shelves and his face from its advertising.", "Angelo Carusone, who set up the &apos;Dump Trump&apos; campaign last year, received a letter from Trump&apos;s attorney warning of &quot;a major, multimillion dollar lawsuit&quot; unless Carusone stops attempting to &quot;tortiously interfere with Mr Trump&apos;s business and contractual relationships&quot;.", "On Tuesday, Trump&apos;s attorney told the Guardian that Carusone was &quot;a loser&quot;, but it would appear that the business tycoon&apos;s latest threat of legal action – he is already in the process of suing comedian Bill Maher over claims of orangutan heritage – has already backfired, with Carusone promising to take his campaign to &quot;the next level&quot; over the coming weeks and months.", "Caursone said he received a letter from Trump&apos;s attorney Alan Garten in early January, in reference to his &quot;Urge Macy&apos;s to Dump Trump&quot; petition, which urges Macy&apos;s to &quot;sever ties&quot; with Trump and has garnered hundreds of thousands of signatures.", "&quot;I am litigation counsel to Donald J Trump and hereby demand that you immediately cease your malicious efforts to tortiously interfere with Mr Trump&apos;s business and contractual relationships,&quot; Garten wrote.", "&quot;Failing which, we will have no choice but to commence a major, multi-million dollar lawsuit against you, your organisation and co-conspirators.&quot; The letter, dated 27 December, said Carusone&apos;s conduct had &quot;far exceed[ed] anything protected by the constitution&quot; in seeking to disrupt Trump&apos;s business relationship with Macy&apos;s &quot;through mob-like bullying and coercion&quot;.", "&quot;You are hereby forewarned that in the event that you continue your unlawful actions, including, without limitation, your interference with contract, Mr Trump will immediately sue you for compensatory, consequential and punitive damages, and seek not less than $25,000,000.00 in damages,&quot; Garten&apos;s letter concluded.", "The petition, which is still live and was continuing to attract signatures on Tuesday, says Macy&apos;s should drop Trump due to his &quot;especially unpleasant, nasty and despicable behaviour&quot;.", "He said he had considered ending the &apos;Dump Trump&apos; campaign in the face of the potential legal action.", "&quot;These things can get messy, and I&apos;m aware of that, and Donald Trump is volatile, and extremely wealthy, so that&apos;s a potent combination right there, and he seemed very frustrated,&quot; Carusone said.", "He said his lawyers had contacted Trump&apos;s attorney asking for evidence of where Carusone had been defamatory and had not heard back.", "Carusone said the campaign could resume the deployment of anti-Trump mobile billboards at Macy&apos;s sites.", "When you&apos;re having one of these singers or musicians down to Macy&apos;s to the next big event that they do, having some big event there in the form of an advertisement or individuals is part of the process too.&quot; That news is unlikely to please the outspoken star of the US Apprentice, who has a history of taking legal action against those taking the Trump name in vain.", "The letter to Carusone hints at Trump&apos;s litigious past, urging him to &quot;look no further than former Miss Pennsylvania Sheena Monnin, who just last week found herself on the wrong side of a $5m judgment in favour of Mr Trump after falsely stating in the press that the Trump-owned Miss USA pageant was both &quot;fixed&quot; and &quot;trashy&quot;.", "Trump is also in the process of suing comedian Bill Maher over yet-to-be-resolved claims regarding Trump&apos;s ancestry.", "Trump claims he can definitively prove  that he is not part orangutan and is seeking $5m in damages for Maher suggesting otherwise.", "Garten told the Guardian that Carusone &quot;is desperate for attention&quot; and said it was a &quot;dead story&quot;, although he said it was still possible that Trump could sue for $25m.", "I wrote the guy a letter two months ago, it&apos;s dated December 27th, it&apos;s had no impact on sales, Mr Trump&apos;s line is doing phenomenally well at Macy&apos;s, and the guy is just trying to revive a dead story.&quot; Asked why the legal threat was made if the campaign had made no impact, Garten said: &quot;Sales are doing great, but it doesn&apos;t mean we&apos;re gonna sit back and allow a guy like this, who is a loser, to interfere with agreements we have with Macy&apos;s and others.&quot; Garten said: &quot;I don&apos;t know.", "We&apos;ll see how this thing plays out,&quot; when the Guardian asked if Trump would be pursuing legal action.", "He denied that Trump might be being oversensitive in his reaction to Carusone."], "webUrl": "https://www.theguardian.com/world/2013/feb/19/donald-trump-lawsuit-macys-angelo-carusone"}, {"title": "The Onion's apology for its Quvenzhané Wallis tweet – well, this is awkward | Sarah Ditum", "publicationDate": "2013-02-26T13:22:55Z", "sentences": ["Donald Trump Stares Forlornly at Tiny, Aged Penis in Mirror Before Putting on Clothes, Beginning Day starts out as a savage pillory of the business magnate and his genitals, but morphs into an oddly tender discourse on human decrepitude.", "You started reading because you hated Trump, you ended up feeling dimly sorry for him.", "And you&apos;re also not Trump, so that&apos;s a double win."], "webUrl": "https://www.theguardian.com/commentisfree/2013/feb/26/onion-c-word-tweet-quvenzhane-wallis"}, {"title": "Prince Alwaleed bin Talal insulted at only being No 26 on Forbes rich list", "publicationDate": "2013-03-05T19:37:16Z", "sentences": ["In response, the editor of the influential list has written a stinging rebuke saying the prince considers a top-10 ranking one of his priorities, systematically exaggerates his wealth and spends more time and effort than any other businessman on attempts to boost his ranking – even more time and effort than Donald Trump.", "&quot;Of the 1,426 billionaires on our list, not one – not even the vainglorious Donald Trump – goes to greater measure to try to affect his or her ranking."], "webUrl": "https://www.theguardian.com/business/2013/mar/05/prince-alwaleed-bin-talal-forbes-rich-list"}, {"title": "Donald Trump returns to speak at CPAC's conservative jamboree", "publicationDate": "2013-03-05T23:11:54Z", "sentences": ["Donald Trump and Chris Christie are both outsized personalities, but only one of them is apparently big enough to speak at the CPAC conservative gathering next week – and it is not the New Jersey governor.", "Just days after creating headlines by not inviting Christie to one of the biggest events on the Republican calendar, the American Conservative Union has again dismayed much of its core constituency by extending a hand to Trump, a reality TV star known for embracing the &quot;birther&quot; conspiracy theory that suggests Barack Obama may have been born outside the US.", "&quot;Donald Trump is an American patriot with a massive following among small-government conservatives.", "By contrast, Cardenas has had nothing but warm words for Trump on Tuesday.", "&quot;Mr Trump&apos;s previous CPAC appearance was hugely popular among our attendees, and we expect it will be even more popular this year,&quot; he said in a statement.", "That performance was a barnstormer, in which Trump earned repeated and enthusiastic applause for his die-hard brand of conservatism and showmanship.", "In trying to support another rightwing conspiracy theory, Trump has famously offered $5m for copies of Obama&apos;s college transcripts and passport application.", "During 2011, when speculation over a Trump run for the White House was at its height, Trump was held up by some observers as an example of just how extreme the Republican party had become.", "Not surprisingly, some conservative figures expressed disappointment over the invitation to Trump, especially in the light of Christie&apos;s rejection.", "CPAC has now jumped the shark by inviting the pro-choice billionaire buffoon Donald Trump,&quot; wrote Washington Post conservative columnist Jennifer Rubin."], "webUrl": "https://www.theguardian.com/world/2013/mar/05/donald-trump-speak-cpac-conference"}, {"title": "It's shameful the way Britain kowtows to the super-rich | Ian Jack", "publicationDate": "2013-03-09T08:30:00Z", "sentences": ["&quot;Of the 1,426 billionaires on our list, not one – not even the vainglorious Donald Trump – goes to greater measure to try to affect his or her ranking,&quot; she wrote."], "webUrl": "https://www.theguardian.com/commentisfree/2013/mar/09/shameful-britain-kowtows-to-super-rich"}, {"title": "Sheryl Sandberg never claimed she was writing a feminist manifesto, so why this chorus of jeers? | Hadley Freeman", "publicationDate": "2013-03-12T20:00:00Z", "sentences": ["When Donald Trump writes a book about how to get ahead in business – which ultimately is what Sandberg&apos;s book is about, but with a female emphasis – men don&apos;t write articles claiming he is being elitist (they might write articles claiming he is an idiot, but that is another story.)", "No, Trump is not attempting to speak for all men in his book but neither is Sandberg attempting to speak for all women."], "webUrl": "https://www.theguardian.com/commentisfree/2013/mar/12/sheryl-sandberg-feminist-manifesto-jeers"}, {"title": "LAPD and FBI investigate hackers who posted celebrities' financial details", "publicationDate": "2013-03-13T09:40:00Z", "sentences": ["Celebrity victims included Jay-Z, Beyoncé, Britney Spears, Kim Kardashian, Mel Gibson, Ashton Kutcher, Paris Hilton, Hulk Hogan, Arnold Schwarzenegger and Donald Trump."], "webUrl": "https://www.theguardian.com/technology/2013/mar/12/lapd-fbi-hacking-michelle-obama"}, {"title": "CPAC and the perils of becoming a Republican institution | Ana Marie Cox", "publicationDate": "2013-03-13T14:50:50Z", "sentences": ["These slightly baffling choices – not to mention the inclusion of Donald Trump – make a lot more sense in light of the biographies of CPAC&apos;s organizers."], "webUrl": "https://www.theguardian.com/commentisfree/2013/mar/13/cpac-perils-republican-institution"}, {"title": "Tiger Woods joins Michelle Obama and Biden on growing list of hacking victims", "publicationDate": "2013-03-13T16:31:39Z", "sentences": ["Other victims included Hulk Hogan and Donald Trump."], "webUrl": "https://www.theguardian.com/technology/2013/mar/13/tiger-woods-obama-biden-hacking-victims"}, {"title": "Cheers and jeers at CPAC as tough crowd gets ready for its speakers", "publicationDate": "2013-03-14T14:07:12Z", "sentences": ["At that same 2011 conference, Donald Trump – who is, for whatever reason, invited to speak again at this year&apos;s CPAC – decided to troll the Paulites as directly as possible.", "When the Paul contingent began cheering their hero&apos;s name during Trump&apos;s address, he responded, &quot;By the way, Ron Paul cannot get elected."], "webUrl": "https://www.theguardian.com/world/2013/mar/14/cpac-speakers-tough-crowd-boo"}, {"title": "CPAC 2013 – five things not to miss", "publicationDate": "2013-03-14T15:18:00Z", "sentences": ["&quot;And that together we can create a better future for America.&quot; Donald Trump: Friday, 8.45am Get up early for Trump.", "It&apos;s been a busy few months at the Trump Organisation.", "In October, Trump demanded Barack Obama reveal his passport and college details in exchange for a $5m donation to charity.", "(Trump later refused to reveal his own details when the Guardian asked, in exchange for a $0 donation to nothing).", "In January, Trump said he had uncovered definitive proof that he was not part orangutan, and sued comedian Bill Maher for $5m for suggesting otherwise.", "In February, it emerged that Trump&apos;s legal team had threatened an internet campaigner with a $25m lawsuit after 700,000 people signed a petition asking Macy&apos;s to &quot;dump&quot; the businessman from its advertising.", "Who will Trump take aim at this time?", "Trump the Race Card: Are You Sick and Tired of Being Called a Racist and You Know You&apos;re Not One?"], "webUrl": "https://www.theguardian.com/world/us-news-blog/2013/mar/14/cpac-five-things-not-to-miss"}, {"title": "Surprise CPAC takeaway: immigration reform can happen in 2013 | Heather Long", "publicationDate": "2013-03-14T20:48:00Z", "sentences": ["There&apos;s plenty to jest about at the annual gathering of American conservatives known as CPAC, starting with the fact that Sarah Palin and Donald Trump are on the speakers list at all, let alone that they&apos;re taken seriously."], "webUrl": "https://www.theguardian.com/commentisfree/2013/mar/14/cpac-reaching-out-hispanics-immigration-reform"}, {"title": "CPAC 2013: Marco Rubio and Rand Paul address GOP faithful – live", "publicationDate": "2013-03-14T21:12:55Z", "sentences": ["Donald Trump, a real-life television cartoon character, will speak at the wee hour of 8:45 tomorrow morning, followed by sneaky Senate majority leader Mitch McConnell.", "Hilarious smaller sessions on the program will include &quot;How I Learned to Stop Worrying &amp; Love Plastic Water Bottles, Fracking, Genetically Modified Food, &amp; Big Gulp Sodas&quot; and the most-hyped panel of the conference, &quot;Trump the Race Card: Are You Sick and Tired of Being Called a Racist and Know You&apos;re Not One?&quot;  Oh man, we&apos;re going to learn a lot tomorrow.", "But Cardenas, who has invited reality TV star Donald Trump to speak at the event, was holding firm as the giant conservative shindig CPAC was getting underway just outside Washington DC.", "Today&apos;s most anticipated speakers include: • Senator Marco Rubio of Florida, potential First Hispanic President • Senator Rand Paul of Kentucky, destroyer of domestic drone warfare • Texas governor Rick Perry, the hilarious failure from the 2012 Republican presidential primary season • &quot;Divisive&quot; Virginia attorney general and gubernatorial candidate Ken Cuccinelli That&apos;s right: you&apos;ll have to wait another 24 hours to see Donald Trump."], "webUrl": "https://www.theguardian.com/world/2013/mar/14/cpac-2013-conservative-conference-live"}, {"title": "Viral Video Chart: Game of Thrones, BBC ghosts and a Star Trek taster", "publicationDate": "2013-03-15T07:28:00Z", "sentences": ["Donald Trump wrote a letter of sympathy when Mark Cuban&apos;s ABC reality show The Benefactor tanked.", "Mark Cuban reads letter from Donald Trump on &apos;Tonight Show&apos;Fired up about The Apprentice 9."], "webUrl": "https://www.theguardian.com/media/media-blog/2013/mar/15/guardian-viral-video-chart"}, {"title": "Donald Trump's remedy for America: oil from Iraq to 'pay ourselves back'", "publicationDate": "2013-03-15T15:05:00Z", "sentences": ["And Donald Trump seemed happy to play the part at CPAC with a rambling speech on Friday that ranged from the evils of immigration reform to an exhortation to re-invade Iraq.", "Trump gave the first keynote of the second day of the biggest annual gathering of conservatives in the US.", "In what would have been a damaging revelation if it had come from a more credible source, Trump said &quot;high-level officials&quot; told him before the Iraq war that the US was &quot;going for the oil&quot;.", "Trump&apos;s remedy: go back for it.", "Donald Trump on Iraq&apos;s oil reserve: &quot;I say we should take it and pay ourselves back&quot; #CPAC — Cameron Joseph (@cam_joseph) March 15, 2013  Trump&apos;s speech was greeted with polite applause, and there was a standing ovation from some parts of the room, but it did not electrify the GOP base in the way that Marco Rubio or Rand Paul had done a day earlier.", "Going against the tide of opinion from the platorm at this year&apos;s CPAC conference, Trump warned against any embrace by the GOP of immigration reform: regularising the immigration status of &quot;11 million illegals&quot; would create 11 million Democrat voters, he said.", "Trump repeated a complaint that the White House wouldn&apos;t let him build one of his big tacky ballrooms on the back lawn.", "This was the problem with Mitt Romney: he didn&apos;t go on about how wealthy he was, often enough, Trump says."], "webUrl": "https://www.theguardian.com/world/2013/mar/15/donald-trump-cpac-speech-republicans-iraq"}, {"title": "Would-be Republican leaders pitch their visions for the GOP at CPAC", "publicationDate": "2013-03-15T16:25:34Z", "sentences": ["This wider identity crisis in conservative circles has hit CPAC, which faced a mini-scandal after it failed to invite any gay Republican groups or the popular but more moderate New Jersey governor Chris Christie, and yet gave a prime speaking slot to reality TV star Donald Trump, who has frequently questioned whether Obama was born in America.", "Trump did little to dispel his eccentric reputation, delivering a rambling and boastful speech."], "webUrl": "https://www.theguardian.com/world/2013/mar/15/republican-leader-hopefuls-cpac"}, {"title": "CPAC 2013: Mitt Romney urges GOP to 'listen to Chris Christie' ", "publicationDate": "2013-03-15T21:23:00Z", "sentences": ["9.01pm GMT       Adam Gabbatt brings us an incredible dispatch from a CPAC session about for those &quot;tired of being called a racist,&quot; which of course almost broke out into a race riot:  The provocatively titled “Trump the Race card: Are You Sick and Tired of Being Called a Racist and You Know You&apos;re Not One” session at CPAC descended into chaos when one delegate suggested slaves should have been grateful for being given &quot;food and shelter&quot;.", "Here are few recent examples from Donald Trump&apos;s speech:    \"A couple of years ago I saw a state dinner on the WH lawn and it was in a tent.\"", "Trump really nailing some issues here.", "#cpacscore 3/10&mdash; Ana Marie Cox (@anamariecox) March 15, 2013     \"This country has to start building things again,\" says Trump, applying all his business know how #CPACscore 6/10&mdash; Adam Gabbatt (@AdamGabbatt) March 15, 2013     Trump's solution to illegal immigration is to let people in \"from Europe\".", "Updated at 1.10pm GMT     1.00pm GMT       Donald Trump is going on a rant about how we didn&apos;t get any oil out of Iraq.", "This is actually a big revelation from Trump, assuming he&apos;s not lying, which would be a terrible assumption: several high-level officials told him before the Iraq war that we&apos;re &quot;going for the oil,&quot; which made sense to him, but then we didn&apos;t get any of the oil.", "Donald Trump on Iraq's oil reserve: \"I say we should take it and pay ourselves back\" #CPAC&mdash; Cameron Joseph (@cam_joseph) March 15, 2013        12.52pm GMT       &quot;That&apos;s the problem with the country,&quot; Trump says after detailing how the White House wouldn&apos;t let him build one of his tacky black-and-gold-paneled ballrooms on their back lawn.", "12.47pm GMT       Donald Trump ditches the traditional One Direction entrance music and goes for the theme to Celebrity Apprentice, as though he&apos;s promoting his television show.", "Starting at 8:45, a string of consecutive speakers begins with Donald Trump, who is promoting the current season of NBC&apos;s Celebrity Apprentice, followed by Senate minority leader (aka the guy who actually runs the Senate) Mitch McConnell, Senator Kelly Ayotte, and Congressman Paul Ryan, whose old prom date Mitt Romney will speak later in the afternoon."], "webUrl": "https://www.theguardian.com/world/2013/mar/15/cpac-2013-donald-trump-mitt-romney-live"}, {"title": "Picture desk live: the best news pictures of the day", "publicationDate": "2013-03-15T21:54:24Z", "sentences": ["Photograph: Eddie Keogh/Reuters         2.33pm GMT          In the limelight: Donald Trump speaks at the Conservative Political Action Conference (CPAC) in National Harbor, Maryland, USA."], "webUrl": "https://www.theguardian.com/news/2013/mar/15/picture-desk-live-the-best-news-pictures-of-the-day"}, {"title": "US republicans and conservatives flock to CPAC – in pictures", "publicationDate": "2013-03-16T10:44:00Z", "sentences": ["16' sticker, cries after meeting the former Florida governor Jeb Bush Photograph: Nicholas Kamm/AFP/Getty Images       David Keene, president of the National Rifle Association  Photograph: Pete Marovich/Getty Images       The Oak Ridge Boys, an American country and gospel quartet Photograph: Jacquelyn Martin/AP       Donald Trump speaks at the conference Photograph: Pete Marovich/ZUMA Press/Corbis       This year's theme is 'America's future: the next generation of conservatives' Photograph: Pete Marovich/ZUMA Press/Corbis       Conference goers snap pictures of former Republican presidential candidate Mitt Romney Photograph: Jim Lo Scalzo/EPA       Callista Gingrich speaks ...."], "webUrl": "https://www.theguardian.com/world/gallery/2013/mar/16/us-republicans-cpac-maryland-in-pictures"}, {"title": "CPAC 2013: an angry and beaten US right fires out scattergun wacky policies in hunt for victory", "publicationDate": "2013-03-16T14:48:22Z", "sentences": ["But then even Palin looks like a genius compared to another CPAC star, Donald Trump.", "CPAC embraced Trump but did not invite gay Republicans, with their GOProud organisation reduced to a single speaker on a single panel invited along by the Competitive Enterprise Institute."], "webUrl": "https://www.theguardian.com/world/2013/mar/16/cpac-2013-conservative-convention"}, {"title": "CPAC 2013: Sarah Palin delivers rallying call to Republican crowd", "publicationDate": "2013-03-16T22:25:00Z", "sentences": ["1.14pm GMT       The &quot;Frederick Douglass Republican&quot; who hosted yesterday&apos;s tense session/melee on race relations, K Carl Smith, passed along a statement through a spokesperson:  I was invited by the Tea Party Patriots to conduct a breakout session entitled: &quot;Trump The Race Card&quot; and share the Frederick Douglass Republican Message."], "webUrl": "https://www.theguardian.com/world/2013/mar/16/cpac-sarah-palin-newt-gingrich-live"}, {"title": "Downtown Las Vegas may have found what it's looking for", "publicationDate": "2013-03-24T20:00:01Z", "sentences": ["An antithesis to the blowdried Donald Trump, whose tower rises in the distance."], "webUrl": "https://www.theguardian.com/world/2013/mar/24/las-vegas-tony-hsieh-regeneration"}, {"title": "Quentin Tarantino: five things to thank him for on his 50th birthday", "publicationDate": "2013-03-27T15:45:00Z", "sentences": ["Django Unchained is the most racist movie I have ever seen, it sucked!&mdash; Donald J. Trump (@realDonaldTrump) February 25, 2013    Getting a rich white man to display wholehearted sensitivity to minorities will never be easy, but at least I can now choose to dress up as a sword-wielding assassin for Halloween instead of a Disney princess, and people will still recognize who I am."], "webUrl": "https://www.theguardian.com/film/filmblog/2013/mar/27/quentin-tarantino-fiftieth-birthday"}, {"title": "Green news roundup: garden birds, energy bills and Earth Hour celebrations", "publicationDate": "2013-03-28T12:24:34Z", "sentences": ["Photograph: Graham Turner for the Guardian    • Global warming predictions prove accurate• Energy minister John Hayes switches to No 10 role • Greenland halts new oil drilling licences• EU energy chief calls for no new taxes as talks begin on 2030 climate targets• Rising energy bills will be reduced with climate policies, Ed Davey says• Call for &apos;green badges&apos; and free parking for electric cars• Nuclear-free future not an option for UK energy strategy, says chief adviser• Scottish government approves windfarm opposed by Donald Trump• Scientists link frozen spring to dramatic Arctic sea ice loss On the blogs     Gas flame of boiler Photograph: Alamy    • Will the UK&apos;s climate policies really help to lower energy bills?• Rapha cycle clothes: easy to mock, but also easy to love Multimedia     NAIROBI, KENYA - MARCH 23: A light drawing to mark the annual 'Earth Hour' event during the night on March 23, 2013 in Nairobi, Kenya."], "webUrl": "https://www.theguardian.com/environment/2013/mar/28/green-light"}, {"title": "Detroit's precarious recovery: 'It just feels like something is happening here'", "publicationDate": "2013-04-15T17:16:00Z", "sentences": ["Gilbert is Donald Trump, Andrew Carnegie and Robert Moses rolled into one and could well prove just as controversial."], "webUrl": "https://www.theguardian.com/world/2013/apr/15/detroit-precarious-recovery-dan-gilbert"}, {"title": "Best for the World: the ranking that companies are queuing up to earn", "publicationDate": "2013-04-17T16:29:00Z", "sentences": ["That gives long-term assurance of the mission of the firm, says Jentri Provenzano, spokesperson for WS Badger, a US manufacturer of organic body care products and member of B Lab&apos;s elite club: &quot;So even if Donald Trump were to sweep in next week and make us an offer we couldn&apos;t refuse … he&apos;d have to follow the things that we&apos;ve set up.&quot; Companies can write the rules for their own businesses, but it ultimately falls to politicians to draw up norms for the business community at large."], "webUrl": "https://www.theguardian.com/sustainable-business/best-for-the-world-the-ranking"}, {"title": "Donald Trump's anti-windfarm ads banned over 'misleading' images", "publicationDate": "2013-04-24T06:33:51Z", "sentences": ["An ad campaign run by Donald Trump&apos;s Scottish golf resort attacking plans for a windfarm has been banned on the grounds that it was misleading.", "Trump International Golf Club Scotland (TIGS) ran ads in Dundee&apos;s Courier and Aberdeen&apos;s Press and Journal newspapers with the line &quot;Is this the future for Scotland?&quot;.", "The complainants argued Trump&apos;s ad could not back up the claim that tourism would be put in jeopardy by the windfarm, and that the image of turbines by a US motorway gave a misleading picture of what might happen in Scotland.", "&quot;We told Trump International Golf Club Scotland Ltd not to make claims unless they could be substantiated with robust evidence and not to use misleading imagery.&quot; The ad also featured a picture of Scottish first minister Alex Salmond smiling below the text: &quot;This is the same mind that backed the release of terrorist al-Megrahi, &apos;for humane reasons&apos; – after he ruthlessly killed 270 people on Pan-Am flight 103 over Lockerbie."], "webUrl": "https://www.theguardian.com/media/2013/apr/24/donald-trump-trump-anti-windfarm-ads"}, {"title": "Today's media stories from the papers", "publicationDate": "2013-04-24T08:04:57Z", "sentences": ["Photograph: PA    Lords pass defamation bill Impending reform introduced by Lords McNally and Lester could end London&apos;s status as &apos;libel capital of the world&apos; Apple profits fall for first time in a decade Tech firm beats analysts&apos; expectations for quarter as chief executive Tim Cook pins company&apos;s hopes to rising iPad sales AP Twitter hack causes panic on Wall Street Market recovers after hackers tweeted from the official AP feed that two explosions had hit the White House Attenborough to present R4 birdsong series Naturalist will join other presenters for a new weekday 90-second show at 5.58am highlighting songs of 265 UK birds Donald Trump&apos;s anti-windfarm ads banned Watchdog also says US billionaire&apos;s Scottish golf resort could not substantiate claim that tourism will be harmed by turbines ITV confirms Steve November as drama chief Head of continuing drama, who has overseen shows including Whitechapel and Foyle&apos;s War, to take over from Laura Mackie BBC appoints Danny Cohen as director of TV Current BBC1 controller, whose credits include Call the Midwife, will oversee the corporation&apos;s four main channels Lord Justice Leveson: counsel&apos;s relationship with barrister did not compromise inquiry Judge defends Carine Patry Hoskins over relationship with David Sherborne, who acted for phone-hacking victims Top comment on MediaGuardian More!"], "webUrl": "https://www.theguardian.com/media/2013/apr/24/1"}, {"title": "Liveblog: White House correspondents' dinner with Barack Obama", "publicationDate": "2013-04-28T03:36:00Z", "sentences": ["By now, even the actual &quot;White House correspondents&quot; are lucky to get seats to their dinner after the business sides of their news organizations have finished distributing their invites to, say, Justin Bieber and Donald Trump and a belligerent surfing clown or two from reality television."], "webUrl": "https://www.theguardian.com/world/2013/apr/28/white-house-correspondents-dinner-live"}, {"title": "Barack Obama plays Daniel Day-Lewis playing Barack Obama", "publicationDate": "2013-04-28T08:13:15Z", "sentences": ["Two years ago Obama used the address to poke fun at Donald Trump and the &quot;birthers&quot;, claiming to have unearthed a video as conclusive proof of his origins … which turned out to be a clip from The Lion King."], "webUrl": "https://www.theguardian.com/world/2013/apr/28/barack-obama-daniel-day-lewis"}, {"title": "Alan Johnson: The prime minister we almost had", "publicationDate": "2013-04-28T19:00:00Z", "sentences": ["&quot;The bad bit was when two cyclists went past and one of them said: &apos;Is that Donald Trump?&apos;&quot; We meet at his huge office at No 1 Parliament Street, from where he can tell the time by Big Ben."], "webUrl": "https://www.theguardian.com/politics/2013/apr/28/alan-johnson-prime-minister-almost"}, {"title": "Ronnie O'Sullivan is warned over 'obscene' gesture", "publicationDate": "2013-05-03T22:45:29Z", "sentences": ["Ronnie O&apos;Sullivan was reprimanded by the referee Michaela Tabb for making what she perceived as an obscene gesture in his World Championship semi-final against Judd Trump.", "After missing a ball in the penultimate frame he ran his hand up the shaft of his cue between his legs and Tabb stepped in to issue a reprimand, saying: &quot;Don&apos;t make obscene gestures again, OK?&quot; O&apos;Sullivan merely said he was wiping something off his cue before joking: &quot;I want to go home.&quot; But it seemed to unsettle him and Trump went on to win the frame, the longest of the match so far.", "&quot;I&apos;ve been watching these property programmes where they buy a new house, put a new kitchen in ... it sounds a bit easier than playing snooker.&quot; The quality of O&apos;Sullivan&apos;s tussle with Trump was not being replicated by last-four debutants Barry Hawkins and Ricky Walden in the second semi-final, with the pair struggling in their afternoon session."], "webUrl": "https://www.theguardian.com/sport/2013/may/03/ronnie-osullivan-obscene-gesture-world-championship"}, {"title": "Rolling Stones face pay cut as poor sales force them to slash US ticket prices", "publicationDate": "2013-05-04T12:46:12Z", "sentences": ["I feel like they are in Donald Trump or Gordon Gekko territory – just money for money&apos;s sake.&quot; By setting prices at $170 (£110) for a cheap seat, $635 for a top seat or up to $2,000 for a VIP ticket, the band alienated blue-collar fans who have kept their tours profitable through the decades."], "webUrl": "https://www.theguardian.com/music/2013/may/04/rolling-stones-face-pay-cut-ticket-prices-slashed"}, {"title": "Susan Calman finds that Scottish independence is no joke", "publicationDate": "2013-05-07T13:52:23Z", "sentences": ["In other comedy news, this column&apos;s regular guest star Donald Trump has engaged in a feud with the Daily Show host Jon Stewart, after Stewart joked that Trump&apos;s birth name was Fuckface von Clownstick.", "Trump responded to the joke (inspired by Trump&apos;s role in the &quot;birther movement&quot; that questions Barack Obama&apos;s origins) by drawing attention to Stewart&apos;s changed surname (he was born Jonathan Leibowitz) and estrangement from his father.", "&quot;Jon Stewart @TheDailyShow is a total phony,&quot; Trump tweeted."], "webUrl": "https://www.theguardian.com/stage/2013/may/07/susan-calman-scottish-independence"}, {"title": "Classic YouTube | Fergie's finest, Trumps at the snooker and a man falling off a horse", "publicationDate": "2013-05-09T08:30:00Z", "sentences": ["5) Fun and games at the snooker: two Trumps for the price of one and Ronnie O&apos;Sullivan&apos;s &quot;obscene&quot; gesture (warning: not that obscene)."], "webUrl": "https://www.theguardian.com/sport/blog/2013/may/09/classic-youtube-best-sports-clips"}, {"title": "Barbara Walters to retire from US TV - but she's not going just yet", "publicationDate": "2013-05-13T17:31:00Z", "sentences": ["Alex Pareene of Salon said she was &quot;probably as responsible as any other living person for the ridiculous and sorry state of American television journalism … Her entire public life has been an extended exercise in sycophancy and unalloyed power worship.&quot; Pareene reminded Salon&apos;s readers that Walters was buddies of such luminaries as &quot;war criminal Henry Kissinger&quot; and &quot;make-believe TV tycoon Donald Trump&quot;."], "webUrl": "https://www.theguardian.com/tv-and-radio/2013/may/13/barbara-walters-retires-tv-host"}, {"title": "I'm Dougal Trump - Where's my Tarantula By D. Trump- review", "publicationDate": "2013-05-17T14:00:00Z", "sentences": ["This book is about a little kid named Dougal Trump who writes a blog with funny recipes."], "webUrl": "https://www.theguardian.com/childrens-books-site/2013/may/17/review-im-dougal-trump-wheres-my-tarantula-d-trump"}, {"title": "A fan's tour of Local Hero locations in Scotland", "publicationDate": "2013-05-17T20:00:06Z", "sentences": ["With Tanera Mòr, an island off the north-west coast of Scotland, up for sale, and the resonance between Local Hero and Donald Trump&apos;s acquisitive adventures in Scotland, it feels like a good time to revisit the movie."], "webUrl": "https://www.theguardian.com/travel/2013/may/17/fans-tour-local-hero-locations-scotland"}, {"title": "Obama's Africa tour leaves ancestral homeland of Kenya as loser", "publicationDate": "2013-05-21T16:19:10Z", "sentences": ["At least the president will avoid jibes from Donald Trump about returning to his birthplace."], "webUrl": "https://www.theguardian.com/world/2013/may/21/obama-africa-tour-kenya-loser"}, {"title": "China's not alone in stigmatising single mothers | Barbara Ellen", "publicationDate": "2013-06-01T23:06:17Z", "sentences": ["clearly states that if you land on a property but don&apos;t buy it (probably because you&apos;ve just been charged a game-wrecking wedge of rent by a cheating smug face, who&apos;s spread out along an entire side of the board, preening and crowing like some pretend-money Donald Trump), it must be auctioned off to other players."], "webUrl": "https://www.theguardian.com/commentisfree/2013/jun/02/britain-china-single-mothers-children-ellen"}, {"title": "You can't trademark everything", "publicationDate": "2013-06-04T17:36:53Z", "sentences": ["But Donald Trump, who appears in the US version of The Apprentice, failed to trademark &quot;You&apos;re fired&quot;."], "webUrl": "https://www.theguardian.com/law/shortcuts/2013/jun/04/you-cant-trademark-everything-chanel"}, {"title": "Scottish ministers threaten action over North Kelvin Meadow planning bid", "publicationDate": "2013-06-27T14:23:34Z", "sentences": ["It puts it on the same sort of level as the campaign against Donald Trump&apos;s golf course in Aberdeenshire."], "webUrl": "https://www.theguardian.com/uk/scotland-blog/2013/jun/27/scotland-communities-northkelvin"}, {"title": "Massive Attack meet Adam Curtis: the unlikely double act", "publicationDate": "2013-06-29T23:05:00Z", "sentences": ["&quot;We now live in a world which is driven by the ideas from the past to such an extent that it makes it difficult to imagine another world that has never existed, because you can&apos;t. You become possessed by the ghosts of the past though the images of the past.&quot; A tantalising trailer promises an even more surprising onscreen supporting cast that includes &quot;Donald and Ivana Trump, Nicolae and Elena Ceausescu, Jane Fonda and Ted Turner, Hamid Karzai and his brothers, everyone in Goldman Sachs who made a killing in 2008, the neutron bomb, the Siberian punk movement, Bambi and all your worst fears&quot;."], "webUrl": "https://www.theguardian.com/music/2013/jun/30/massive-attack-adam-curtis-manchester-festival"}, {"title": "Massive Attack v Adam Curtis – review", "publicationDate": "2013-07-06T23:05:00Z", "sentences": ["Here, typically, he starts with 60s utopias, footage of doomed Pop artist Pauline Boty, who refused cancer treatment in order to save the life of her unborn daughter, is juxtaposed with the American-funded attempts to create a model town in a place called Helmand, Afghanistan… and then with nascent youth movements in Siberia and with both the dereliction of 70s New York and its rebirth in the casino capitalism of Donald Trump."], "webUrl": "https://www.theguardian.com/music/2013/jul/07/adam-curtis-massive-attack-review"}, {"title": "Scottish independence: don't be fooled by Alec Salmond's protestations of friendship | the big issue", "publicationDate": "2013-07-20T23:05:53Z", "sentences": ["But his image has, for me, been tarnished in the past two years by the shameful way in which, as illustrated in a recent Panorama, over the heads of local planners and against local opinion, he &quot;called in&quot; the decision to approve Donald Trump&apos;s arrogant golf complex plan on the Aberdeenshire coast in an area of special scientific sensitivity, riding roughshod over environmental concerns.", "It seems he did so because he bought Trump&apos;s promise of commercial benefits for Scotland, which were grossly oversold, sadly putting his judgment in question."], "webUrl": "https://www.theguardian.com/theobserver/2013/jul/21/alex-salmond-independence-trump-big-issue"}, {"title": "Twitter road trips USA: Las Vegas to Denver day one – as it happened", "publicationDate": "2013-07-22T17:49:00Z", "sentences": ["He sounds like a combination of Donald Trump and Willy Wonka."], "webUrl": "https://www.theguardian.com/travel/2013/jul/22/twitter-road-trips-las-vegas-denver"}, {"title": "Hugh Muir's diary", "publicationDate": "2013-07-23T22:00:00Z", "sentences": ["He gave an interview to Panorama and its always troublesome reporter, John Sweeney, about the local business affairs of Donald Trump – and did so on council premises."], "webUrl": "https://www.theguardian.com/politics/2013/jul/23/hugh-muir-diary-boris-johnson"}, {"title": "Graham crackers: five crazy things the South Carolina senator has said | Ana Marie Cox", "publicationDate": "2013-07-28T12:00:00Z", "sentences": ["He&apos;s safely mocked Donald Trump; he&apos;s called for more comity in the Senate and respect for traditions (as opposed to Rand Paul&apos;s &quot;political stunt&quot; filibuster), and quite reasonably pointed out out that the &quot;Tea Party [is] just unsustainable because they can never come up with a coherent vision for governing the country.&quot; His work on immigration reform has so upset Republicans in the GOP base that he may even face a primary challenge – one that no one, not even the GOP base, thinks he will lose."], "webUrl": "https://www.theguardian.com/commentisfree/2013/jul/28/graham-crackers-south-carolina-senator"}, {"title": "The Rio 2016 Olympics: sun, sea and absolutely no swimming", "publicationDate": "2013-08-01T11:00:00Z", "sentences": ["After the games, they will build princely condominiums for beautiful and wealthy people – not for the ugly and poor like us.&quot;     Top Trumps … Donald Trump plans up to five new towers for Rio's port district.", "Photograph: /Trump Towers Rio    Rio&apos;s port is another district under the spotlight of speculation for the games, where Donald Trump plans to build a wall of mirror-glass towers, “bringing a Trumpesque flair” to Brazil.", "“This mixture of major developments of the magnitude of Trump Towers, coexisting with the reality of Rio de Janeiro with the favelas.” But how far the presence of the latter is welcome in Rio&apos;s post-Olympic vision looks increasingly questionable.", "An earlier version said that the Trump Towers Rio project was expected to displace 1,000 residents.", "That is true of the broader redevelopment of Porto Maravilha, not of the Trump project itself."], "webUrl": "https://www.theguardian.com/artanddesign/architecture-design-blog/2013/aug/01/rio-2016-olympic-urban-plan-legacy"}, {"title": "Robin Robertson's favourite beach: Balmedie, Aberdeenshire, Scotland", "publicationDate": "2013-08-16T20:00:00Z", "sentences": ["Balmedie has attracted the attentions of that charmless bully, Donald Trump, who built a characteristically vulgar golf resort nearby – with the initial assistance of Alex Salmond."], "webUrl": "https://www.theguardian.com/travel/2013/aug/16/robin-robertson-balmedie-aberdeenshire-beach-scotland"}, {"title": "How to convince Wall Street to invest in energy efficiency", "publicationDate": "2013-08-26T18:10:00Z", "sentences": ["&quot;All of these smaller projects – even if you&apos;re talking about Donald Trump doing a $5m retrofit – you need 20 of those before you&apos;ll even get Goldman Sachs or Barclays or any of those folks involved,&quot; Gordon said."], "webUrl": "https://www.theguardian.com/sustainable-business/finance-business-case"}, {"title": "The Joy of Six: obscure sports leagues", "publicationDate": "2013-08-27T00:51:41Z", "sentences": ["By 1986, to the chagrin of his fellow franchise owners, the ambitions of New Jersey Generals owner and real estate tycoon Donald Trump started to outstrip those of the league&apos;s creators.", "The cheque itself made a memorable appearance in ESPN&apos;s documentary, Small Potatoes: who killed the USFL?, in which director and former USFL employee Mike Tollin presents it to Trump and generally experiences a frosty, petulant greeting from &quot;The Donald&quot;.", "Neither Trump nor any of the other owners reaped the fruits of their labour and the league folded before an aborted fourth season with debts in excess of US$163 million."], "webUrl": "https://www.theguardian.com/sport/blog/2013/aug/27/joy-of-six-obscure-leagues"}, {"title": "Grading Obama's higher education proposal: incomplete | Ana Marie Cox", "publicationDate": "2013-08-28T13:30:00Z", "sentences": ["On Saturday, New York state has filed a lawsuit against Donald Trump and &quot;Trump University&quot;, accusing the political stunt man and amateur genealogist of &quot;persistent fraudulent, illegal and deceptive conduct&quot;: apparently, the Trump institute of higher learning charged optimistic would-be moguls thousands of dollars for what amounted to standing next to a cardboard cut-out of Trump – which is probably the only way to avoid being embarrassed by his company, but still.", "Ironically, no one will be suing any elite institutions over this, despite how their con game is almost identical to Trump&apos;s: pay thousands of dollars, get your picture taken next to some overgrown plant matter, and receive a fancy piece of paper with a famous name on it at the end of the process.", "And likely Trump would have gotten away with it, too, if only he&apos;d have done what the Ivy Leagues do: turn away anyone who won&apos;t succeed anyway."], "webUrl": "https://www.theguardian.com/commentisfree/2013/aug/28/student-loan-debt-higher-education-affordability"}, {"title": "The real reason men should keep their legs together | Barbara Ellen", "publicationDate": "2013-09-21T23:06:00Z", "sentences": ["Recently, Marla Maples announced that she still pined for her &quot;great lurrve&quot;, Donald Trump, although they divorced 14 years ago."], "webUrl": "https://www.theguardian.com/commentisfree/2013/sep/22/men-legs-splayed-on-train"}, {"title": "Is there a formula for generating great business ideas?", "publicationDate": "2013-10-09T10:33:00Z", "sentences": ["Donald Trump&apos;s company Trump Organisation nearly failed twice, but with his perseverance and a belief in the concept he had created, Trump turned his luck around, maintaining his position as a real estate tycoon."], "webUrl": "https://www.theguardian.com/small-business-network/2013/oct/09/formula-ideas-generation-business-james-caan"}, {"title": "The amazing intelligence of elephants | John Sweeney", "publicationDate": "2013-10-14T10:44:51Z", "sentences": ["Science in the 21st century is at last beginning to map the intellect of elephants – and that may cause trouble for those who shoot elephants for sport, such as big game hunter Donald Trump Junior, or for profit, such as poachers exploiting the greed for ivory in China."], "webUrl": "https://www.theguardian.com/commentisfree/2013/oct/14/elephants-intelligence-pointing-hunted"}, {"title": "Populist: Items of interest this week", "publicationDate": "2013-10-26T05:00:00Z", "sentences": ["Trump card Donald Trump has hit Edward Snowden where it hurts by banning him from Miss Universe, this year held in Moscow."], "webUrl": "https://www.theguardian.com/culture/2013/oct/26/populist-the-guide"}, {"title": "Obama campaign considered replacing Biden with Hillary in 2012, book alleges", "publicationDate": "2013-11-01T15:43:24Z", "sentences": ["There was a hopefully forgotten moment in the Bosch-like churn of the 2012 presidential campaign when rumors were circulating that Donald Trump had documents showing Michelle Obama and Barack Obama had filed for divorce."], "webUrl": "https://www.theguardian.com/world/2013/nov/01/obama-campaign-considered-replacing-biden-2012"}, {"title": "Premier League clockwatch - as it happened!", "publicationDate": "2013-11-09T17:35:09Z", "sentences": ["Big night in Russia!&mdash; Donald J. Trump (@realDonaldTrump) November 9, 2013         1.47pm GMT    Good news for Southampton fans ...    Luke Shaw has reiterated his long-term commitment to Southampton amid reported interest from the likes of Manchester United and Chelsea."], "webUrl": "https://www.theguardian.com/football/2013/nov/09/premier-league-clockwatch-live"}, {"title": "Best pictures of the day - live", "publicationDate": "2013-11-12T23:50:48Z", "sentences": ["Photograph: Spencer Platt/Getty Images         3.49pm GMT          Donald Trump Jr leaves the Court of Session in Edinburgh as lawyers acting for his father, US billionaire Donald Trump, have challenged the legality of a decision to approve an offshore windfarm within view of his golf resort on the Aberdeenshire coast."], "webUrl": "https://www.theguardian.com/news/2013/nov/12/best-pictures-of-the-day-live"}, {"title": "Donald Trump asks to join legal battle against Shetland windfarm", "publicationDate": "2013-11-20T16:44:44Z", "sentences": ["Donald Trump is making a further attempt to attack Alex Salmond&apos;s policy of backing wind power by joining in a legal battle over the future of one of Europe&apos;s largest onshore windfarms.", "Trump is seeking to help the scheme&apos;s opponents defeat an appeal by the Scottish government.", "Trump is already fighting his own judicial review case against plans for a small experimental offshore windfarm with 11 turbines of different types near his golf course north of Aberdeen, with a three-day hearing last week.", "Trump has now applied to join in the appeal hearing by taking up that part of the appeal in an unofficial alliance with Sustainable Shetland.", "At a hearing in Edinburgh on Wednesday, Judge Lord Menzies allowed Trump to present a full case on joining the Viking hearing to three judges on 3 December."], "webUrl": "https://www.theguardian.com/world/2013/nov/20/donald-trump-legal-battle-shetland-windfarm"}, {"title": "I'm Dougal Trump and It's Not My Fault! by Jackie Marchant - review", "publicationDate": "2013-11-21T12:00:00Z", "sentences": ["This book is about a boy called Dougal Trump, who always gets blamed for things he doesn&apos;t do."], "webUrl": "https://www.theguardian.com/childrens-books-site/2013/nov/21/review-im-dougal-trump-not-my-fault-jackie-marchant"}, {"title": "Boris the clever cornflake gets his IQ in a twist | Michael White", "publicationDate": "2013-11-28T12:11:21Z", "sentences": ["So does Alex Salmond, currently Britain&apos;s most successful populist, a friend/courtier of self-styled outsider Rupert Murdoch and of Donald Trump."], "webUrl": "https://www.theguardian.com/politics/2013/nov/28/boris-johnson-iq-intelligence-gordon-gekko"}, {"title": "Tips for talking about the 2016 presidential nominations – a year ahead of time | Ana Marie Cox", "publicationDate": "2013-12-06T13:30:00Z", "sentences": ["On the Republican side, the words &quot;Donald Trump&quot; and &quot;Sarah Palin&quot; are actually Democratic fund-raising slogans."], "webUrl": "https://www.theguardian.com/commentisfree/2013/dec/06/2016-presidential-speculation-exageration"}, {"title": "Cinderella/A Million Miles Away – review", "publicationDate": "2013-12-12T11:46:19Z", "sentences": ["The perfunctory treatment of this central story means that, for all the life and bonhomie in the performances, good gags about Donald Trump and old-fashioned light-entertainment values, there&apos;s not enough at stake for the happy ending to move us."], "webUrl": "https://www.theguardian.com/stage/2013/dec/12/cinderella-a-million-miles-away-review"}, {"title": "BBC Sports Personality of the Year awards – as it happened | Michael Butler", "publicationDate": "2013-12-15T22:24:20Z", "sentences": ["I&apos;m an energetic doer, and should be a sales rep just like Donald Trump, Eddie Murphy, Bruce Willis, Madonna or Jack Nicholson."], "webUrl": "https://www.theguardian.com/sport/2013/dec/15/bbc-sports-personality-of-the-year-awards-live"}, {"title": "Secrecy and transatlantic trade | @guardianletters", "publicationDate": "2013-12-20T21:00:13Z", "sentences": ["This rather reminds me of Donald Trump&apos;s deal with the Scottish government to build a golf course on the Aberdeenshire coast, promising billions in investment and lots of jobs in exchange for the destruction of a site of special scientific importance (SSSI)."], "webUrl": "https://www.theguardian.com/world/2013/dec/20/secrecy-transatlantic-trade-european-union"}, {"title": "Ted Cruz 'taking steps' to renounce Canadian citizenship", "publicationDate": "2013-12-29T21:14:02Z", "sentences": ["The topic of the senator&apos;s nationality – and possibly his lofty political ambitions – reportedly came up last month, when he met with the larger-than-life real estate mogul Donald Trump, one of the most vocal skeptics regarding Obama&apos;s nationality."], "webUrl": "https://www.theguardian.com/world/2013/dec/29/ted-cruz-lawyers-renounce-canadian-citizenship"}], "sentences": 194}