{"sentences": 219, "results": [{"webUrl": "https://www.theguardian.com/sport/2014/jan/20/richard-sherman-five-best-post-game-tv-rants", "title": "Richard Sherman and the five best post-game sports rants", "publicationDate": "2014-01-20T17:34:50Z", "sentences": ["Sherman on other hand...If he played baball would get a high and tight fball.&quot;#Virginiaboys&mdash; Kate Upton (@KateUpton) January 20, 2014      &quot;@benlouix: @realDonaldTrump you are the most influential man in the world.", "And @RSherman_25 is a close second after tonight&#39;s game&quot;&mdash; Donald J. Trump (@realDonaldTrump) January 20, 2014    That may be the most sensible comment that Trump has made, well, possibly ever."]}, {"webUrl": "https://www.theguardian.com/childrens-books-site/2014/jan/23/top-10-stinky-characters", "title": "Pamela Butchart's top 10 stinky characters", "publicationDate": "2014-01-23T17:12:06Z", "sentences": ["Father Christmas Comes Up Trumps!"]}, {"webUrl": "https://www.theguardian.com/media/media-blog/2014/jan/29/spotify-how-a-busy-songwriter-youve-never-heard-of-makes-it-work-for-him", "title": "Spotify: how a busy songwriter you've never heard of makes it  work for him", "publicationDate": "2014-01-29T07:06:37Z", "sentences": ["There is an album called The Life of This Legendary American Music Man Is Quite Good, Yes, which includes tracks dedicated to Jon Hamm, Donald Trump&apos;s sons and ex-first lady Laura Bush."]}, {"webUrl": "https://www.theguardian.com/stage/2014/feb/04/rantin-review", "title": "Rantin – review", "publicationDate": "2014-02-04T15:19:17Z", "sentences": ["On the one hand, it&apos;s all beards, acoustic strums and nu-folk stylings; on the other, it&apos;s an encapsulation of a Scotland that stretches from the Stornoway ferry to a private dining room in Edinburgh, via Donald Trump&apos;s Menie Estate and a supermarket in Port Glasgow."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/feb/09/india-china-britain-empire-soft-power", "title": "To do business with India and China, Britain needs to lose its imperial swagger | Chris Huhne", "publicationDate": "2014-02-09T21:00:00Z", "sentences": ["But I noticed, on a recent visit there, bestselling Vietnamese translations of books on or by Warren Buffett, Donald Trump and Steve Jobs."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/feb/10/public-money-private-wealth-london-north-v-south", "title": "What's that sucking sound? It's all the public money and private wealth being swallowed up by London | Aditya Chakrabortty", "publicationDate": "2014-02-10T20:00:00Z", "sentences": ["Even the commonplace view that Alex Salmond is some kind of titan of politics (he&apos;s not, as the foul-up with Donald Trump demonstrates) serves to demonstrate just how unused we are to a major regional political figure."]}, {"webUrl": "https://www.theguardian.com/world/2014/feb/11/donald-trump-loses-windfarm-scottish-golf-resort", "title": "Donald Trump loses legal challenge to windfarm near his Scottish golf resort", "publicationDate": "2014-02-11T11:53:44Z", "sentences": ["Donald Trump has lost a legal action against a major experimental windfarm being built close to his golf resort in Aberdeenshire.", "Making clear he was expecting to appeal, Trump alleged there had been clear and illegal bias by the Scottish government – and that his rights under the European convention of human rights had been breached.", "Trump sought but failed last year to become a party to the Viking windfarm appeal, to support the Sustainable Shetland anti-windfarm legal case, but used that case to justify his judicial review of the EOWDC project.", "He believed that &quot;on a proper construction of the 1989 act the respondents had power to grant section 36 consent to persons such as Aberdeen Offshore Wind Farm Ltd.&quot; In a brief statement issued in New York, the Trump Organisation said: &quot;Today&apos;s decision has not altered our unwavering commitment to protect our investment in Scotland.", "Trump also alleges that the decision not to have a full planning inquiry, despite the fact it was not know what type of wind turbines would be used for the project, and that different types of machine could be used at different times, was improper.", "Doherty ruled on Tuesday that Trump&apos;s human rights were not relevant to this case, adding that he was &quot;satisfied that the [planning] minister had taken account of the experimental nature of the deployment centre; and that he was entitled to grant consent subject to the conditions which he imposed&quot;."]}, {"webUrl": "https://www.theguardian.com/uk-news/2014/feb/11/donald-trump-irish-golf-scotland-windfarm", "title": "Donald Trump buys Irish golf resort after losing Scotland court battle", "publicationDate": "2014-02-11T19:14:32Z", "sentences": ["Donald Trump has bought a five star golf resort on the west coast of Ireland after losing a legal action against a windfarm being built near his golf resort in Aberdeenshire.", "The billionaire property developer said that while he appealed against the court defeat in Scotland he would be diverting his energies to the exclusive Doonbeg golf and hotel complex on the Atlantic coastline of County Clare, restyling it the Trump International Golf Links, Ireland.", "Trump had taken the Scottish government to court over a decision to approve a major experimental windfarm in Aberdeen Bay, which will be about two miles south east of his planned £750m golf resort, because it spoilt the view.", "He alleged in the judicial review that his own human rights had been breached, because the windfarm, which is funded by the European commission and supported by many local organisations which had also backed Trump&apos;s golf resort, interfered with his &quot;peaceful enjoyment of his property&quot;.", "His claims were rejected by Lord Doherty, in the court of session in Edinburgh, but Trump said from his offices in New York: &quot;We will appeal this decision and, in the meantime, we will be focusing all of our investment and energy towards our new acquisition on the Atlantic ocean in Ireland.&quot; The Doonbeg resort was put up for sale earlier this year, reportedly priced at £12.4m, boasting an Atlantic seascape that stretches for 2.5 miles and a 218-room hotel with a spa and restaurants.", "&quot;Doonbeg is an already terrific property that we will make even better – it will soon be an unparalleled resort destination with the highest standards of luxury,&quot; Trump said.", "Trump has long threatened to decamp to Ireland if he was thwarted in his plans for the major hotel and golfing resort near Aberdeen, which are due to include a large five star hotel, timeshare apartments and a private housing estate.", "The first 18-hole course at Menie, Aberdeenshire, opened in 2012 and Trump now has planning approval for a second course, and a major club house.", "Despite admitting several years ago that the global recession had affected his plans for the resort, Trump has since insisted the expansion of the Menie estate resort was being put on hold until the windfarm scheme was dropped.", "Doherty dismissed the claims that Salmond had interfered, stating he &quot;was not persuaded that the fair-minded and informed observer would conclude that there was a real possibility of bias on the part of the decision-maker; or that the decision not to have a public inquiry had been unreasonable or unlawful.&quot; In a ruling with far wider significance for the future of Scottish wind power, the judge disputed a previous court ruling cited by Trump that no windfarm can be approved until or unless it had an electricity generation licence.", "Trump sought but failed last year to become a party to the Viking windfarm appeal, to support the Sustainable Shetland anti-windfarm legal case, but used that case to justify his judicial review of the EOWDC project.", "In a statement issued in New York, the Trump Organisation said: &quot;Today&apos;s decision has not altered our unwavering commitment to protect our investment in Scotland.", "Trump also alleges that the decision not to have a full planning enquiry was improper, as it was not known what type of wind turbines would be used for the project and that different types of machine could be used at different times.", "Doherty ruled that Trump&apos;s human rights were not relevant to this case, adding that he was &quot;satisfied that the [planning] minister had taken account of the experimental nature of the deployment centre; and that he was entitled to grant consent subject to the conditions which he imposed.&quot;"]}, {"webUrl": "https://www.theguardian.com/sport/blog/2014/feb/12/cheyenne-tiger-woods-famous-surname-golf", "title": "Cheyenne Woods shows she has got more than just a famous surname | Ewan Murray", "publicationDate": "2014-02-12T11:00:00Z", "sentences": ["Trump to save Doonbeg?", "Donald Trump has been linked with the takeover of the stunning Doonbeg Complex in County Clare, which includes a links course designed by Greg Norman.", "Trump&apos;s golfing work will come under further scrutiny during the first week of March, when the WGC-Cadillac Championship takes place at his Doral resort in Miami.", "Trump has invested $200m there, including on the redesign of the Blue Monster course.", "&quot;I want to hear that it&apos;s fair,&quot; Trump said."]}, {"webUrl": "https://www.theguardian.com/extra/quiz/2014/feb/13/extra-weekly-quiz-13-feb", "title": "The weekly quiz", "publicationDate": "2014-02-13T13:13:00Z", "sentences": ["The Man Booker Prize\n       The Costa Book Award \n       The Pulitzer Prize \n       The Folio Prize\n      \n     Donald Trump has bought a five-star golf resort on the west coast of which country?"]}, {"webUrl": "https://www.theguardian.com/film/2014/feb/16/paul-blart-mall-cop-film-recap", "title": "Paul Blart: Mall Cop recap – falling over, with style", "publicationDate": "2014-02-16T15:00:00Z", "sentences": ["It stars Kevin James, who is generally to tasteful film-making what Donald Trump is to tasteful hairdressing."]}, {"webUrl": "https://www.theguardian.com/politics/2014/feb/17/scottish-independence-oops-scenario", "title": "Scottish independence: bracing for the Oops Scenario | AL Kennedy", "publicationDate": "2014-02-17T20:17:49Z", "sentences": ["In Scotland, voters woke to discover that even Alex Salmond&apos;s desperately foolish doting upon the unconvincing hair and even less convincing finances of Donald Trump couldn&apos;t make him look a less promising prospect than business as usual as practised at Holyrood by parties controlled (and tainted) by London&apos;s influence."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/feb/24/republicans-2016-top-conservatives-on-twitter", "title": "Who's the true 'top conservative on Twitter' – and does it matter for 2016? | Ana Marie Cox", "publicationDate": "2014-02-24T16:05:17Z", "sentences": ["Donald Trump @realdonaldtrump  - 2.5m followers - Following: 43 (Notable: Steven Tyler, Magic Johnson) - 16.4 tweets per day - Most re-tweeted post: &quot;Stop congratulating Obama for killing Bin Laden.", "- Typical tweet: Quoting something nice someone else said about him or a promotion of a Trump-branded property.", "&quot;@tnaps85: If Donald Trump is our next president, America will be saved-ith and all will be well in the world.", "— Donald J. Trump (@realDonaldTrump) February 22, 2014   - He said what?", "— Donald J. Trump (@realDonaldTrump) January 29, 2014  One gets a sense of what The Donald&apos;s feed is like just from the numbers: egocentric (he&apos;s his own most-mentioned user and tweets four times as much as other possible nominees) and delusional (&quot;#trump2016&quot;).", "Though his low response percentage makes it seem like he&apos;s using Twitter to mainly to broadcast, like Trump, the replies he does make seem like genuine attempts at conversation, if not debate (he is most likely to engage with @reason, a Libertarian magazine)."]}, {"webUrl": "https://www.theguardian.com/sport/2014/mar/03/tiger-woods-doral-back-spasms-honda", "title": "Tiger Woods to make late decision on Doral thanks to back spasms", "publicationDate": "2014-03-03T12:51:25Z", "sentences": ["I will wait until Thursday and see how it feels.&quot; Woods is due to speak at a routine media conference at the Trump Doral course on Tuesday morning where, if he appears, his fitness will once again dominate the agenda."]}, {"webUrl": "https://www.theguardian.com/lifeandstyle/shortcuts/2014/mar/04/who-are-top-celebrity-tippers", "title": "Who are the top celebrity tippers?", "publicationDate": "2014-03-04T18:43:38Z", "sentences": ["Donald Trump PR mastermind that he is, Trump decisively squashed a story that he had left a gigantic $10,000 tip on an $82.27 bill at a restaurant in Santa Monica.", "It&apos;s not my signature.&quot; It is therefore a matter of record, in case it was ever in doubt, that Trump has no sense of humour."]}, {"webUrl": "https://www.theguardian.com/world/2014/mar/05/us-republicans-cpac-midterm-elections-2014", "title": "US Republicans gearing up for CPAC after year of bruising political battles", "publicationDate": "2014-03-05T22:07:35Z", "sentences": ["Other notable speakers include the perennial red-meat crowd pleasers like Donald Trump, Ann Coulter, Grover Norquist, Michele Bachmann, Newt Gingrich and unpredictable keynoter Sarah Palin."]}, {"webUrl": "https://www.theguardian.com/world/2014/mar/06/donald-trump-wayne-lapierre-cpac", "title": "Trump and LaPierre bring the fire – and the half-baked thoughts – to CPAC", "publicationDate": "2014-03-06T22:50:18Z", "sentences": ["Two of the more fiery – and sporadically coherent – speakers, who by now have become regulars on the CPAC roster, unleashed assaults on the media and American society in general in one case (NRA chief Wayne LaPierre), and on whatever happened to be flitting about his head from one second to the next in the other (Donald Trump).", "Photograph: Mike Theiler/Reuters    Following that was a stranger, and, sure, more entertaining affair: Donald Trump.", "Trump described how he had just flown in from his renovated golf resort in Florida, which is now “the greatest resort in the country,” and where he’s “created lots of jobs.” He added that he’ll soon be renovating the Old Post Office Building in Washington DC, to make it “the most luxurious hotel in the world.” Creating lots of jobs, too.", "Trump gave a rambling account of various people he’s met, anecdotes, policy views, and off-the-cuff attacks on other politicians.", "He used the word “bigly” (as in, “the Chinese are taking our jobs and they’re taking them bigly”) three times and referred to the still-alive 39th president as the “late, great Jimmy Carter.” He described Crimea as where “all the money is” to explain why Putin wants it, after a quick story about how he was in Moscow a few months ago and “Putin even sent me a present, a beautiful present with a beautiful note.” Trump, who consistently pretends to flirt with the possibility of running for elected office but never pulls the trigger, predicted that Republicans would easily take the Senate in the midterm elections this year.", "He wished “the next guy” who’s president luck, though, as he “hears” that 2017 and 2018 will be marked by “economic catastrophe.” On policy, Trump spoke out strongly against immigration reform with a path to citizenship."]}, {"webUrl": "https://www.theguardian.com/sport/2014/mar/07/doral-rory-mcilroy-tiger-woods", "title": "Rory McIlroy blows hot and cold in stormy winds at Doral", "publicationDate": "2014-03-07T00:47:00Z", "sentences": ["Hanse is responsible for the complete redesign of the Trump National course, which Donald has seemingly taken to."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/mar/07/cpac-2014-maybe-the-republicans-arent-so-insane-after-all", "title": "CPAC 2014: maybe the Republicans aren't so insane after all", "publicationDate": "2014-03-07T15:24:48Z", "sentences": ["You can’t book sideshow acts like Donald Trump, Sarah Palin and Ann Coulter and then just expect people not to notice all the chewed-up red meat and low-hanging fruit on the floor.", "Because Wayne LaPierre, president of the National Rifle Association, and Donald Trump were coming up.", "He lacked Trump’s entourage."]}, {"webUrl": "https://www.theguardian.com/sport/2014/mar/07/luke-donald-doral-redesign-criticism", "title": "Luke Donald lashes out at Doral's redesign as 'bordering on unfair'", "publicationDate": "2014-03-07T17:46:04Z", "sentences": ["The most searing criticism yet of the redesign of the Trump National course has arrived from Luke Donald, who has branded certain aspects of the Florida venue &quot;bordering on unfair&quot;.", "The Englishman, however, believes the complete overhaul of Donald Trump&apos;s Doral course has left some holes more difficult than is reasonable.", "&quot;I&apos;m sure Mr Trump wanted something pretty hard and a test for a World Golf Championships,&quot; Donald said."]}, {"webUrl": "https://www.theguardian.com/sport/2014/mar/08/rory-mcilroy-wgc-florida-graeme-mcdowell", "title": "Rory McIlroy copes with wind and tough course to stay in touch at WGC", "publicationDate": "2014-03-08T00:27:00Z", "sentences": ["Amid winds which gusted up to 32mph, and on a revamped Trump National course on which several pins were frankly in ridiculous spots, the best golfers in the world were made to look rather silly at times.", "&quot;I&apos;m sure Mr Trump wanted something pretty hard and a test for a World Golf Championship,&quot; said Luke Donald."]}, {"webUrl": "https://www.theguardian.com/uk-news/2014/mar/09/oxford-parkway-train-station-increase-house-prices-commuters", "title": "Oxford Parkway station will lead to rise in house prices and commuter numbers", "publicationDate": "2014-03-09T16:02:55Z", "sentences": ["You don&apos;t need to be Donald Trump to figure out what it will do to property prices."]}, {"webUrl": "https://www.theguardian.com/sport/2014/mar/10/rory-mcilroy-doral-graeme-mcdowell", "title": "Rory McIlroy leaves Doral and makes case for staying on the sidelines", "publicationDate": "2014-03-10T22:00:02Z", "sentences": ["I quite enjoyed it.&quot; A total of 318 balls were hit into water hazards during the second WGC event of the year and there should be no surprise attached to the defence of the Blue Monster by its owner, Donald Trump."]}, {"webUrl": "https://www.theguardian.com/environment/planet-oz/2014/mar/11/climate-change-antarctic-sea-ice-expedition", "title": "What's going on with global warming and Antarctica's growing sea ice? | Graham Readfearn", "publicationDate": "2014-03-11T08:04:00Z", "sentences": ["&quot;This very expensive GLOBAL WARMING bullshit has got to stop,&quot; Tweeted Donald Trump."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/mar/24/joe-scarborough-2016-math-running-for-president", "title": "Joe Scarborough + 2016 - any chance = the new math of running for president | Michael Wolff", "publicationDate": "2014-03-24T16:12:38Z", "sentences": ["You might have expected that Donald Trump would have given a bad odor to rich guys using the campaign system for their own advantage and entertainment.", "But the Trump effect may well be to make everyone else look more legitimate."]}, {"webUrl": "https://www.theguardian.com/lifeandstyle/2014/mar/25/tech-test-eco-action-trumps", "title": "Green apps and gadgets: Eco Action Trumps", "publicationDate": "2014-03-25T12:27:00Z", "sentences": ["This week I&apos;ve become slightly addicted to Eco Action Trumps, a free app that turns green actions into a game of top trumps.", "Mr Bio keeps winning!&quot; Online reviewers went crazy for Eco Action TrumpsThere were 31 reviews on iTunes, and everyone gave it five stars.", "Illustration: Eco Top Trumps    My own verdict – the minus points• I kept losing.", "But that seems counter productive.• Unlike the card version of Eco Action Trumps, the app doesn&apos;t include information on the specific benefits of a particular action, such as why wrapping your boiler will save you money, or why a south-facing roof makes you the perfect candidate for solar panels.• I felt at a disadvantage with the cards I had to pick."]}, {"webUrl": "https://www.theguardian.com/world/2014/mar/31/nra-board-member-criticises-gun-advocates", "title": "NRA board member criticises angry rhetoric at pro-gun rallies", "publicationDate": "2014-03-31T19:50:43Z", "sentences": ["King has come under fire from some quarters for saying he would not attend Tuesday&apos;s rally, which is expected to feature Donald Trump, Republican gubernatorial candidate Rob Astorino, and Carl Paladino, a former GOP candidate who lost to governor Andrew Cuomo."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/apr/07/party-politicians-india-elections-bjp-aap", "title": "Karaoke politics will be good for Indian voters | Amit Chaudhuri", "publicationDate": "2014-04-07T06:00:11Z", "sentences": ["Reflecting on the fact that a particular issue of the New York Review of Books had given equal space to a book by Joseph Brodsky (the poet and Nobel Prize winner) and another by Ivana Trump, the Croatian novelist Dubravka Ugresic wrote: &quot;It would have been difficult for Brodsky to become a brilliant skier, while it was easy for Trump to go from being a skier to writer ...&quot; In the realm of culture, then, this new phase of self-expression has been at once liberating and disastrous."]}, {"webUrl": "https://www.theguardian.com/world/2014/apr/12/republican-presidential-hopefuls-healthcare-new-hampshire", "title": "Rand Paul and Ted Cruz join Republican hopefuls in New Hampshire", "publicationDate": "2014-04-12T18:25:49Z", "sentences": ["Other speakers at the &quot;Freedom Summit&quot; included the real estate mogul Donald Trump, the former House speaker Newt Gingrich (a 2012 candidate) and the New Hampshire senator Kelly Ayotte.", "Donald Trump speaks at the Freedom Summit."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/apr/22/chelsea-clinton-pregancy-hillary-clinton-grandmother-conspiracies", "title": "Chelsea Clinton's pregnancy gives birth to new conspiracies | Hadley Freeman", "publicationDate": "2014-04-22T15:19:36Z", "sentences": ["No, not birtherism as in the nonsensical conspiracy theory about Barack Obama actually being born in Kenya, once so popular among political geniuses including Donald Trump."]}, {"webUrl": "https://www.theguardian.com/theguardian/2014/apr/24/no-votes-trump-card-alex-salmond", "title": "No vote's Trump card | @guardianletters", "publicationDate": "2014-04-24T20:00:03Z", "sentences": ["In response to Robert Irvine (Letters, 24 April), where was Alex Salmond&apos;s respect for collective decision-making when he overrode local objection, both popular and elected, to Donald Trump&apos;s wanton destruction of a site of significant interest and a beautiful natural amenity at Balmedie, near Aberdeen?Maggie and Henry PhillipsStockport • It&apos;s important not to confuse high camp (Letters, 23 April) with mincing, lisping effeminacy or &quot;low&quot; camp."]}, {"webUrl": "https://www.theguardian.com/sport/2014/apr/29/donald-trump-turnberry-golf-course-resort", "title": "Donald Trump confirms purchase of iconic Turnberry golf course and resort", "publicationDate": "2014-04-29T22:22:39Z", "sentences": ["Donald Trump has confirmed his purchase of the iconic Turnberry resort and golf course in Ayrshire.", "The sum is undisclosed but Trump is believed to have paid considerably less than the £52m Leisurecorp bought the venue for in 2008.", "The subsequent economic crash effectively led to Turnberry being on the market immediately with Trump&apos;s name routinely linked with a buyout.", "Within the last week, that speculation intensified with the deal now confirmed by Trump himself.", "&quot;It was an opportunity, as far as I was concerned,&quot; Trump told golf.com.", "Our aim is to make it the finest golf hotel in the world.&quot; Trump was uncharacteristically coy when asked if one of the most famous venues in golf will bear his name.", "&quot;Trump Turnberry&apos; has a nice ring to it, doesn&apos;t it?&quot; he said.", "Still, the Royal &amp; Ancient&apos;s outgoing chief executive, Peter Dawson, offered a public welcome to Trump&apos;s latest golfing move.", "&quot;Donald Trump is investing in golf properties in Great Britain and Ireland.", "&quot;I&apos;m quite sure if he does buy Turnberry, he will be putting a lot of investment in.&quot; Trump was similarly upbeat about his relationship with the R&amp;A, which promises to be a source of intrigue.", "I won&apos;t do anything to the golf course at all without their full stamp of approval.&quot; Trump&apos;s newly-built International Links on the outskirts of Aberdeen has seen the businessman embroiled in high-profile rows with the local community and the Scottish government.", "A plan to place wind turbines within view of the course infuriated Trump to the extent that he took legal action in a bid to halt it.", "A court ruling went against Trump earlier this year.", "As recently as last month, Trump insisted he would divert attention away from Scotland and towards the Doonbeg course he recently purchased in Ireland.", "&quot;I said until they give up that charade of these ugly turbines that kill all the birds and probably make people sick with the humming noise and just destroys the environment, until they give that up [we won&apos;t invest any more],&quot; Trump said."]}, {"webUrl": "https://www.theguardian.com/sport/blog/2014/apr/30/us-open-course-pinehurst-rory-mcilroy-golf", "title": "US Open course proves Rory McIlroy is right to worry about golf's direction | Ewan Murray", "publicationDate": "2014-04-30T09:59:02Z", "sentences": ["So when will Donald Trump preside over his first Open Championship?", "Those perturbed by Trump&apos;s arrival should bear three things in mind; this is simply a business swapping hands from Dubai to the United States, and the new owner has an impressive track record for spending big on the sport at a time when few others will do likewise.", "Trump also represents the polar opposite of golf&apos;s crusty, oft-criticised membership culture.", "Peter Dawson, the Royal &amp; Ancient&apos;s chief executive, chuckles when recalling his early exchanges with Trump.", "Dawson duly explained the complexities and formalities associated with such a scenario; Trump marched over to inform waiting media that his Open dream was very much alive."]}, {"webUrl": "https://www.theguardian.com/sport/2014/may/10/open-royal-portrush-northern-ireland", "title": "The Open set to return to Northern Ireland's Royal Portrush in 2019", "publicationDate": "2014-05-10T21:00:01Z", "sentences": ["Royal Birkdale is the favourite to host the Open a year later and there is intrigue, too, as to when the event will return to Turnberry following the purchase of the Ayrshire resort by the American billionaire Donald Trump."]}, {"webUrl": "https://www.theguardian.com/culture/gallery/2014/may/16/10-best-celebrity-weddings", "title": "The 10 best celebrity weddings", "publicationDate": "2014-05-16T11:00:00Z", "sentences": ["The guest list was quite something too: Elizabeth Taylor as maid of honour, Michael Jackson as best man and the aisles filled by the likes of Diana Ross, Joan Collins, Mia Farrow, Lauren Bacall and Donald Trump."]}, {"webUrl": "https://www.theguardian.com/theobserver/she-said/2014/may/16/its-time-to-stop-this-competitive-sleep-deprivation", "title": "It's time to stop this competitive sleep deprivation", "publicationDate": "2014-05-16T14:18:18Z", "sentences": ["From Donald Trump’s three to four hours a night to Bill Clinton’s five to six hours when he was president and Condoleezza Rice’s habit of getting up at 4.30am to go to the gym when she was US Secretary of State, minimal sleep has become a sign of your commitment to the job."]}, {"webUrl": "https://www.theguardian.com/sport/2014/may/17/laura-davies-special-charley-hull-european-tour", "title": "Laura Davies sees a kindred have-a-go spirit in Charley Hull", "publicationDate": "2014-05-17T20:00:00Z", "sentences": ["As for women becoming R&amp;A club members, it would be brilliant but I really couldn&apos;t care less.&quot; When asked what she thinks about course owners that have stepped away from the &quot;old soldier&quot; image, such as Donald Trump, who recently acquired Turnberry, Davies cracks a smile."]}, {"webUrl": "https://www.theguardian.com/world/2014/may/19/russian-oligarchs-former-wife-wins-record-breaking-divorce-settlement", "title": "Russian oligarch's former wife awarded £2.6bn in record-breaking divorce", "publicationDate": "2014-05-19T18:35:29Z", "sentences": ["Rybolovlev&apos;s property empire extends to America, where he bought Donald Trump&apos;s Palm Beach mansion, La Maison de l&apos;Amitié in Florida in 2008."]}, {"webUrl": "https://www.theguardian.com/books/2014/may/20/edward-snowden-gets-graphic-biography-nsa-whistleblower", "title": "Edward Snowden gets his own graphic biography", "publicationDate": "2014-05-20T13:24:00Z", "sentences": ["The press has previously released graphic biographies of individuals including Hillary Clinton, Sarah Palin, Glenn Beck and Donald Trump."]}, {"webUrl": "https://www.theguardian.com/uk-news/2014/may/27/scotland-land-ownership-not-independence-issue", "title": "Scotland's land ownership is not an independence issue | @guardianletters", "publicationDate": "2014-05-27T17:38:00Z", "sentences": ["However, since the Scottish National party took over, the momentum has been lost, with the SNP apparently too willing to pay obeisance at the courts of Donald Trump and Rupert Murdoch."]}, {"webUrl": "https://www.theguardian.com/football/2014/jun/02/seven-key-facts-about-the-caxirola-vuvuzela", "title": "Seven key facts about the caxirola", "publicationDate": "2014-06-02T16:12:49Z", "sentences": ["Think of Donald Trump rolling down a hillside."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/jun/05/alistair-darling-kim-jong-il-jibe-alex-salmond-scottish-independence", "title": "Darling's Kim Jong-il jibe at Salmond does little for the Scottish debate | Lesley Riddoch", "publicationDate": "2014-06-05T16:24:05Z", "sentences": ["The party&apos;s uncanny discipline and self-control – there has been only one serious split over Nato during seven years in power – could suggest a &quot;clunking fist&quot; at work internally and Salmond&apos;s ill-judged courting of the American property tycoon Donald Trump has sometimes made him look happier in the company of &quot;big men&quot; that ordinary citizens."]}, {"webUrl": "https://www.theguardian.com/lifeandstyle/2014/jun/22/celebrity-hunters-shoot-themselves-in-foot-jeanette-winterson", "title": "Celebrity hunters – and how they shoot themselves in the foot", "publicationDate": "2014-06-22T07:30:00Z", "sentences": ["Trumped-up charges In 2012, photos emerged of Donald Jr and Eric Trump, the doofus sons of the Shredded Wheat-haired magnate, posing next to &quot;trophy&quot; carcasses of animals they&apos;d shot on a big game hunt in Zimbabwe.", "Sponsors withdrew from Trump Sr&apos;s show, Celebrity Apprentice."]}, {"webUrl": "https://www.theguardian.com/film/2014/jun/22/a-dangerous-game-edinburgh-2014-review-golf-donald-trump", "title": "A Dangerous Game: Edinburgh 2014 first look review - takes up the You've Been Trumped tale again", "publicationDate": "2014-06-22T14:54:07Z", "sentences": ["Three years ago, documentary-maker Anthony Baxter told the David vs Goliath story of Michael Forbes and Donald Trump in his film You&apos;ve Been Trumped; the former was the face of a tiny coastal community who decided to put up a fight when the latter set out to build a golf resort on the Menie estate, near Balmedie in Aberdeenshire.", "This Local Hero-ish scenario never quite found its happy ending, as Trump got his way and built his resort; now Baxter takes up the tale again, with a widened focus to examine the damage that the luxury golf course business does on a worldwide scale.", "First, Baxter inspects the aftermath of the Balmedie fight, attempting to understand how Trump got round the initial rejection of his plans by the county council while study the effects on the lives of those who had the temerity to speak up against the tycoon.", "And second, he takes a whirlwind global trip, dropping in to, among other places, Dubrovnik where a campaign is underway to stop a course being built above the city, the Mojave desert, where, incredibly, lush-looking greens are maintained via irrigation from a manmade lake containing 3bn gallons of water, and another of Trump&apos;s courses, the Bedminster National in New Jersey.", "Baxter has a lot of outrageous new material to record: in Dubrovnik, a referendum that overwhelming rejects the course is summarily ignored by politicians; in New Jersey, Trump&apos;s son blithely yacks about environmental concerns as Baxter flashes up pictures of him chopping off an elephant&apos;s tail and the like.", "Forbes, the man who Trump said lived &quot;like a pig&quot;, turns up at a swanky sponsors event to collect a Top Scot award.", "Trump&apos;s construction works have led to the land – a Site of Special Scientific Interest – being trashed; exactly the justification he used to overcome locals&apos; opposition.", "And while Forbes&apos; story may exemplify the we-shall-not-be-crushed spirit that speaks so strongly to Scotland, anyone supposing the film may somehow aid the independence campaign will have to think again: the central government come out particularly badly, entirely supine before Trump&apos;s financial might in what more than one commentator points out is Alex Salmond&apos;s own constituency.", "In the end, Baxter finally gets his interview with Trump, after the tycoon studiously avoided him for the first film.", "(Trump rather cravenly explains that he only decided to agree after You&apos;ve Been Trumped was shown on the BBC; who says our national broadcaster doesn&apos;t count?)", "Trump is just canny enough to avoid fireworks on camera, but a victory of sorts arrives when it is revealed plans to build a second golf course in Balmedie have been cancelled.", "It&apos;s certainly hard to top the primal narrative of You&apos;ve Been Trumped; A Dangerous Game lets us know there&apos;s a bigger issue at stake."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/jun/25/brain-training-opt-in-optimise-yourself-or-go-extinct", "title": "Brain training: opt-in, optimise-in, or go extinct | Justin Clemens", "publicationDate": "2014-06-25T00:00:32Z", "sentences": ["Sleep is lost time – just ask Bill Clinton, Donald Trump, or the other members of the high-powered four hours a night club."]}, {"webUrl": "https://www.theguardian.com/sport/blog/2014/jul/02/donald-trump-golf-turnberry-open", "title": "Donald Trump’s transformation will make Turnberry Open worth the wait | Ewan Murray", "publicationDate": "2014-07-02T14:09:15Z", "sentences": ["Peter Dawson raises a smile when recalling his first encounter with Donald Trump.", "It went something like this: Trump announced to the Royal and Ancient’s chief executive that he wanted a major championship to be held at his new Aberdeenshire course, which was still being built.", "Trump headed immediately for a waiting group of journalists and announced that he was in discussions with the R&amp;A about his International Links hosting a major.", "When you add the push for Royal Portrush to stage the tournament in 2019, it will be a minimum of 11 years between Turnberry Opens, or Trump Turnberry, as it has recently been christened.", "If Trump has a grievance about his other Scottish course, in Ayrshire, being made to wait in line for another Open, he hides it well.", "“I have a great regard for Peter Dawson and the R&amp;A,” Trump told the Guardian on Tuesday.", "Reading between the lines, Trump has promised renovation before hosting the Open’s return.", "On Wednesday, Trump will host a Turnberry press conference to outline his specific plans for the venue.", "Earlier ripples of fear and panic regarding news that Trump could make alterations to the famous Ailsa Course appear unnecessary.", "Yes, Trump ripped up his venue at Doral and started from scratch; but that was necessary.", "Those in the British golfing scene who lambast Trump routinely do so on the basis of personality and without much depth to their argument.", "“Turnberry is one of the world’s great courses, in a fabulous location, and it is only going to get better; we will enhance it and with the help of the R&amp;A,” Trump added.", "And this one is of the only buildings in the world which actually enhances an historic golf course.” Crucially, Trump will today sit alongside Martin Ebert when facing the media in Ayrshire.", "Trump insists the same emotion will meet his revamped Turnberry."]}, {"webUrl": "https://www.theguardian.com/tv-and-radio/2014/jul/07/hbo-leftovers-six-degrees-kevin-bacon", "title": "Playing six degrees of Kevin Bacon with HBO's The Leftovers", "publicationDate": "2014-07-07T15:09:57Z", "sentences": ["Appeared on Donald Trump&apos;s Celebrity Apprentice 4."]}, {"webUrl": "https://www.theguardian.com/media/2014/jul/14/edward-klein-blood-feud-difference-between-truth-and-lie", "title": "Edward Klein: the difference between the truth and a lie", "publicationDate": "2014-07-14T15:56:49Z", "sentences": ["At Vanity Fair, he specialised in splashy profiles of some of the decade’s biggest names, including Donald Trump, Jackie Kennedy Onassis, Diane Sawyer and Mort Zuckerman."]}, {"webUrl": "https://www.theguardian.com/travel/2014/jul/16/-sp-mount-everest-the-go-slow-guide-to-base-camp-with-a-fast-ride-home", "title": "Mount Everest: the go-slow guide to base camp – with a fast ride home", "publicationDate": "2014-07-16T06:12:42Z", "sentences": ["At Khumjung’s monastery a famed “yeti skull” fails to impress: imagine a Donald Trump combover in cowhide."]}, {"webUrl": "https://www.theguardian.com/film/filmblog/2014/jul/24/fifty-shades-of-grey-trailer-review", "title": "Fifty Shades of Grey trailer: through a glass, daftly", "publicationDate": "2014-07-25T08:15:00Z", "sentences": ["However, all of this changes when she meets …      50 Shades 2    Christian Grey, a powerful businessman who probably doesn&apos;t want to remind you of Donald Trump and yet somehow does anyway."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/aug/05/ebola-worrying-disease", "title": "Concerned about Ebola? You’re worrying about the wrong disease | James Ball", "publicationDate": "2014-08-05T14:59:12Z", "sentences": ["Even intellectual powerhouses such as Donald Trump have fallen into panic, with the mogul calling for the US to shut off all travel to west Africa and revoke citizens’ right to return to the country – who cares about fundamental rights during an outbreak?"]}, {"webUrl": "https://www.theguardian.com/science/brain-flapping/2014/aug/14/a-level-results-toddler-pass-women-opinion-piece-spoof", "title": "A-level results: a toddler could pass but young women in mid-air do best | Dean Burnett", "publicationDate": "2014-08-14T10:59:36Z", "sentences": ["Some of the most successful people ever have no A-levels at all, like Donald Trump, the Queen, Joan of Arc and Emperor Palpatine."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/aug/20/ebola-western-hysteria-health-workers-risking-lives", "title": "Ebola: amid the west’s hysteria, the real heroes are forgotten | Aminatta Forna", "publicationDate": "2014-08-20T14:30:03Z", "sentences": ["In the US, Donald Trump tweeted that American Ebola victims should not be brought home.", "Their loss will have enduring consequences in the world’s fight against the disease, yet their life’s work has received less coverage than an idiotic remark by Trump."]}, {"webUrl": "https://www.theguardian.com/film/filmblog/2014/sep/04/donald-trump-alex-salmond-golf-a-dangerous-game-golf-film", "title": "Chasing Donald Trump: how I got an interview with the tycoon, but Alex Salmond wouldn't play ball", "publicationDate": "2014-09-04T07:00:00Z", "sentences": ["Donald Trump faced some uncomfortable questions during the making of our new feature documentary, A Dangerous Game, which probes the environmental cost of luxury golf resorts, including two developed by the Trump Organisation.", "Trump even invited me to an extraordinary interview in Trump Tower in Manhattan.", "A couple of years ago, Trump had tweeted to his 2.4 million followers that I was a &quot;stupid fool&quot; during the making of our previous film, You&apos;ve Been Trumped – after my producer and I had been thrown in jail.", "He also invited me speak to his son Donald Trump Jr at Trump National, a hugely expensive golf club (with only 300 members) in a drought-prone area of New Jersey.", "The younger Trump, who works closely with his father, explained how he could call himself an environmentalist while also defending his role in a widely reported African hunting safari.", "Whatever you may think of the Trumps, they cooperated fully and answered all of our questions.", "The same can&apos;t be said of Scotland&apos;s first minister Alex Salmond, whose government made the decision to allow Trump to destroy a protected conservation site of special scientific interest, in order to build Aberdeenshire&apos;s 62nd golf course.", "Among other things, we wanted to ask the first minister on camera about the effect of the Trump golf course development on local residents, including a 90-year-old woman who hasn&apos;t had a proper water supply for four years, and about what happened to the 6,000 jobs his government promised when approving the development.", "&quot;Large-scale environmental injury and the corruption of democracy go hand in hand, they always do,&quot; said one person who did agree to talk to us, noted environmental lawyer Robert F Kennedy Jr. Trump would no doubt argue that Kennedy&apos;s words don&apos;t apply to him – for whatever you think of Donald Trump, he is prepared to go on the record.", "In this respect at least, it&apos;s perhaps time for Salmond, Norman and Dawson to follow Trump&apos;s example."]}, {"webUrl": "https://www.theguardian.com/crosswords/2014/sep/06/annotated-solutions-for-prize-26352", "title": "Annotated solutions for Prize 26,352", "publicationDate": "2014-09-06T14:01:18Z", "sentences": ["1 ice cube cryptic def   5 amenity AMEN/IT/(practicalit)Y   11 blossoming LISBON SMOG (anag)   12 stamen S&lt;TAME&gt;N   13 club room BROOM after C(o)L(o)U(r)   14 trump card TRUMP/CA&lt;R&gt;D [Donald Trump]   16 Quito mosquito (hom) [mosque Quito]   17 Omani IN/A/MO (rev)   19,24,2 emotional rollercoaster EMOTIONAL + COASTER after ROLLER   23 clueless cryptic def   26 grand opera GR&lt;AND&gt;OPER/A(ppreciate)   27 golf FLOG (rev)   28,10 Eastern Cape A PRETENCE AS (anag)   29 Reuters writers (hom with a Birmingham accent)  Down   3 cream CR&lt;E&gt;AM [(singl)E/(doubl)E]   4 bubonic C&lt;1/NOB&gt;UB (rev)   6 mosque QU(it)E after MOS(t)   7 numero uno U(ncompromising) in NO MORE UN (anag)   8 tune out chew nowt (hom)   9 concertmaster CASTER round CORNET(anag)/dru)M   15 monkey nut MON/KEY/NUT [Monday]   18 malaria AIR/A/LAM (rev)   20 tartare TART/(p)ARE   21 areolar ARE&lt;(h)OL(e)&gt;A/R(educe)   22 Renoir maestRI ONE Raised (hidden rev)   25 light double def"]}, {"webUrl": "https://www.theguardian.com/lifeandstyle/2014/sep/08/tories-donald-trump-scots-coalition-government-scotland-golf-courses", "title": "We’ve got the Tories, they’ve got Donald Trump", "publicationDate": "2014-09-08T13:27:47Z", "sentences": ["It’s about Scotland and Donald Trump.", "Who helped Trump to get his wicked way?"]}, {"webUrl": "https://www.theguardian.com/film/2014/sep/11/a-dangerous-game-review-donald-trump-scotland", "title": "A Dangerous Game review – Scottish yes voters may want to consider this", "publicationDate": "2014-09-11T21:30:10Z", "sentences": ["A sequel to director Anthony Baxter’s previous film You’ve Been Trumped of 2011, this passionate work of agit-doc follows up what’s been happening since in the ongoing battle between Scottish farmer Michael Forbes and American billionaire Donald Trump, who wants to build a golf course in Aberdeenshire in, effectively, Forbes’s backyard.", "Is this doc supposed to be a general anti-golf expose or part two of Trumped?"]}, {"webUrl": "https://www.theguardian.com/film/2014/sep/14/toronto-film-festival-2014-roundup-review-still-alice-theory-of-everything", "title": "Toronto film festival report – afflictions, addictions and angst", "publicationDate": "2014-09-13T23:01:10Z", "sentences": ["Photograph: Evan Agostini/Evan Agostini/Invision/AP    Liv Ullmann on Miss Julie … and Donald TrumpJon Stewart on Rosewater and tortureSix things we learned from Toronto 2014Salma Hayek on The ProphetJames Franco on The Sound and the Fury Reviews from Toronto     While We’re Young."]}, {"webUrl": "https://www.theguardian.com/film/2014/sep/14/a-dangerous-game-review-donald-trump-insightful-documentary", "title": "A Dangerous Game review – insightful documentary about Donald Trump", "publicationDate": "2014-09-13T23:05:10Z", "sentences": ["Anthony Baxter’s 2011 documentary You’ve Been Trumped brilliantly exposed the ruthlessness with which billionaire Donald Trump rode roughshod over local interests (personal, political, ecological) in order to build a ritzy golf course in Aberdeenshire.", "This sequel broadens the scope of the original, looking at similar cases in places like Dubrovnik while tracking Trump’s plans for a second course in Scotland, and asking important questions about the environmental and economic impact of leisure resorts for the super-rich.", "Most remarkably, Baxter finally gets an audience with Trump, who flannels and filibusters but at least does so to Baxter’s face – which is more than can be said for Alex Salmond, who allowed Trump to bully his constituents in Scotland, but ran scared from a grilling by Baxter."]}, {"webUrl": "https://www.theguardian.com/business/2014/sep/21/lodha-construction-london-expand-competition-3bn", "title": "Construction competition: Lodha plans £3bn push into London property", "publicationDate": "2014-09-21T20:40:50Z", "sentences": ["The group is building the world&apos;s tallest residential tower in its home city of Mumbai and recently launched a project there to build a 75-storey tower in partnership with Donald Trump."]}, {"webUrl": "https://www.theguardian.com/business/2014/sep/21/lodha-construction-london-expand-competition-3bn", "title": "Construction competition: Lodha plans £3bn push into London property", "publicationDate": "2014-09-21T20:40:50Z", "sentences": ["The group is building the world&apos;s tallest residential tower in its home city of Mumbai and recently launched a project there to build a 75-storey tower in partnership with Donald Trump."]}, {"webUrl": "https://www.theguardian.com/commentisfree/2014/sep/24/david-cameron-queen-purring-nine-lives-scotland", "title": "Dave’s in Her Majesty’s dog house – but the boss seems to have nine lives", "publicationDate": "2014-09-24T15:10:56Z", "sentences": ["There would have been no purring down the phone, only shrieks and wails at the prospect of Balmoral being sold off to Donald Trump and redeveloped as a luxury hotel and golf course."]}, {"webUrl": "https://www.theguardian.com/cities/2014/sep/25/utopian-hoardings-new-developments-nauseating", "title": "Could those utopian hoardings for new developments get any more nauseating?", "publicationDate": "2014-09-25T10:20:47Z", "sentences": ["A smiling man looks gleefully to the blue skies, presumably where his thinking takes place, under a similarly odd message: “Innovation: thinks differently.” A render of the cityscape from the development’s upper reaches promises “Integration: has views.” And then there’s a quote from Donald Trump: “I like thinking big."]}, {"webUrl": "https://www.theguardian.com/media/2014/sep/29/donald-trump-retweets-serial-killer-photos-in-comedians-twitter-prank", "title": "Donald Trump retweets serial killer photo in comedian's Twitter prank | Media Monkey", "publicationDate": "2014-09-29T13:28:49Z", "sentences": ["Donald Trump is famous for retweeting charity appeals and other requests on Twitter, but his generosity led to him being duped on Monday.", "Can you please RT for their memory?” Trump merrily retweeted the image, not knowing that the picture was of notorious British serial killers Fred and Rose West.", "Hi @realDonaldTrump.", "pic.twitter.com/veBxFNXnOd&mdash; Philip Bradbury (@feckhead) September 29, 2014    Trump might have been alerted to the fact it was a prank by the fact the Twitter user’s account was named @feckhead."]}, {"webUrl": "https://www.theguardian.com/media/2014/sep/30/media-briefing-tuesday-30-september", "title": "Today's media stories from the papers", "publicationDate": "2014-09-30T08:48:13Z", "sentences": ["P8Tricked Donald Trump retweets image of Fred and Rose West.", "P15 The Sun Tricked Donald Trump retweets image of Fred and Rose West.", "P23Tricked Donald Trump retweets image of Fred and Rose West.", "P2Tricked Donald Trump retweets image of Fred and Rose West."]}, {"webUrl": "https://www.theguardian.com/world/2014/oct/03/billy-ray-cyrus-tricked-into-retweeting-picture-of-jimmy-savile", "title": "Billy Ray Cyrus tricked into retweeting  picture of Jimmy Savile", "publicationDate": "2014-10-03T13:28:56Z", "sentences": ["First Donald Trump, now Billy Ray Cyrus – attempting to get celebrities to retweet pictures of notorious criminals seems to be the new thing.", "The American country star managed to fall for exactly the same trick as Trump on Friday by retweeting a request from a follower.", "Trump was not particularly amused after he was caught out earlier this week, saying the experience has taught him not to be so “nice and trusting”.", "Maybe I’ll sue.&mdash; Donald J. Trump (@realDonaldTrump) September 29, 2014      I thought I was being nice to somebody re their parents.", "Sad!&mdash; Donald J. Trump (@realDonaldTrump) September 29, 2014  "]}, {"webUrl": "https://www.theguardian.com/lifeandstyle/lostinshowbiz/2014/oct/09/ebola-crisis-worlds-celebrities-kim-kardashian-akon", "title": "Hey, celebrities. Why so quiet on the Ebola crisis?", "publicationDate": "2014-10-09T17:04:33Z", "sentences": ["The celebrity response started so well, with the appearance of Donald Trump – a man Lost in Showbiz has long come to think of as a lone voice of common sense in a world gone mad – fearlessly pinpointing the real culprits in all of this: the aid workers."]}, {"webUrl": "https://www.theguardian.com/media/2014/oct/20/piers-morgan-russell-brand-donald-trump-mail-online", "title": "Piers Morgan calls Russell Brand 'bogus revolutionary' in Donald Trump row | Media Monkey", "publicationDate": "2014-10-20T08:34:55Z", "sentences": ["In one of his first comment pieces for the site, he got stuck in to Russell Brand, calling him a “bogus revolutionary” but admitting he was “thoroughly enjoying” his online row with mogul Donald Trump.", "The feud had begun when Brand called Trump “a bit daft” in a radio interview, adding: “It’s not like he’s a person who’s a super guy or anything.", "He’s just good at Hungry Hippos, and we live in Hungry Hippo land.” Trump hit back on Twitter:    I watched Russell Brand @rustyrockets on the @jimmyfallon show the other night—what the hell do people see in Russell—a major loser!&mdash; Donald J. Trump (@realDonaldTrump) October 16, 2014      .", "@katyperry must have been drunk when she married Russell Brand @rustyrockets – but he did send me a really nice letter of apology!&mdash; Donald J. Trump (@realDonaldTrump) October 16, 2014    It didn’t take long for Brand to retaliate:    .", "@realDonaldTrump are you drunk when you write these tweets?", "@realDonaldTrump I don&#39;t think your daddy left you any witty ripostes, and everything you have you inherited.", "http://t.co/q5cJzu9OiW&mdash; Russell Brand (@rustyrockets) October 16, 2014    He also attacked Trump’s business dealings, citing an article from The Atlantic:    .", "@realDonaldTrump Also - http://t.co/Jq10umVKLF&mdash; Russell Brand (@rustyrockets) October 16, 2014    Trump then upped the ante with an Instagram video aimed at Brand’s ex, Katy Perry, asking if she was drunk when she married the star:       All this was music to the ears of Morgan, who wrote: “I like Brand personally and enjoy his splendidly linguistic comedic romps on the airwaves as much as anyone.", "But this whole ‘revolution’ he’s trying to wage is a load of old sanctimonious hog-wash.” He added he would rather be stuck on a desert island with Trump than Brand, saying: “Yet they are more similar than either would care to admit: two rich, successful, teetotal white men with healthy egos and a penchant for beautiful women, appearing on television, writing best-selling books and saying controversial things.", "The difference is that whereas Trump is supremely comfortable in his own skin, fame and wealth, Brand wants us to believe he’s now trapped in the vice-like grip of a tormented celebrity-loathing freedom fighter ... Like most great revolutionaries, he’s quite happy wallowing in his own hypocrisy.” Trump retweeted Morgan’s article and hit out again at Brand:    Thank you Piers for the wonderful article and, also, great writing.", "@piersmorgan http://t.co/LZzoDjSIez&mdash; Donald J. Trump (@realDonaldTrump) October 17, 2014      .", "Without that he would be dead—a first class dummy!&mdash; Donald J. Trump (@realDonaldTrump) October 17, 2014    With three Twitter heavyweights now in the ring, Monkey can’t wait to see where this spat will go next. "]}, {"webUrl": "https://www.theguardian.com/cities/2014/nov/04/-sp-atlantic-city-boardwalk-empire-casino-resort", "title": "End of the Boardwalk empire? The rise and demise of Atlantic City", "publicationDate": "2014-11-04T12:04:39Z", "sentences": ["Donald Trump at the Trump Taj Mahal in 1988.", "The casino – run by Trump Entertainment Resorts, which the tycoon has no active role in managing – has threatened to close in December if it doesn’t get a package of aid from city and state governments.", "Visitors arriving via toll road from the north are first confronted not by the beauty of the Atlantic Ocean, but the immensity of Trump Plaza’s empty garage.", "The mayor hopes to demolish Trump Plaza when he can.", "We got to make this transition.’”     The Trump Taj Mahal Casino.", "The parade passes the 2,248-room Trump Taj Mahal, another monument to the good times.", "A judge recently voided a contract between Trump Entertainment and its 1,100 unionised employees at the casino, essentially nixing their healthcare and pension benefits.", "Letters being removed last month from the Trump Plaza Casino, which closed in September.", "Demolishing Trump Plaza is near the top of Guardian’s wish list, as it would create a walkable corridor from the stunning beachfront to stores a few blocks inland.", "A bright red sign announcing Trump Plaza’s closure hung just feet away as the men toiled in the belly of the dead casino."]}, {"webUrl": "https://www.theguardian.com/us-news/2014/nov/07/ben-carson-2016-obamacare-slavery", "title": "Ben Carson: far-right rock star throws his hat in the Republican ring", "publicationDate": "2014-11-07T18:29:13Z", "sentences": ["(This is known as “affecting the conversation.”) Other people who know how this works include Sarah Palin, Mike Huckabee and Donald Trump."]}, {"webUrl": "https://www.theguardian.com/business/2014/nov/11/what-the-stock-market-can-teach-you-about-your-own-personality", "title": "What the stock market can teach you about your own personality", "publicationDate": "2014-11-11T12:30:01Z", "sentences": ["But then there are people like Donald Trump, who, despite many advantages, has had repeat ventures fail, filing for bankruptcy for various businesses four times.", "However, he kept trying, until he finally hit upon his most marketable asset: Donald Trump the personality.", "Making himself the product, Trump could finally say he succeeded at business.", "Donald Trump suffered four bankrupt corporate ventures but became successful by selling his brand -- a case of try, try again at work."]}, {"webUrl": "https://www.theguardian.com/sport/blog/2014/nov/12/george-o-grady-golf-tour-brody-ninyette-trump-lawrie", "title": "Golf needs to start selling itself harder than ever in post-O’Grady era | Ewan Murray", "publicationDate": "2014-11-12T12:03:30Z", "sentences": ["Lawrie and Trump win-double Friday marks a busy day.", "More intriguing, though, is the return of Donald Trump to Scotland.", "It is, however, a highly useful asset in practical terms to Trump as he seeks to return Turnberry to former glories and intensify tourist interest.", "Mystery surrounds the specific nature of Friday’s release but Trump shows little sign of scaling down his Scottish golfing aspirations – which sets him apart from the vast majority."]}, {"webUrl": "https://www.theguardian.com/politics/blog/live/2014/nov/18/coopers-immigration-speech-mays-policing-speech-politics-live-blog", "title": "Government loses vote on pubs: Politics Live blog", "publicationDate": "2014-11-18T18:15:47Z", "sentences": ["Salmond may regret falling into the orbit of Donald Trump, he says.", "Trump embodies the values of greed and over-consumption, the values of the Tea party."]}, {"webUrl": "https://www.theguardian.com/us-news/2014/nov/21/westbrook-partners-the-global-landlords-using-property-like-an-atm", "title": "Westbrook Partners: the global landlords 'using property like an ATM'", "publicationDate": "2014-11-21T19:45:15Z", "sentences": ["In 2013, Westbrook and their partners sold the portfolio for a reported $130m to New York businessman Jared Kushner, the son-in-law of Donald Trump."]}, {"webUrl": "https://www.theguardian.com/books/2014/nov/23/oscar-pistorius-trial-books-review-june-steenkamp-john-carlin-barry-bateman", "title": "Oscar Pistorius trial books review – the case that mesmerised the world", "publicationDate": "2014-11-23T09:00:03Z", "sentences": ["And, unlike the OJ Simpson case in 1995, social media stepped in with round-the-clock bloviating by everyone from experts to Donald Trump."]}, {"webUrl": "https://www.theguardian.com/science/blog/2014/nov/24/ebola-is-scary-but-antibiotic-resistance-should-scare-us-more", "title": "Ebola is scary, but antibiotic resistance should scare us more | David Robert Grimes", "publicationDate": "2014-11-24T06:00:05Z", "sentences": ["Donald Trump has declared that American citizens who are known to be infected should be denied re-entry to their home country, despite their posing a minimal threat to the health of the general public if established infection control protocols are followed."]}, {"webUrl": "https://www.theguardian.com/politics/2014/nov/27/devolution-less-haste-more-coherence-please", "title": "Devolution: we need less haste, more coherence please", "publicationDate": "2014-11-27T14:13:06Z", "sentences": ["The SNP’s record in office since 2007 has been more laird-friendly in practice – Salmond was very accommodating to Donald Trump and Crofter McMurdoch – but it’s an interesting left-populist move."]}, {"webUrl": "https://www.theguardian.com/tv-and-radio/2014/dec/02/wild-weather-richard-hammond-review", "title": "Wild Weather with Richard Hammond – review: it looks as if  a car will still get wrecked", "publicationDate": "2014-12-02T08:17:17Z", "sentences": ["He’s one of the first ever people to visit the WindEEE Research Institute in Canada, which cost $23m to make (the more big number, record wind speeds, dollars etc the better, it’s not just Top Gear science – it’s Top Trump science)."]}, {"webUrl": "https://www.theguardian.com/women-in-leadership/2014/dec/17/quiz-ridiculous-quotes-of-2014", "title": "Quiz: ridiculous quotes of 2014", "publicationDate": "2014-12-17T07:28:03Z", "sentences": ["It’s got a lot of numbers in it.”  a) George W Bush b) Ed Miliband c) George Osborne  3) “There’s only room for one bigmouth in my organisation, and that’s me.”  a) Richard Branson b) Donald Trump c) Alan Sugar  4) “My policy on cake is pro having it and pro eating it.”  a) Nick Clegg b) Boris Johnson c) Nigel Farage  5) “Would I employ you if you were obese?"]}, {"webUrl": "https://www.theguardian.com/music/musicblog/2014/dec/17/the-playlist-hip-hop-rae-sremmurd-rap-monument-young-throwback-ghostface-killah-and-krs-one", "title": "The playlist: hip-hop – Rae Sremmurd, Rap Monument, Young Throwback", "publicationDate": "2014-12-17T10:53:28Z", "sentences": ["Rae Sremmurd – Up Like Trump Paying homage to slightly incongruous figures isn’t a new hip-hop trope.", "The Atlanta duo Rae Sremmurd keep the trend going with a track suggesting they can party as hard as golf enthusiast Donald Trump."]}], "docs": 58}